{"cid": "UgzSsKbt4sFSenKFwed4AaABAg", "text": "This really seems like a guy who deserves an hour or more to tell his story and make his points. I saw that the video was over and thought \"well shit . . . \"﻿", "time": "32 minutes ago", "author": "Jessica Anne"}
{"cid": "UgyUSy_h7yM8zWjBqYh4AaABAg", "text": "Wow a cop that gets it! It'll never happen though, the prison complex, the DEA, judges, lawyers, and cops make too much money to ever legalize drugs. I could list statistics all day, or you could go to the DEA's own website to see how much we waste on this silly, unwinnable war on drugs. The land of the free has about 3 million folks in prison, and most have something to do with drugs. What's more important is I don't have the right to tell anyone what to put in their own body, nor does anyone else. Especially when it's politicians, not doctors who make these asinine policies.﻿", "time": "13 hours ago", "author": "eric t"}
{"cid": "Ugx5UKyJHBdvXmdIxK14AaABAg", "text": "The war on drugs is a war on people who consume drugs. The US just patented a drug which is just low amounts of cbd, ethanol, filler and sugar and moved it to schedule 5 which would be hilarious if it didnt make me physically ill. Its all just been about money and power with a helping of racism thrown in.﻿", "time": "13 hours ago", "author": "Zach R"}
{"cid": "UgztLzG86StfFJi_qLZ4AaABAg", "text": "A war on drugs sounds amazing, thousands of soldiers on acid throwing grenades at each other and crashing chinooks.﻿", "time": "18 hours ago", "author": "Lev Myshkin"}
{"cid": "UgyH7-hMSf6nedCO-S54AaABAg", "text": "The govt realizes how futile the drug war in regards to getting drugs of the street, its a way to control ethnic groups and dumbing down the population so they can't oppose their power by ruining them financially ans destroy motivation and priorities to do something constructive. When people are broke preoccupied and living im constant fear it makes them easy to control﻿", "time": "19 hours ago", "author": "E DubZ"}
{"cid": "UgwlgpVvzxYoQm6gpsZ4AaABAg", "text": "socialism from the same country that allows muslims to bomb, rape and pillage a once great nation. Vice is also a shit liberal podium.﻿", "time": "22 hours ago", "author": "Ben Sorrell"}
{"cid": "Ugy9MzW_M4LAV2d4Dvl4AaABAg", "text": "Excellent, I love VICE ... let’s legalise every drug and sending drug dealers and users to rehab﻿", "time": "23 hours ago", "author": "Eric Mitchell"}
{"cid": "Ugy9thu5rvpgYO3d9994AaABAg", "text": "All drugs should be decrimimalized, I dont think they should all be legal, but a drug addict should never go to prison. A non-violent drug addict needs help.﻿", "time": "1 day ago (edited)", "author": "J Wallace"}
{"cid": "UgxHXnKx1X_vGqYu1_14AaABAg", "text": "I think they need to change Vice to everybody is racist Channel﻿", "time": "1 day ago", "author": "Dan Matz"}
{"cid": "UgxCDBnlGnZr8pRBaSF4AaABAg", "text": "what does \"they were just taking a mickey\" mean?﻿", "time": "1 day ago", "author": "Octavio Vega-Orozco"}
{"cid": "UgyQauJuvXYzkhhvA5N4AaABAg", "text": "I love all the internet moralists and haters on here generalizing their perceived stereotypes fed to them by media. Instead of being fueled by this hate focus on providing useful options in dealing with a situation and improving our society in general. There’s no easy answer so most people just blindly hate furthering our social demise. This man shared his life story and what he learned so you could maybe learn something but you choose to revert to name calling. If all you doing is typing cowardly hate messages from your moms basement spreading hate then maybe you should go back to playing video games.﻿", "time": "1 day ago", "author": "Ukrainianification"}
{"cid": "UgwojDu8RpLRfPJBaPR4AaABAg", "text": "\"I just made the lives of the vulnerable more unbearable\". That's the first and likely last time that I will hear a police officer recognize that.﻿", "time": "1 day ago", "author": "Slick S"}
{"cid": "UgzBpTCgzPIpZtAel_h4AaABAg", "text": "Fucking scumbag.﻿", "time": "1 day ago", "author": "Beau"}
{"cid": "UgzBz338vbyDbSe6e7x4AaABAg", "text": "just another pig ruining peoples lives for nothing but to collect tax dollar paychecks.  i will celebrate his death﻿", "time": "1 day ago", "author": "Erik Charlat"}
{"cid": "Ugxug9qGyGUcTDg6et14AaABAg", "text": "10 Questions You Always Wanted to Ask... \"Hey bro are you a cop?\"﻿", "time": "1 day ago", "author": "peadey mclovin"}
{"cid": "UgxrNpl0yZGxlihqmgd4AaABAg", "text": "\"A stone of crack\".\n British.﻿", "time": "2 days ago", "author": "christian yates"}
{"cid": "UgyOa826C8QIUR0pBlh4AaABAg", "text": "He is a smart boi. Many people can’t accept what this man just said, regulation is the key to crime reduction and harm reduction.﻿", "time": "2 days ago", "author": "No One"}
{"cid": "UgyO6eWTDayAvmnnmph4AaABAg", "text": "So imagine meth was legal and regulated would, vice still want people taking that shit, drugs are for mugs﻿", "time": "2 days ago", "author": "first last"}
{"cid": "UgyO6eWTDayAvmnnmph4AaABAg.8liF8HuE9si8liFCurobgZ", "text": "Cannabis too, how can it be one of the only drugs that's in your system for weeks﻿", "time": "2 days ago", "author": "first last"}
{"cid": "UgxpCz_NpeH_B9v8_1B4AaABAg", "text": "its always been mainly about the money not to say racism wasn't a factor there are plenty of white people with life sentences for drug offenses.﻿", "time": "2 days ago", "author": "Andrew Logan"}
{"cid": "UgzGChcFBM2JiWysxbJ4AaABAg", "text": "Research Portugals drug policy its mind blowing Haha﻿", "time": "2 days ago", "author": "Drmoonlordx"}
{"cid": "Ugyn_whedpFoYqjGb4t4AaABAg", "text": "I like this guy he seems cool﻿", "time": "2 days ago", "author": "Carlos Trevizo"}
{"cid": "UgxwXF1iHVeu_gRtcQh4AaABAg", "text": "this shits so true he acknowledges that the entire system is built to prey upon the weak and vulnerable﻿", "time": "2 days ago", "author": "cirie"}
{"cid": "Ugxq80IqMQaJM2GMSB94AaABAg", "text": "I dress smart & to look at me you'd not likely think, he doesn't use drugs. \nThis has worked against me a few times when scoring, some dealers used to be really cagey about serving me!!﻿", "time": "2 days ago", "author": "David Watkins"}
{"cid": "UgxSdHbfV6hxOCy1tah4AaABAg", "text": "🤢🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮﻿", "time": "2 days ago", "author": "Tango Nice"}
{"cid": "UgxbHpp9iN27ttami5J4AaABAg", "text": "This sounds like a cool game﻿", "time": "2 days ago", "author": "The Nameless King"}
{"cid": "UgzYMeUJ0ITag-qw87p4AaABAg", "text": "What a truly piece of shit.  Manipulating the desperate, ruining their lives to build a case for some guy for 4 years, only for the charges stick. Undercover work needs a reform imo.  I mean I still respect what they're trying to do, but they never bust the people on the top. They go for the vulnerables. Very rarely do they get an El Chapo guy.\n\nI got respect for this slimeball, he's come to terms what he did. He's only a slimeball now, not a piece of shit. :)﻿", "time": "2 days ago (edited)", "author": "cvc"}
{"cid": "Ugw_jqVm_rF0P99U3EN4AaABAg", "text": "ive seen this ages ago!!!!! why re re-release a video?﻿", "time": "2 days ago", "author": "Laurence Anderson"}
{"cid": "Ugw_jqVm_rF0P99U3EN4AaABAg.8lhI2gNmGLz8lhloavHhcX", "text": "It's just a big massive dream that keeps on repeating﻿", "time": "2 days ago", "author": "freeagenttidy"}
{"cid": "UgzLJ2hyMy_vjaE2y6F4AaABAg", "text": "Republicans, like me, need to end the drug war.﻿", "time": "2 days ago", "author": "joshua hand"}
{"cid": "Ugy03Y4hjdLIpS-yd0p4AaABAg", "text": "What did he say at the very end?﻿", "time": "2 days ago", "author": "Long Bottom Leaf"}
{"cid": "UgwE95QUa4SRonuFp3B4AaABAg", "text": "Meth was manufactured, sold and used exclusively but whites, i t was dealt with accordingly by almost exclusively white cops and lawmakers. (Heavy penalties, control of ephedrine etc.)  STOP BLAMING WHITEY FOR EVERYTHING.﻿", "time": "2 days ago (edited)", "author": "JingleFrisbee7D"}
{"cid": "Ugy61o2qGyAaMwSPetJ4AaABAg", "text": "I agree with this guy. Criminalizing people has not worked...﻿", "time": "2 days ago", "author": "Dean Anderson"}
{"cid": "Ugw20sRak4vPJ9Gl2rF4AaABAg", "text": "\"It's always been about racism\" LOL﻿", "time": "2 days ago", "author": "jubeifyGuy guy"}
{"cid": "UgxT4CtO-3rOJJBII5F4AaABAg", "text": "Want a better insight into this mans life, go watch the podcast with him on the true Geordie podcast﻿", "time": "3 days ago", "author": "Hugo Valdivia"}
{"cid": "UgyueCSV5_Ru9e8es6F4AaABAg", "text": "Its all racist [citation needed] its vice tho... so its all racist and sexist and xenophobic 🙄🙄🙄﻿", "time": "3 days ago", "author": "CanadianImperialist"}
{"cid": "Ugy4DUDJ0Sukcp7tvKV4AaABAg", "text": "My opinion they don't have to Legalize It all they have to do is equal enforcement of users as well as dealers so people who are using the product just by having it in their system should get serious jail time guess what happens we have no more drug problems also got what they do in the Philippines﻿", "time": "3 days ago", "author": "🦄 Don't L👀k at my channel"}
{"cid": "UgwYSiNicMqULPL52ZB4AaABAg", "text": "Vice is a cancerous fucking mole on the news landscape. \n\nI remember the 90's when vice was honest and groundbreaking. Who's weak ass son took over?﻿", "time": "3 days ago", "author": "YellowTissueBox"}
{"cid": "UgyFWaxENuz_f-WaOXJ4AaABAg", "text": "This isn't true I'm just making a joke .....but all the drug trade is being run by the people are enforced to stop it it's rather simple and easy to find these corrupt people all we have to do is follow the money.﻿", "time": "3 days ago", "author": "🦄 Don't L👀k at my channel"}
{"cid": "Ugz_Ewli7h6fKEYMYsZ4AaABAg", "text": "nark﻿", "time": "3 days ago", "author": "Graeme Kelly"}
{"cid": "UgwYRyLqjQ89mZRq1QF4AaABAg", "text": "His book is the best book I have ever read. Good Cop Bad War.﻿", "time": "3 days ago", "author": "Kim Jong-un"}
{"cid": "UgwYRyLqjQ89mZRq1QF4AaABAg.8lefr2eertI8lejonaOtL1", "text": "Recommend it ?﻿", "time": "3 days ago", "author": "PiffGang NW"}
{"cid": "Ugw-bB-6Zlp_CkybMEl4AaABAg", "text": "Made me wanna watch in too deep﻿", "time": "3 days ago", "author": "Jamal Mitchell"}
{"cid": "Ugx6rdnQtZBDazh3maZ4AaABAg", "text": "Yo vice is back 👍👍﻿", "time": "3 days ago", "author": "AudibleVisible"}
{"cid": "UgwnFkYPj2sTXPwKHf54AaABAg", "text": "Great work.﻿", "time": "3 days ago", "author": "kim"}
{"cid": "Ugyr-Iw9cy7vmYCWNkx4AaABAg", "text": "The Wire !﻿", "time": "3 days ago", "author": "Y2Kvids"}
{"cid": "UgzBeKgTey4EQJfqTVt4AaABAg", "text": "Change the title to \"How to be a narc\".﻿", "time": "3 days ago", "author": "Outdoors&Cars"}
{"cid": "UgyhJ866wWC6DSN0YiV4AaABAg", "text": "What a legend. Has enough balls to pull off undercover policing, and comes off as really intelligent. Good segment!﻿", "time": "3 days ago", "author": "Dkar0"}
{"cid": "UgyISC72tue7uzcwqr14AaABAg", "text": "this makes me laugh because i live in Derby :') interesting stuff though!﻿", "time": "3 days ago", "author": "Patrick Vollering"}
{"cid": "UgwWLyZPZfcg-JzMyhh4AaABAg", "text": "Oh, fuck off yank. Its not about race, its about the fact that minorities started taking drugs en mass. White people typically dont do drugs or eventually stop.﻿", "time": "3 days ago", "author": "Jesus Christ"}
{"cid": "UgwAGp4mbNU1FLWkvkt4AaABAg", "text": "MORE PLEASE !!!﻿", "time": "3 days ago", "author": "Exxcuse me ?"}
{"cid": "UgygvUu-r0IeLDchFYZ4AaABAg", "text": "One day someone will see this comment and he'll become a successful drug lord😊😊😊😊﻿", "time": "3 days ago", "author": "ken jen"}
{"cid": "UgxZwPayeB-umAyTjgh4AaABAg", "text": "He’s lying﻿", "time": "3 days ago", "author": "Sandmanofamarillo"}
{"cid": "UgwXFpwqDzj3C0-2GVJ4AaABAg", "text": "Did this guy just say..that to get rid of the heroin epidemic..we must make it available for medical use and that’ll take away from illegal distribution/abuse...ISN’T HEROIN ALREADY USED MEDICALLY WITH AN ALTERED NAME AND THERE’S COUNTLESS CASES OF THOSE PATIENTS STRUGGLING TO GET OFF THE OPIATE ADDICTION? HEROIN IS NOT LIKE MARIJUANA LMAO. It’s only gonna become BIG BUSINESS FOR BIG PHARMA! OH YEAH, he’s a cop so I wouldn’t be surprised if he’s under the control of their establishment/his own money interests. Other than that, good video!﻿", "time": "3 days ago", "author": "Z 7IEDA"}
{"cid": "UgwUbBFzrGI94F-EehJ4AaABAg", "text": "Yup most of the time it feels like the cops are out to get you. Like if your tail light is out & they pull you over for it. Then try to use mind games to try to see if you've got something on you or give them a reason to suspect you're a criminal. \nDefinitely makes it feel like there's a contrast between us & them.﻿", "time": "4 days ago", "author": "Dead Times"}
{"cid": "UgzIZLrb74uTx6zymYh4AaABAg", "text": "All cops with a brain should know the truth about the drug war..﻿", "time": "4 days ago", "author": "Jimmy Olsson"}
{"cid": "Ugzyc1lrIQx3WopdUqV4AaABAg", "text": "Ex-cop Ex-plain﻿", "time": "4 days ago", "author": "WASTHATABULLET"}
{"cid": "Ugy5aXHBDA0IRjWCRyN4AaABAg", "text": "Is vice back? the channel is shit now and zero content on YouTube . But this is the second thing I’ve watch in a week online that I’ve enjoyed. So keep it up﻿", "time": "4 days ago", "author": "naz salabarria"}
{"cid": "Ugyln2Ls5_ZCv0TnABR4AaABAg", "text": "What a piece of shit﻿", "time": "4 days ago", "author": "Hirogochi Tomayto"}
{"cid": "UgwZri8Oj9v_9hnBYTJ4AaABAg", "text": "He a real one﻿", "time": "4 days ago", "author": "Kevin"}
{"cid": "UgxrlCPaLRefEn8jzFh4AaABAg", "text": "The first part was racist and I bet it was scary doing that stuff﻿", "time": "4 days ago", "author": "Dub 48"}
{"cid": "Ugx9TEZHmVEj5puNaWR4AaABAg", "text": "I knew a lad who sold mkat before it was illegal.\nHe would literally order it off the net and it would drop through his letterbox.\n\nWhen it became illegal i asked him what you gonna do now?\nHe said I'm going to put the price up.﻿", "time": "4 days ago", "author": "Da Stig"}
{"cid": "UgzDOuDC-dj1z9L9A294AaABAg", "text": "Like that System of a Down song said: \"All research in successful drug policies shows that treatment should be increased...and law enforcement decreased, while abolishing mandatory minimum sentencing.\"\n\nIt's state was one of the first two in the US to legalize weed and it's made life so much better for a ton of people!﻿", "time": "4 days ago", "author": "KandaPanda"}
{"cid": "UgxmeF5XCUN1dXnq4VB4AaABAg", "text": "\"BUT WHAT ABOUT THE CHILDREN?!?! SOMEBODY?!?! PLEASE THINK OF THE CHILDREN!!!!!!\"﻿", "time": "4 days ago", "author": "Memento Mori"}
{"cid": "UgyLgs2EyTChGnDz9t94AaABAg", "text": "Vulnerable people do not act on morals, they act on instinct. They are in fight of flight mode, trying to survive. The reality is most crime could be solved if people simply had a secure source of food and shelter.﻿", "time": "4 days ago", "author": "Roboko"}
{"cid": "UgxbR-I7czuvCnB5r4Z4AaABAg", "text": "Legalise it. Period.﻿", "time": "4 days ago", "author": "Jayskiallthewayski"}
{"cid": "UgzbGzLYmZWy9zx_t214AaABAg", "text": "Seeing the comments from Americans talking shit about police. Listen, yankies, our police forces are worlds apart. Ours are competent, they don't kill us on the daily. They are trained. Respected too for the most part.﻿", "time": "4 days ago", "author": "Glen Wright"}
{"cid": "Ugyobr0-jMzZu3kFwQx4AaABAg", "text": "It is true. Our own governments bring that shit in, then make money off turning their own people into addicts. We never have a heroin-epidemic until we went to War with the biggest producer of the Poppy in the world (Afghanistan). and still we raise our own children to believe in this fucked up system. We are all brainwashed in school, and this race shit has been an agenda for many decades now.\nWhat I am about to tell you is factual, do not think I am being \"racist\" by speaking the truths. Look it all up yourself. - More whites were bought as slaves in North Africa than blacks brought as\nslaves to the United States or to the 13 colonies from which it was formed.\nWhite slaves were still being bought and sold in the Ottoman Empire, decades\nafter blacks were freed in the United States. \n\nBrazil was the last country in the \nWestern world to abolish slavery. By the time it was abolished, in 1888,\nan estimated four million slaves had been imported from Africa to Brazil, 40% of the total number of slaves brought to the Americas. For reference, the United States received 10 percent. \n\nHowever, Modern slavery is a brutal reality around the\nworld. The 2016 Global Slavery Index published by the Walk Free \nFoundation estimates that 45.8 million people are in some form of \nslavery in 167 countries. 58 percent of people in slavery are living in just five countries: India, China, Pakistan, Bangladesh and Uzbekistan. The history we learn about in our schools is bias. You cannot expect people to take accountability for things that have happened before they were even born, especially when you take no accountability for things you do yourself today.\n\nOf all the African slaves that were ever taken from Africa for slavery 85% of them, (The Majority of them) where not a part of the Atlantic Slave Trade, they were the Arab Slave Trade. LOOK IT UP!!!\nOf the 180 Million that were taken in the Arab slave trade only 27 million survived. 152 million did not. Before blacks could even step foot on Arabic land they had their genitals cut off with no form of medication or antibiotics to help them. If the women got pregnant, they would let them have their babies and then kill the women after. So, 90% of African slaves died in the Arab slave trade compared to the 10% in the Atlantic slave trade. There are so many more facts that are never mentioned. The majority of black today believe “the White man” is to blame for everything, but they have no clue about the facts, because they have been brainwashed, as are the whites who feel guilty about something that happened before they were even thought about. There is a major stereotype going on, and the elites obviously want whites gone. Think about what is going to happen where whites are gone…. Just look at the countries that have no whites and you will see. \n\nMost of the slaves in the Atlantic Slave Trade went to Brazil and the Caribbean. SO why is it that America is to bear the majority of the blame for slavery? It is not just America, but it is only the (Once majority white countries) around the world. The slaves that came to America had the lowest majority of all, yet look what is being taught in our schools. Ask people living in America what they know about slavery, I bet they know nothing. I am not even speaking about the blacks who owned black slaves in their own land. Look up the first man to legally own a black slave in America and you will find Anthony Johnson, a (Black man) who wanted his slaves documented. \n\nThe people need to wake up and see, we are all puppets on stings, being played like a fiddle, for the elites. When I say elites I am thinking of those who own and run all nations, those criminals behind the monetary system we choose to be enslaved by today.﻿", "time": "4 days ago", "author": "Irish Slaves"}
{"cid": "UgzUPTQyd6qOkg-japV4AaABAg", "text": "I like how as soon as he spends time in the game, he's left with no ignorance towards users and the kind of regulations that should be in place. There was a point in my life when I was addicted to heroin. Years before that I was a youth/worship leader who studied discipleship. Absolutely anybody can get caught up in the evil of this world. Its time we show compassion, understanding and take steps forward. Every life is full of potential and is of value. Minus child predators.﻿", "time": "4 days ago", "author": "Adolescent Daydreams"}
{"cid": "UgzPWtX6vIHSwOFu8tN4AaABAg", "text": "Whaaaaaat, you mean the \"war on drugs\" is another racist endeavor?  No shit, Sherlock.﻿", "time": "4 days ago", "author": "Masha Mitchell"}
{"cid": "UgxUMzxiuaABg2iv5Fp4AaABAg", "text": "ROFLMAO! English people are the worst..﻿", "time": "4 days ago", "author": "ATITKD"}
{"cid": "UgyN1FBL1ZtmPs5PRs94AaABAg", "text": "Not interesting if hes not american.﻿", "time": "4 days ago", "author": "DEXTER MORGAN"}
{"cid": "UgzAXZtkiE0IzI7bH8N4AaABAg", "text": "fuckin narc﻿", "time": "4 days ago", "author": "a moon"}
{"cid": "UgzGHehxQMd7gySQLER4AaABAg", "text": "Scrolls down. Sees channel: VICE. Flags and leaves.﻿", "time": "4 days ago", "author": "Admiral Ackbar"}
{"cid": "Ugz_vMucLaaQ5gM9all4AaABAg", "text": "Problem with legalising illegal drugs is that the government won't make no money out of it... For instance- UK borders are very well looked after and gear is only getting through if the higher ups letting it! What was the war in afghan about? It was to make sure they kept planting poppies. I ain't making this up, it's logic and find out for yrselves﻿", "time": "4 days ago", "author": "r1ckySV"}
{"cid": "Ugy55EIZedQ6mupwFHp4AaABAg", "text": "wheres the rest of the interview?﻿", "time": "4 days ago", "author": "The Drunk Alchemist"}
{"cid": "UgzdPrv3vqQrSivugz94AaABAg", "text": "why does he think its safe for him to come out and brag about all the snitching hes done ?﻿", "time": "4 days ago", "author": "Ding Chavez"}
{"cid": "UgwHaSlbApj6WmhdziR4AaABAg", "text": "this is why we need to decriminalize drugs and criminals the police﻿", "time": "4 days ago", "author": "bham815"}
{"cid": "Ugxa6Fo_witXouVARR54AaABAg", "text": "\"I quickly found that the most vulnerable people were the one's who I could use first.\"﻿", "time": "4 days ago", "author": "Ash"}
{"cid": "UgzIKuQkQRJxGmZsytZ4AaABAg", "text": "The unanswered question: did he use while undercover and how did he deal with it while keeping focused on the job?﻿", "time": "4 days ago", "author": "Humongous Hugo"}
{"cid": "UgxGL51yUr_D7E17xZ94AaABAg", "text": "If you people keep voting conservative right-wing, you'll never see an end to the war on liberty﻿", "time": "4 days ago", "author": "Thirteen Gears"}
{"cid": "UgzhOUNSO1sqfG9T6LB4AaABAg", "text": "Or you can spice the drugs to chemically neuter the people who take them.  Problem solve.﻿", "time": "4 days ago", "author": "ChrisUAnimation"}
{"cid": "UgwdB3pge1f0fvG3zol4AaABAg", "text": "DAAAAAAAAAAAAAAAAMN﻿", "time": "4 days ago", "author": "Cubosoide"}
{"cid": "Ugyg-pc1ldDYYcyvqm94AaABAg", "text": "Why is a British cop blaming Southern Blacks and Mexicans for drug policy? Does the UK have the same problem as the USA??!?﻿", "time": "4 days ago", "author": "Na Br"}
{"cid": "UgwbWVK3hboJVTebdH54AaABAg", "text": "Harm reduction is cheaper, more effective and doesn't ruin the lives of the people/families affected by crime and drugs. Lots of countries are now stepping in the right direction and legalizing marijuna.﻿", "time": "4 days ago", "author": "TheTominator"}
{"cid": "UgzyQurROs1pv3WPprN4AaABAg", "text": "Since he spent all his life lying why would I believes him.﻿", "time": "4 days ago", "author": "From my point of view, you are upside down."}
{"cid": "UgyAQehEJK5cZcDUZ894AaABAg", "text": "This guy is a psychopath.﻿", "time": "4 days ago", "author": "BrOwN3yer0$eBUD"}
{"cid": "UgyedbPXZ9O8_WcDCWx4AaABAg", "text": "Piece of shit.﻿", "time": "5 days ago", "author": "Binko 969"}
{"cid": "Ugy-D7NC8Z3sn-pIUXF4AaABAg", "text": "ITS ALWAYS BEEN ABOUT WAYCISSIM. looks at uploader Sounds like a libshit fake new to me LOOOL﻿", "time": "5 days ago", "author": "pliskin100"}
{"cid": "Ugx6yzSKbL0z-dTXTdN4AaABAg", "text": "this is vice﻿", "time": "5 days ago", "author": "minusmodest"}
{"cid": "Ugw6mFGbhE-5iAXtEGJ4AaABAg", "text": "Excellent piece @vice but this ish is strictly UK.... In the early days we had to find a way to support the contras fighting the sandinistas so a little secret thing started at a little government agency called the central intelligence agency, extremely secretive. They decided that well if we are shipping all these guns down to these people who are down to fight against these communists..kinda. Well why don't we just fly home with cocaine laiden airplanes sell it back home to the black community we will start in SC LA bam that's the way we pay for for the war.  And then what do we start the war on drugs smh because what did the government create a fucken monster. An insatiable, unquenchable thirst for drugs and the money. South America who follow  our trends in America very closely and in Canada and in Europe originally dealt with cannabis and cocaine only little bit of black tar heroin now all you see are major shipments of powder, usually Brown amd white in color or methamphetamine shards the serious rot/kill your ass drugs..Cannabis is on the verge of being bigger than alcohol I'm hoping It's on the verge. Government just needs to figure out how they going are going to regulate and tax cash the fuck in..Even though the people we the people have already voted unanimously. Seriously some of these States need to get on board and going to boost the economy it's going to buy  the future You smoke it can cook with it, drink it, take it as a pill, a.strip similar to suboxone you can rub it on your skin, the waste material  Is not waste material at all it can be turned into clothing basically a nice sturdy strong cloth for whatever you wanna use cloth for paper rope strong rope cheap rope aka hemp   This government needs to put up thier $$ where the mouths are..The   Cannabis control commissions are ridic. Should have been ready for this a long time ago , when the voting past. Got to say best stories are these cop drugs gangs sucks to say it but so we wanna see Tommy Mortan in a fucken trap house cooking up crack, with the AK-47 loaded pointed at the camera. whyy?﻿", "time": "5 days ago (edited)", "author": "Brady"}
{"cid": "UgyK9k_W-WO0YyJttOx4AaABAg", "text": "1312﻿", "time": "5 days ago", "author": "bill greene"}
{"cid": "UgzAUqYt42ltxgN7ZNx4AaABAg", "text": "Omg its the guy who busted badger at the bus stop in breaking bad﻿", "time": "5 days ago", "author": "Drawyoursword420"}
{"cid": "UgztKrxNKLCZPhKv0Od4AaABAg", "text": "From an ex drug dealer & convicted criminal, everything this man said is 100% on point. No argument.﻿", "time": "5 days ago (edited)", "author": "Ty bot"}
{"cid": "UgysXUCk50PDJP4OW1F4AaABAg", "text": "I agree 100% with what he said about changing the drug laws. If we can make it safe and take money out of the cartels pockets it's a win win﻿", "time": "5 days ago", "author": "GLOKU"}
{"cid": "Ugxzu2qLn_GQu8ooKWl4AaABAg", "text": "Incredible...very wise man﻿", "time": "5 days ago", "author": "High Brass"}
{"cid": "UgwWin_Ng6367DCj_k94AaABAg", "text": "lol he isn't even a US cop how does this have to do with Mexico LIBERAL AGENDA VICE﻿", "time": "5 days ago", "author": "Rudy x Mitchel"}
{"cid": "Ugy1Qz_qAOcvAEzKhwR4AaABAg", "text": "The flow of drugs are not going to stop we all know that. If we really want to help people that are in active addiction then we need to rehabilitate not incarcerate.﻿", "time": "5 days ago", "author": "Bloodmoonexile"}
{"cid": "Ugx75Pz2DS3XYUq43-l4AaABAg", "text": "I thought it was going to be an American cop.﻿", "time": "5 days ago", "author": "Englewood Frank21"}
{"cid": "Ugw7KSdQXNnISSW67Tl4AaABAg", "text": "ma guy﻿", "time": "5 days ago", "author": "exogenisiss"}
{"cid": "UgwBhQAoMXB4XIJX9v54AaABAg", "text": "I really didn't expect him to say that he enjoyed the manipulating of people and maintaining the lie. Caught me off guard.﻿", "time": "5 days ago", "author": "IPIay"}
{"cid": "Ugxz-od8fTCg1FNqigt4AaABAg", "text": "woke up, took my phone, opened youtube and read\n\n„ex undercover drug cop explain what going snitch is like“﻿", "time": "5 days ago (edited)", "author": "C Rodriguez"}
{"cid": "UgyWZEMDTKTzduQ1Wdd4AaABAg", "text": "REFORM DRUG POLICY....NOW, fuckin yesterday...for the love of gawd!﻿", "time": "5 days ago", "author": "Bandit"}
{"cid": "UgxPsMNggwVwueqDnVF4AaABAg", "text": "Watch it VICE, you're still a really good but going too far left my guy.﻿", "time": "5 days ago", "author": "Kyle Hills"}
{"cid": "UgzZbeZm_KF3xZUvDgZ4AaABAg", "text": "A.C.A.B.﻿", "time": "5 days ago", "author": "sarmuraji"}
{"cid": "UgxzNCn24jgFm41Re-h4AaABAg", "text": "I need 3 more subscribers. Who got me? 🤘﻿", "time": "5 days ago", "author": "Eric Bostic"}
{"cid": "UgyC31UdsSBfEn9V0kZ4AaABAg", "text": "scum﻿", "time": "5 days ago", "author": "Mohamed Abushamma"}
{"cid": "UgwpJCKNPDcyVrpkizN4AaABAg", "text": "Why is Vice always pushing racism bs and propaganda like they are Buzzfeed now, I remember when Vice used to be cool, so normie now.﻿", "time": "5 days ago", "author": "Hidden History"}
{"cid": "Ugz70RtmwEq9024IRxt4AaABAg", "text": "I'm sure everyone knew he was undercover .﻿", "time": "5 days ago", "author": "Sydney Parks"}
{"cid": "UgwbzL2Npz6VHX38VqV4AaABAg", "text": "snitch﻿", "time": "5 days ago", "author": "medalla light"}
{"cid": "UgwCxT2yh8_R685PT494AaABAg", "text": "Who the heck edited this? The questions need to stay on the screen for at least double the amount of time.﻿", "time": "5 days ago", "author": "Brandon Carroll"}
{"cid": "UgzcFh5Zs_Q_WVDrOV54AaABAg", "text": "what utter lies. he's british, yet he's using american reasons why these drugs were banned. england banned these drugs for their own reasoning, and it wasn't fucking mexicans because they don't have any in any real numbers!﻿", "time": "5 days ago", "author": "IamSchizo"}
{"cid": "Ugw_sXfh_AjiyajNbNt4AaABAg", "text": "snitch﻿", "time": "5 days ago", "author": "Ruslan Boshirov"}
{"cid": "UgyVRRR17rl-NiiN9nx4AaABAg", "text": "And no self respecting junkie would ever give up their last lil bit of dope money. Period﻿", "time": "5 days ago", "author": "acidtone"}
{"cid": "UgygyO4B1AiW8J4x0-J4AaABAg", "text": "The racism statement makes absolutely no sense whatsoever﻿", "time": "5 days ago", "author": "acidtone"}
{"cid": "UgySTyN5MSvSSVXPFbh4AaABAg", "text": "This chap should go into politics in the UK, we need MPs with his knowledge and maybe he could educate the politicians on what the real world is like. Reform is needed.﻿", "time": "5 days ago", "author": "Shint B"}
{"cid": "UgxQ7ISjSqtoVMcpK2F4AaABAg", "text": "As someone on the \"other side\" to this guy. Hhhhhhh. That was a a release of 30 years of tension in the face of insanity... I know there's a long way to go, but this is a policeman talking objective sense..... In my opinion. X﻿", "time": "5 days ago", "author": "sheldon lunn"}
{"cid": "Ugy-N2P6bg6U6o_UXxZ4AaABAg", "text": "Cannabis has two species: Marijuana and Hemp.\nCannabis is not necessarily Marijuana.\nBut Marijuana is definitely cannabis.﻿", "time": "5 days ago", "author": "KING RJ II"}
{"cid": "UgyuqGSB6gIWBIdttMl4AaABAg", "text": "seen this interview before..﻿", "time": "5 days ago", "author": "vlad the lad"}
{"cid": "UgyeYB8RX0PcMzq_drp4AaABAg", "text": "Fake﻿", "time": "5 days ago", "author": "Pomona Town"}
{"cid": "UgxXRj-kCuoDzX9H5Mt4AaABAg", "text": "People who are criticising him and labelling him a sociopath don’t realise you cannot do his job without detaching yourself, yet there’s a difference between a true sociopath and someone whose just good at what they do. He had to learn to like some aspect of his job or it would be absolutely unbearable, it’s a coping mechanism.﻿", "time": "5 days ago", "author": "idylle♡doll"}
{"cid": "Ugz3S-kSwULn334G7014AaABAg", "text": "Amaizing video! I learned so much. He explains the drug problem very well and the possible solutions. Keep these videos coming, they are great! ❤️😍👏﻿", "time": "5 days ago (edited)", "author": "Jose Emilio Orozco"}
{"cid": "UgzNspbBBirZ-st1F5V4AaABAg", "text": "He's really smart \nAnd dangerous﻿", "time": "5 days ago", "author": "kof2002kof"}
{"cid": "Ugy5mclrBpG03pdPjjJ4AaABAg", "text": "is this a re-upload? i'm getting some intense deja-vu right now, but i think it's just that i've seen this video before.﻿", "time": "5 days ago", "author": "Rob C"}
{"cid": "Ugyu3ioMlY6rs7Aox714AaABAg", "text": "Wow! I like this guy! He knows he wasted 14 years of his life, and he feels bad about the people he fucked over. He needs to run for Prim minister of The UK!﻿", "time": "5 days ago", "author": "Dallas Tex"}
{"cid": "UgyrpcJzeADuYR9R7DR4AaABAg", "text": "finally a good vid﻿", "time": "5 days ago", "author": "Au Swirvy"}
{"cid": "UgzrOei8DwPrqrk0_fp4AaABAg", "text": "4:24 super real talk﻿", "time": "5 days ago", "author": "Cody Charlton"}
{"cid": "UgxGYSsP32qogEnw4I54AaABAg", "text": "Rat﻿", "time": "5 days ago", "author": "AJ"}
{"cid": "Ugw1pzG-yaTTkkSTptt4AaABAg", "text": "Preach mah dude.﻿", "time": "5 days ago", "author": "Slian D"}
{"cid": "UgwNTpIDR2ZDe8QBtoJ4AaABAg", "text": "Of course vice pushing the racist narrative again.﻿", "time": "5 days ago", "author": "BLUECOLLARJOHN"}
{"cid": "UgzK9ZRfEkPJ4X7ev0N4AaABAg", "text": "It’s always been about race you heard it from the horses mouth white supremacy is still real alive and well﻿", "time": "5 days ago", "author": "Chadmon Jackson"}
{"cid": "UgzXK8Ae0x65BpFgUJx4AaABAg", "text": "What I really liked.. is how he was so brutally honest about enjoying lying and manipulating people. It'd be easy to fake empathy there and say you did feel bad to show you have a heart. But he clearly did not. Honestly the dude might be a sociopath, seeing how he did so well with lying and manipulation and all. Found a career he could excel at. \n\nJust my take on it ¯\\_(ツ)_/¯﻿", "time": "5 days ago", "author": "Mitch S"}
{"cid": "UgyEsVIxEU2KGtlwci14AaABAg", "text": "Ive seen this already like a year ago.... how?﻿", "time": "5 days ago", "author": "VSVP J"}
{"cid": "UgwhMbdDDmn2TqrmoPJ4AaABAg", "text": "it is old video. already saw few month ago﻿", "time": "5 days ago", "author": "Saulius Sauliavicius"}
{"cid": "Ugyw8oJHljAEqtIj_ed4AaABAg", "text": "Read this guys book, very good.﻿", "time": "5 days ago", "author": "JT STEALTH"}
{"cid": "UgxM-5KuhsXUMz42qUh4AaABAg", "text": "Damn, it feels good to be white.﻿", "time": "5 days ago", "author": "EnVYus"}
{"cid": "UgwsJUZr_ftscDeqaqJ4AaABAg", "text": "are you a sociopath?\nYes.\nyouve got the job!﻿", "time": "5 days ago", "author": "Noble Savage"}
{"cid": "Ugwod6SFZ_1YhRC-yV94AaABAg", "text": "So thats what happened to pee wee herman﻿", "time": "5 days ago", "author": "herbsgotaZX"}
{"cid": "UgwGlXB4UZJZP_vMO994AaABAg", "text": "Ah nothing more beautiful than manipulation and deception﻿", "time": "5 days ago", "author": "HaikesXO"}
{"cid": "UgydNs0deRl981DD8sl4AaABAg", "text": "Woo showing how shit Northampton is﻿", "time": "5 days ago", "author": "robert .1"}
{"cid": "Ugwgz4wTXknZVAm-UiR4AaABAg", "text": "He makes it sound like social work except its constantly dangerous.  Impossible to imagine how stressful it is for them and also their family.  Paranoia and reality must get fused. Really amazing and extremely important work. Thank you, sir.﻿", "time": "5 days ago", "author": "Downrange Film"}
{"cid": "Ugydat6WKEB9xPWrnAN4AaABAg", "text": "Finally vice is telling the TRUTH again. They need to fire whoever keeps putting out the group identity propaganda though.﻿", "time": "5 days ago", "author": "after1001"}
{"cid": "Ugyh35F-TQ2VMmjiLSl4AaABAg", "text": "Vice, isn't this reloaded?﻿", "time": "5 days ago", "author": "Adrijus Remeškevičius"}
{"cid": "UgwedcX_OT6SagMGxc94AaABAg", "text": "It is so interesting to see him consider his life work to be entirely futile. The modern thought to legalize narcotics interesting, but his contention that use will go down sounds like a guess. Use didn't go down when alcohol prohibition was relaxed. If legalization comes with restriction, then there will always be a black market for those who don't want to jump through the hoops of social control. Of course those people wouldn't be counted in overall statistics. The strongest argument in favor of legalization would be the collapse of the fentanyl market, and the anticipated decline in crime. The increase in employment for those who dispense and monitor drug use should be offset by dramatically lower policing cost. However expecting most addicts to regain employment sounds like a pipe dream.﻿", "time": "5 days ago", "author": "spelunkerd"}
{"cid": "UgwedcX_OT6SagMGxc94AaABAg.8l_kV0TC6an8lf_bioEaH7", "text": "Alchohol use is packaged advertised sold and celebrated in our culture. We can decriminalise drugs and legalize use, taking the trade away from criminals while treating use as a serious medical issue.﻿", "time": "3 days ago", "author": "airhab airhab"}
{"cid": "UgwedcX_OT6SagMGxc94AaABAg.8l_kV0TC6an8lgvmSMAUx4", "text": "It’s not about use it’s about harm. Criminalisation increases the harm and the risk, people who choose to consume drugs would be better off obtaining in an open rather than a criminal market. MDMA is a case in point, it’s a relatively safe drug when taken correctly, it’s the criminalisation that makes it dangerous.﻿", "time": "2 days ago", "author": "Steve of Queanbeyan"}
{"cid": "UgwedcX_OT6SagMGxc94AaABAg.8l_kV0TC6an8lhHBNrtR3I", "text": "spelunkerd \nNobody really claims use decreases. The point made is that crime dramatically does.﻿", "time": "2 days ago", "author": "joshua hand"}
{"cid": "Ugx6G9eVKQ7-BGdQ5CZ4AaABAg", "text": "Wouldn’t be vice without some race card bs﻿", "time": "5 days ago", "author": "PickleishBILL"}
{"cid": "Ugy19fpVdQSCX9kJA0N4AaABAg", "text": "Regardless... he rubs me the wrong way. Even though I agree with some of the things he has said﻿", "time": "5 days ago (edited)", "author": "BEAutifulkiss21100"}
{"cid": "Ugwft2Gmo3OChbRYRDV4AaABAg", "text": "I bet the Notts cartel will catch up to this scumbag sooner or later , and they will deal with him v severely.......he's a dead man walking tbh..﻿", "time": "5 days ago", "author": "TheFallsCapone"}
{"cid": "Ugxa4BcKfu9cOoKQ7ZZ4AaABAg", "text": "He's right about heroin users being very empathetic towards one another. If one of your boys was dope sick and you knew he didn't have cash that day, you'd give him either the hit he needed or the money he needed to get it. It's odd lol. Out of all the drug scenes I was involved it, heroin was the most fucked up, but the people took care of one another.﻿", "time": "5 days ago", "author": "Stanky Fish Gutz"}
{"cid": "UgzfapezxDc7BWrAT4J4AaABAg", "text": "Omg,i would never believe this guy was anything but a pig.﻿", "time": "5 days ago", "author": "Sam Armstrong"}
{"cid": "UgwbrdAbSxedvPRWtdF4AaABAg", "text": "Yawn﻿", "time": "5 days ago", "author": "ejohnson1234"}
{"cid": "UgyYP6h-wi8k1oGgn_B4AaABAg", "text": "The volume of the video is so low...﻿", "time": "5 days ago", "author": "Кристиян Павлов"}
{"cid": "Ugw5lG60mlCpBgBijHx4AaABAg", "text": "Heroin/Fentany/anxiolitics  was not labeled a major problem until YPPL were affected by it.... HOL UP YOUR RACIST DIATRIBE HAS A HOLE IN IT﻿", "time": "5 days ago", "author": "plasma lasgun"}
{"cid": "UgxWdxrdv7vh7RnMWTl4AaABAg", "text": "Thats a intelligent person!﻿", "time": "5 days ago", "author": "Stiggu LePetit"}
{"cid": "UgxLBO4dUlUbKrcbANJ4AaABAg", "text": "Umm the UK has mexicans?\n\nIt's sad to see vice race baiting it's racist in itself﻿", "time": "5 days ago", "author": "Sp0okykidd"}
{"cid": "UgxDRCalfF2yvXa6BzR4AaABAg", "text": "🤮\n\nThis dude took money from the homeless, I don’t care what your job is, or what the money could’ve been used for, there’s nothing to say that they didn’t have other uses for that money! The police only care about the conviction not the people they tread on to get there. This is my issue with them. Plus I’ve seen them convict to convict and put a case to bed. Trust me I’ve been that person. I’m not saying I’ve no respect for the right they do. Yeah they do try and stop “drug epidemics” but they don’t always get the correct people, but what he just said on here, they take money from people that have nothing too! Great one 🙄﻿", "time": "5 days ago (edited)", "author": "Paige Brown"}
{"cid": "UgyvUA4JKtUbIXTCCth4AaABAg", "text": "Some good content, i like.﻿", "time": "5 days ago", "author": "Elixx"}
{"cid": "UgwVdfqCylJLl6IDWgJ4AaABAg", "text": "Mr Brown got along with him famously﻿", "time": "5 days ago", "author": "Jeffrey R Williams"}
{"cid": "UgzB2Ycx-C7Thu4OaD14AaABAg", "text": "fuckers like this need pills to sleep at night﻿", "time": "5 days ago", "author": "soulja elf"}
{"cid": "UgwLUJ0hTHjSCBn03G54AaABAg", "text": "a.c.a.b﻿", "time": "5 days ago", "author": "cheuphaet"}
{"cid": "UgxPeBdNPAWPRi52yM54AaABAg", "text": "if you sold geer to him you are a knob hes bang on﻿", "time": "5 days ago", "author": "Paul Parry"}
{"cid": "UgylxTOKrbWIq6d9sXx4AaABAg", "text": "Ideas like this could really change the world, they are especially needed here in the US where we are stuck in this bizarre private prison 'drug war' that does nothing but ruin lives on all sides.﻿", "time": "5 days ago", "author": "David James"}
{"cid": "UgyjYpbybiq_FeTbwKN4AaABAg", "text": "Ppl like u are da ones dat will burn in hell right next to the killers, rapist's, and thief's n all da piece dat u lied too﻿", "time": "5 days ago", "author": "saint 187ebk"}
{"cid": "Ugy_DqgAy5PBSe5B6nx4AaABAg", "text": "Is this British Putin  :) ?﻿", "time": "5 days ago", "author": "Byzantium Serb"}
{"cid": "UgwWcYI26TNJ8QGOwTx4AaABAg", "text": "DRUGS DRUGS DRUGS vice is a pack of Meth heads..﻿", "time": "5 days ago", "author": "the resistance"}
{"cid": "UgyD_SndYjlZmWT_pG54AaABAg", "text": "at 4:22 this man explains how he came to the realization that he and ALL his coworkers and ALL his children and ALL his childrens children will be damned to the strange punishments reserved for the workers of iniquity that the bible speaks of in  Job 31;3﻿", "time": "5 days ago", "author": "thispbe"}
{"cid": "UgzdowAeu-8Nw8iKgtN4AaABAg", "text": "We are not interested  in Bristish cops﻿", "time": "5 days ago", "author": "mr. JH"}
{"cid": "UgxKT2qL_7gcoIy2T094AaABAg", "text": "This needs to spread widely, public opinion reflects legislation.﻿", "time": "5 days ago", "author": "Josh Williams"}
{"cid": "UgyvnNnQFepMID1SUoV4AaABAg", "text": "True Geordie podcast anyone?﻿", "time": "5 days ago", "author": "John Dalrymple"}
{"cid": "UgyVSEySmkB9Ee5p0AN4AaABAg", "text": "Is vice finally starting to become good again??﻿", "time": "5 days ago", "author": "klmfao"}
{"cid": "Ugzq2tkgpDtIdESRY2N4AaABAg", "text": "hahaha he is def a sociopaht he said he enjoyed manipulating people﻿", "time": "5 days ago", "author": "Frank the Tank"}
{"cid": "UgwAT_dwoXbBKw4_KY54AaABAg", "text": "\"They were just taking a mickey\"﻿", "time": "5 days ago", "author": "KlohsCalls"}
{"cid": "UgwFyS6-7znDQZvwqbF4AaABAg", "text": "I already did lots of drugs with cops﻿", "time": "5 days ago", "author": "abrantino"}
{"cid": "UgwnqjW2jngVu69IK3N4AaABAg", "text": "LEGALIZE ALL DRUGS﻿", "time": "5 days ago", "author": "paol505"}
{"cid": "UgwnqjW2jngVu69IK3N4AaABAg.8l_Ch6B9l768la5L_nFHhp", "text": "and prostitution﻿", "time": "5 days ago", "author": "first last"}
{"cid": "Ugwbr5FeN08BCKnsh4l4AaABAg", "text": "This guy has been and seen through some real shit...﻿", "time": "5 days ago", "author": "Human Being"}
{"cid": "UgyIPA_fg-Q-KI7wBJ54AaABAg", "text": "The drug war is not just about racism , that’s such a simplistic way to see it.﻿", "time": "5 days ago", "author": "SAMO"}
{"cid": "UgyrvHptPegkOq-raEh4AaABAg", "text": "Everyone is saying \"for once Vice makes a good video\" no. its not a good video, its a video that you supports your opinion.﻿", "time": "5 days ago", "author": "Kristian Todt"}
{"cid": "UgyrvHptPegkOq-raEh4AaABAg.8l_70hT9pux8leoJYOK49b", "text": "Thanks 4 clearing that up! I wasn't sure what to think anymore... Maybe you should run 4 President?﻿", "time": "3 days ago", "author": "Tore Thyen"}
{"cid": "UgyrvHptPegkOq-raEh4AaABAg.8l_70hT9pux8leobIQ6Hqy", "text": "Tore Thyen yea maybe I should﻿", "time": "3 days ago", "author": "Kristian Todt"}
{"cid": "UgwBdVoYqjSCk7Rg3PF4AaABAg", "text": "Alway been about Racism? What a virtue signalling twat. Coming from Vice radical left propaganda.﻿", "time": "5 days ago (edited)", "author": "ChumpyChicken2"}
{"cid": "Ugwy_OPBi8_91TUlAMt4AaABAg", "text": "3:48 Sounds like my ex﻿", "time": "5 days ago", "author": "Paco"}
{"cid": "Ugx693BJ7MlvlpObWWh4AaABAg", "text": "Weasel﻿", "time": "5 days ago", "author": "matt k"}
{"cid": "UgyA2wS6L0huys2feMt4AaABAg", "text": "snitch﻿", "time": "5 days ago", "author": "du Bb"}
{"cid": "UgxA9j0ub3gT9cMTn9Z4AaABAg", "text": "Drugs are bad.  Mmmmkay?﻿", "time": "5 days ago", "author": "Scorp308"}
{"cid": "Ugwa6cA34sO1hZBG1Ct4AaABAg", "text": "Glad this POS pig came around eventually, that is to say, if we assume he didn't already know everything he just said back when he was doing his part.﻿", "time": "5 days ago", "author": "Imorokr"}
{"cid": "UgzN8kpTzBF0aQ0ycJx4AaABAg", "text": "That was some eye opening shit﻿", "time": "5 days ago", "author": "datb0yavi123456"}
{"cid": "Ugz1_xxO-LvR8r9AjRt4AaABAg", "text": "Smart Cop﻿", "time": "5 days ago", "author": "Keith R"}
{"cid": "UgyAX2EOn8yyiB7N1uV4AaABAg", "text": "Racism basically soo true...﻿", "time": "5 days ago", "author": "Ahmad Tariq"}
{"cid": "Ugy5cvSL3F3SrGNbMbF4AaABAg", "text": "How can someone do such a job...﻿", "time": "5 days ago", "author": "Terro One"}
{"cid": "Ugy2kfmm0r6b0JeXoSh4AaABAg", "text": "9.7 million subs and 126683 views and this is the first comment. Wow.﻿", "time": "5 days ago (edited)", "author": "Phongsta"}
{"cid": "UgwhnxuEp08yxcgyuR14AaABAg", "text": "This costs too god damn much money and if they privitize it its just racist﻿", "time": "5 days ago", "author": "Buggle Magnum"}
{"cid": "UgwHNeNX2f3BBgAZon94AaABAg", "text": "Some peoples needs drugs to get through daily life. To reduce the violent some country on the certain state make it as a legal item, but the drug itself is a problematic to human being either legal or non legal when over usage.﻿", "time": "5 days ago", "author": "A Fadhli"}
{"cid": "UgzB0_rw0HuQJAVeYuB4AaABAg", "text": "SNITCHES NEED MORE STITCHES﻿", "time": "5 days ago", "author": "Frank SanFelippo"}
{"cid": "Ugyq-mCk4X4UNBTLVhx4AaABAg", "text": "WORD!﻿", "time": "5 days ago", "author": "Jan Drolhagen"}
{"cid": "UgxmX368-V6qUFOp3SF4AaABAg", "text": "Another person who after experience has realised that the drugs need to be produced and supplied legally! It's the only option the WAR on drugs is simply not working﻿", "time": "5 days ago", "author": "Unknown quantity Slowly searching reality"}
{"cid": "UgyK5piSh7uk_9hTo0J4AaABAg", "text": "Sounds like the kind of job that could make a man go mad over  time for making so much new friends and then just give them in﻿", "time": "5 days ago", "author": "vladimir ikic"}
{"cid": "Ugya1Flf6mSOQrtyqzZ4AaABAg", "text": "U snitch﻿", "time": "5 days ago", "author": "Uncle Jemima"}
{"cid": "UgxCW4c_Ghj9wyiY42t4AaABAg", "text": "This fellah is a sociopath.﻿", "time": "5 days ago", "author": "Dillion Brantley"}
{"cid": "UgyDKb_9LBrePnqIIdZ4AaABAg", "text": "This was good..﻿", "time": "5 days ago", "author": "rotten apple"}
{"cid": "UgyEWDOh5DVnbjdNIRN4AaABAg", "text": "Vice, Vox, Crocks, I don't see difference I jus click.﻿", "time": "5 days ago", "author": "Cartoons My Man"}
{"cid": "UgyIm4__Z7iYsieeAx14AaABAg", "text": "Disgusting human﻿", "time": "5 days ago", "author": "Talloolah Moon"}
{"cid": "UgxwGBP0VdsMpbOfh4l4AaABAg", "text": "I am willing to believe this guy about the UK but he is a cop in London, what more south? Oh, he means the south in America. Mexicans smoking weed in the UK, oh he means in the US. Well, at least he virtue signaled the intro.﻿", "time": "5 days ago", "author": "woodchuck 00"}
{"cid": "Ugzjdttk1uYOSt38zkp4AaABAg", "text": "\"He do too much talkin, he a fed probably.\"﻿", "time": "5 days ago", "author": "WorkSpartacus"}
{"cid": "UgwJprYtOcW2O0LRRCl4AaABAg", "text": "I used to work in a Police Admin department, in the clubs and bars would see some of my work colleagues working undercover. It was kinda awkward.﻿", "time": "5 days ago", "author": "Love Muffin"}
{"cid": "Ugyz4T43p3BoZ-ixnYx4AaABAg", "text": "Nice.. more of this kind of thing please vice.\n\nNo more biased socio-political bullshit.﻿", "time": "5 days ago", "author": "suroj"}
{"cid": "UgxPHU0p2PgpMcOkjg54AaABAg", "text": "He shoved cocaine up his butt.﻿", "time": "5 days ago", "author": "zeekmorris"}
{"cid": "UgyKMcDp1COfaG1RyP14AaABAg", "text": "Racism? What an idiot....﻿", "time": "5 days ago", "author": "Nick Smith"}
{"cid": "UgzqeuMZBlpVbYR1Qrt4AaABAg", "text": "ahaha if you trusted this man as a drug dealer, you should change your profession. absolute wanka﻿", "time": "5 days ago", "author": "big wanker"}
{"cid": "Ugz5QIEPi4GDY4evdrp4AaABAg", "text": "he actually talked sense.. neat﻿", "time": "5 days ago", "author": "Dem"}
{"cid": "UgxnDU4P9zJn-T7lHZd4AaABAg", "text": "Good job vice. Very interesting﻿", "time": "5 days ago", "author": "MOON MAN"}
{"cid": "UgyKKIfTZcZtf8TF9Wt4AaABAg", "text": "he basically admitted hes a sociopath. this guy shouldnt be a cop﻿", "time": "5 days ago", "author": "Dankrupt"}
{"cid": "Ugyc1b7vdhnoxjaY3bR4AaABAg", "text": "I’m surprised he’s showing his face﻿", "time": "5 days ago", "author": "Elegantly Wasted"}
{"cid": "UgwSrNq0Ajoer_NnZmJ4AaABAg", "text": "please listen to his recommendations for policy makers﻿", "time": "5 days ago", "author": "Margot"}
{"cid": "UgxchVByHb3OrFO-JXB4AaABAg", "text": "4:55 how would giving heroin to heroin addicts reduce it's use? It may reduce crime because you made it legal but it won't reduce the use, it'll promote it. If there is zero repercussion then you are just allowing people to keep doing the thing that makes them incapable of being functioning members of society.﻿", "time": "5 days ago", "author": "Democrats are cunts"}
{"cid": "Ugy9qt8BM2Z8P2cB6dd4AaABAg", "text": "snitch﻿", "time": "5 days ago", "author": "Lucas Dupuy"}
{"cid": "UgwXxR2b40IlsNQ52aV4AaABAg", "text": "Do be with them ofcourse u have to take these drugs too.﻿", "time": "5 days ago", "author": "Wewz"}
{"cid": "Ugw8eWAn5UrS4MN3Rxd4AaABAg", "text": "Repost?﻿", "time": "5 days ago", "author": "Marco Orduno"}
{"cid": "UgxjkHPkA0CFypR2UHt4AaABAg", "text": "I very much agree with him on what to do with drug policy to fight drug problems. Regulating it will take the profit from organized crimes whom deals in it. The government is already regulating the use of drugs in the form of big pharma. The more heavily you criminalize it, the more the users and dealers of the substance will be exposed to violence. Which in the end brings a higher burden and cost on the society; unless you are United States and have privatized prisons to make profit off those people. Than yeah, they want to keep the drugs and addicts so they have people to lock up for their own profit.\nNow i'm not saying all drugs should be legalized tho.﻿", "time": "5 days ago", "author": "Nexu Jin"}
{"cid": "UgzeXy7D0E2vdtlLlZ94AaABAg", "text": "Those poor persecuted yardie and mexican cartels getting discriminated against. Such a travesty.﻿", "time": "5 days ago", "author": "Underground906"}
{"cid": "UgzeXy7D0E2vdtlLlZ94AaABAg.8lZSbvyVmmK8ldq9lP4pR7", "text": "Cops should hold themselves to a higher standard and not stoop to the levels of the Cartels and Street Hoodlums...Don't fight fire with fire but with water or sand instead...more effective and there's less of mess﻿", "time": "3 days ago", "author": "Guapo da God"}
{"cid": "UgxWtHXZB2uv8jIRVrB4AaABAg", "text": "\"It's always been about racism\" yeah show me where in the law it says if you're white trafficking Cocaine or other drugs is legal.﻿", "time": "5 days ago", "author": "Patrick Burns"}
{"cid": "UgxklaxjOkl5omWkLfV4AaABAg", "text": "i would let him flex me﻿", "time": "5 days ago", "author": "TheMr3742"}
{"cid": "UgxZqakPU4p7hKDdNhh4AaABAg", "text": "Make a kd video the drug made from bug spary on paper and smoking it﻿", "time": "5 days ago (edited)", "author": "matthew Hersey"}
{"cid": "UgxJxudPjU740tEDgLl4AaABAg", "text": "His comments about drug policy and regulation are intelligent. However, what kind of person much you be to gleefully admit to manipulating the weak?﻿", "time": "6 days ago", "author": "ThePandaKitten"}
{"cid": "UgwE6PqJ0WWr5DpMCBF4AaABAg", "text": "Everyone calls me crazy when I say we need to legalize all drugs, people just don't understand that the biggest cause of overdose is quality quantity unknown, and that using a chemical is not a crime. Someday people will wake up hopefully﻿", "time": "6 days ago", "author": "vineofthedead"}
{"cid": "UgxubdAQY1ibwtuePqt4AaABAg", "text": "Oh nice. Comments arent disabled on this video﻿", "time": "6 days ago", "author": "Benny Ly"}
{"cid": "Ugz9X1Zjxf6DgwIy_2R4AaABAg", "text": "Damn, VICE is really tryna be what it used to be now.﻿", "time": "6 days ago", "author": "therant311"}
{"cid": "UgyMARDDHRu6is5HuFl4AaABAg", "text": "Ur gonna get someone killed telling true aliases and names﻿", "time": "6 days ago", "author": "tyler"}
{"cid": "Ugz9YoAbbLKLvh12zaF4AaABAg", "text": "No Sale﻿", "time": "6 days ago", "author": "H J"}
{"cid": "UgyTJ-NtzA7dAUc-JbJ4AaABAg", "text": "What a bunch of bs﻿", "time": "6 days ago", "author": "Nino Brown"}
{"cid": "UgyfbUCH1gOQZxJNjq14AaABAg", "text": "Vice do you think you could do a documentary about salvia ? Of if it’s already been done can someone post the link ?﻿", "time": "6 days ago", "author": "Okie TC"}
{"cid": "UgyTBcOpgFCBLmeX_e94AaABAg", "text": "did he mean that the govt should legalize heroin?﻿", "time": "6 days ago", "author": "UZ"}
{"cid": "UgxQ2u4Y1aFZBJlAAmV4AaABAg", "text": "Smart man. That's all I have to say.﻿", "time": "6 days ago", "author": "Gary Ko"}
{"cid": "UgwqJr_CmE9-KcRskw54AaABAg", "text": "A good video from vice﻿", "time": "6 days ago", "author": "jason4275"}
{"cid": "UgzGZrdae5TEU8aw-Rl4AaABAg", "text": "Weird how Vice disabled the comments to another video.﻿", "time": "6 days ago", "author": "Devils Right Hand"}
{"cid": "Ugy-7X-9aJCiQ4L0EUB4AaABAg", "text": "American drug \"racism\" is based not on color/race but number of people addicted and crimes committed. If 1.6 people of 10 people are Hispanic and 1.3 of 10 are black, then even if EVERY black and Hispanic took a drug it wouldn't even be a third of the population addicted. Why \"it has hit the white population\" (for opiates) is important is because numerically it's a much bigger pool of people addicted. White equals 6 in 10, black and Hispanic is 3 in 10 combined. If you wanna be upset with \"racist\" issues then complain to the cigarette, liquor, lottery, shit food marketing that is being shoved down poor neighborhoods throats. I work in a inner city methadone clinic and it's white to black ratio is close, so it is an epidemic for everyone, not just a \"white problem\". Also, while on the topic.... Crack, numerically, affected a very few people and that's why it's not treated the same, not color. Again at the clinic, just as many white using crack, but they are also counted as opiate addicted.﻿", "time": "6 days ago", "author": "Alx2672"}
{"cid": "Ugyfyd1RnjwrRozt_hF4AaABAg", "text": "War on drugs a lie﻿", "time": "6 days ago", "author": "codemann 719"}
{"cid": "UgzJo2kjW56l__vzciN4AaABAg", "text": "Sounds white💊💉😂😳😰🤢😵﻿", "time": "6 days ago", "author": "Johnny Dazed"}
{"cid": "UgwB43AYYG0IBy1jDEF4AaABAg", "text": "I know that pub always walked past it on my way to town.﻿", "time": "6 days ago", "author": "jacob harris"}
{"cid": "Ugx63347VEtAAk4IlbJ4AaABAg", "text": "Wow never seen such an honnest guy!﻿", "time": "6 days ago", "author": "Fábio Santos"}
{"cid": "Ugxbem7gJfLhadXlR_R4AaABAg", "text": "cool it's a video about anything but weed﻿", "time": "6 days ago", "author": "Mike Jones"}
{"cid": "Ugx6TWZU-T03TJCB3R54AaABAg", "text": "Im surprised this wasnt inspired by Tom Clansy's fucking Jack Ryan﻿", "time": "6 days ago", "author": "Канал имени товарища Ягоды"}
{"cid": "Ugxn-r08h931NeVWkPV4AaABAg", "text": "Why would you start this video with race baiting? So disgusting, making me hate VICE more and more....﻿", "time": "6 days ago (edited)", "author": "Dylan Kretz"}
{"cid": "UgxIIabkwDs0u8pBE-V4AaABAg", "text": "So much truth in this. Mad respect to this man﻿", "time": "6 days ago", "author": "YouTube Blue"}
{"cid": "UgyQxEQQTQsNOQnhXNx4AaABAg", "text": "I'm quite on the left, but pro-police. I agree with the right now with Vice, it's too far left.﻿", "time": "6 days ago", "author": "SPKY 13"}
{"cid": "UgzKm7Y6zvDhVIkAuox4AaABAg", "text": "Snitch﻿", "time": "6 days ago", "author": "Joe Kyser"}
{"cid": "UgwIl09JmEWZzhSLCHZ4AaABAg", "text": "They didn't put a committee putting dare stickers everywhere until it starting hitting the suburbs﻿", "time": "6 days ago", "author": "Trey321 Godsloveld@gmail.com"}
{"cid": "Ugy9vJLLk__IZmHovKp4AaABAg", "text": "Drug law logic: You will ruin your life by using drugs so we're going to ruin your life by putting you in prison.﻿", "time": "6 days ago", "author": "Sam LoDestro"}
{"cid": "Ugy9vJLLk__IZmHovKp4AaABAg.8lZ52kvbhyD8lh3MPe-NfS", "text": "And what's your alternative?﻿", "time": "2 days ago", "author": "R. J. Lombardi"}
{"cid": "Ugy9vJLLk__IZmHovKp4AaABAg.8lZ52kvbhyD8lj52-0YG7X", "text": "R. J. Lombardi The correct way of dealing with the issue, legalization.﻿", "time": "1 day ago", "author": "Jake Waugh"}
{"cid": "Ugy9vJLLk__IZmHovKp4AaABAg.8lZ52kvbhyD8lj7QjCdZ8E", "text": "@Jake Waugh A better solution would be isolation or relocation and work, this is based on my father's (he was a cop) and my experiences﻿", "time": "1 day ago", "author": "R. J. Lombardi"}
{"cid": "Ugy9vJLLk__IZmHovKp4AaABAg.8lZ52kvbhyD8lk8uKjuD0c", "text": "R. J. Lombardi  Ehh, not a better solution. You can't keep drugs out of peoples hands. You just can't. If prisoners can get drugs, how do you expect to keep everyone in America from using drugs? We spend 40 billion a year and OD's are going up and drugs are available everywhere. It's a waste of money. The best solution would be legalization and allowing the government to regulate and tax substances like they do with alcohol. Billions would be saved that could be used for treatment facilities that actually help addicts, unlike prison. More money would be made off taxes​ that could be used to better all citizens. OD's would drop because drugs wouldn't be laced (the main cause of overdoses). Why should the government tell us what we can and cannot put in our bodies? They allow use to drink and smoke (kills tens of thousands each year), people are allowed to take Adderall (meth in a pill) and oxycodone (highly addictive, kills thousands, and is heroine in a pill). I can go on and on about the positives of ending the war on drugs truth is, you can't give one positive of continuing this nonsense.﻿", "time": "1 day ago", "author": "Jake Waugh"}
{"cid": "UgyFhJ-Hmv9kmF6At614AaABAg", "text": "More like, \"Vice has an ex cop  spew propaganda\". Scummy video, even if I agree with most of his points, this should've been about the title, not DATSRACIST!!﻿", "time": "6 days ago", "author": "Blake"}
{"cid": "UgzfIv4vUhaARhDA14x4AaABAg", "text": "Smart we control the drugs the dealers get the boot and we can lower tax﻿", "time": "6 days ago", "author": "Johnny Wood"}
{"cid": "UgwQt1U7BCOrCbqoeCF4AaABAg", "text": "Is this a re-upload? I know I've seen this on here before.﻿", "time": "6 days ago", "author": "Yep"}
{"cid": "UgzHUkxYtm20JRmZ2fx4AaABAg", "text": "Sounds about WHITE.﻿", "time": "6 days ago", "author": "Protege99 Academy. Inc"}
{"cid": "UgyQcIKm5NDgK00_d_R4AaABAg", "text": "Too much money in the drug war. Think how many people are directly involved in combating drug crime.﻿", "time": "6 days ago", "author": "Dim Kras"}
{"cid": "UgxC1B67kd5dJXjg_mx4AaABAg", "text": "the gov came up with the term \"marijuana\" to make cannabis seem more mexican and \"bad\"﻿", "time": "6 days ago", "author": "xfurnish"}
{"cid": "UgyfCV4dpraeTicfC0l4AaABAg", "text": "If anyone sold to this fucking obvious narc then they deserved to be taken down lmao. So obviously sketchy.﻿", "time": "6 days ago", "author": "based"}
{"cid": "UgyrQpcertZsOjcPaB94AaABAg", "text": "People saying “all cops are.....” is pretty laughable considering it’s likely the same people who get offended when they hear someone generalize all black people as something, or all Mexicans are something. People love to hate on cops till they need them, then just hide like a little bitch till they get there. 🤷🏻‍♀️﻿", "time": "6 days ago", "author": "GirlNamedSandoz"}
{"cid": "UgxowDG-2VC6NyVa0-R4AaABAg", "text": "This guy should be on the gov. Drugs czar policy.﻿", "time": "6 days ago", "author": "Richie Ponsford"}
{"cid": "UgyRXl46nECGTlAYoLp4AaABAg", "text": "Look that shit up this information has been common knowledge for years﻿", "time": "6 days ago", "author": "R.O.T.C SEEM"}
{"cid": "UgyRLc9fZ8WqTAhz9Zd4AaABAg", "text": "There is only one time that I saw marijuana ruin someones life, it was right after the police sold him some.﻿", "time": "6 days ago", "author": "Justin Tyler Lee"}
{"cid": "Ugzf21cyvm5BWkXykbd4AaABAg", "text": "😅﻿", "time": "6 days ago", "author": "hendra armansyah"}
{"cid": "Ugz97AxYJl1L9gAvaAd4AaABAg", "text": "Absolutely agree with everything he has to say.\nDecriminalize, regulate, and focus on harm reduction rather than criminalization.  \nPeople who's drug use controls their lives should be put into treatment rather than jail -\nit costs less to the tax payers, and it's more effective at reducing drug use.\nPortugal already has this model, and it reduced their nationwide addiction rates significantly\nAnd without an illegal market anymore,\nThe drug cartels would crumble.  \n\nIt would reduce crime, reduce drug use, save lives, give back bodily autonomy to the people, and cost less taxes.  There are no down sides.﻿", "time": "6 days ago", "author": "Danielle Spargo"}
{"cid": "Ugz97AxYJl1L9gAvaAd4AaABAg.8lZ10HXa8bb8lZVUkxjDCb", "text": "They should be put in jail. If their drug controls their life treatment isn't in their future.﻿", "time": "5 days ago", "author": "Democrats are cunts"}
{"cid": "Ugz97AxYJl1L9gAvaAd4AaABAg.8lZ10HXa8bb8l_ikNVq59d", "text": "Danielle Spargo It’s common fucking sense and the only way forward. But the government is too corrupt. They don’t care.﻿", "time": "5 days ago", "author": "Nate"}
{"cid": "Ugz97AxYJl1L9gAvaAd4AaABAg.8lZ10HXa8bb8l_iosHSeT9", "text": "Democrats are cunts No one is listening to you, dipshit. We hear you, but no one is listening.﻿", "time": "5 days ago", "author": "Nate"}
{"cid": "Ugz97AxYJl1L9gAvaAd4AaABAg.8lZ10HXa8bb8la8bFiumyD", "text": "Switzerland was the first country to try this approach. There was an incredible drug problem in the 90'. Nowadays you really have to go searching to find human relics of that time. Switzerland and Portugal have shown that it can be done. There is an effective and better way to handle this problem once and for all.﻿", "time": "5 days ago", "author": "alpha12orc"}
{"cid": "Ugz97AxYJl1L9gAvaAd4AaABAg.8lZ10HXa8bb8laPsHBoD-9", "text": "Democrats are cunts: Unless you're putting everyone of them in jail for life, continuing to jail them & not treat them makes absolutely no sense @ all. However, they know the majority of people feel the way you do. So they keep jailing them & releasing them because they know they will go right back to using. As long as they're using, the cycle will continue. They want the cycle to continue because the Gov. really don't want or can't afford for crime to go down much. They want to control it so they can play with people's minds when they reduce crime by the very small % they feel will make a difference in individual's minds like yours, but not enough to affect America's economy.. If you really take the time & do your research, you will come to understand how crime is America's cash cow.!! There are very few careers where crime hasn't had a hand in making sure that career continues to grow. If you cut crime too much, it will affect America's economy. Crime creates jobs, jobs generate taxes, taxes is revenue, revenue is distributed to elected officials. .!!﻿", "time": "5 days ago (edited)", "author": "Anty Grvity"}
{"cid": "Ugz97AxYJl1L9gAvaAd4AaABAg.8lZ10HXa8bb8laVpcEIL36", "text": "You agree with everything he said for the first 10 seconds. smh﻿", "time": "5 days ago", "author": "IPIay"}
{"cid": "Ugz97AxYJl1L9gAvaAd4AaABAg.8lZ10HXa8bb8lcDzy2GoPP", "text": "Danielle Spargo ...Well said.﻿", "time": "4 days ago", "author": "3DayPriest"}
{"cid": "Ugz97AxYJl1L9gAvaAd4AaABAg.8lZ10HXa8bb8ldlFmJH4oR", "text": "Did this guy just say..that to get rid of the heroin epidemic..we must make it available for medical use and that’ll take away from illegal distribution/abuse...ISN’T HEROIN ALREADY USED MEDICALLY WITH AN ALTERED NAME AND THERE’S COUNTLESS CASES OF THOSE PATIENTS STRUGGLING TO GET OFF THE OPIATE ADDICTION? HEROIN IS NOT LIKE MARIJUANA LMAO. It’s only gonna become BIG BUSINESS FOR BIG PHARMA! OH YEAH, he’s a cop so I wouldn’t be surprised if he’s under the control of their establishment/his own money interests. This bitch Danielle🤦🏽‍♂️ Don’t be easily manipulated, baby.﻿", "time": "3 days ago (edited)", "author": "Z 7IEDA"}
{"cid": "Ugz97AxYJl1L9gAvaAd4AaABAg.8lZ10HXa8bb8lerJYE6Nuk", "text": "he only says this AFTER he's been paid for all those lives he ruined﻿", "time": "3 days ago", "author": "Jionni Lil"}
{"cid": "Ugz97AxYJl1L9gAvaAd4AaABAg.8lZ10HXa8bb8llRNhmXhkC", "text": "@alpha12orc Canada is moving towards that. They have had program's similar that the government challenged in court. It's been effective and is expanding though.﻿", "time": "22 hours ago", "author": "Jivan Grewal"}
{"cid": "UgwT0V_m78ipig_Rvtl4AaABAg", "text": "He worksfor the Baltimore Police Department now, far more fun, er was?﻿", "time": "6 days ago", "author": "Stewart Lawson"}
{"cid": "UgzghVec-fUVfKcaySx4AaABAg", "text": "Watched an interview with this guy on the True Geordie podcast﻿", "time": "6 days ago", "author": "Bescobar Productions"}
{"cid": "Ugzay_D_ERUOrf2gcJh4AaABAg", "text": "I agree with this fully.﻿", "time": "6 days ago", "author": "detachd"}
{"cid": "Ugyi1lDGuOET_5EYd8t4AaABAg", "text": "Fucking undy 🤦🏽‍♂️﻿", "time": "6 days ago", "author": "Will Craig"}
{"cid": "Ugyw_o_ZXIXL7PAeOKl4AaABAg", "text": "you made this ages ago and just reposted﻿", "time": "6 days ago", "author": "K. harty"}
{"cid": "UgySuen9pOLoeVzA97V4AaABAg", "text": "I saw this months ago, it was re-uploaded.﻿", "time": "6 days ago", "author": "Reclusive Eagle"}
{"cid": "Ugy0k1ISsTUMHf25oTt4AaABAg", "text": "There’s Mexicans In UK?﻿", "time": "6 days ago", "author": "L.AlienBoy"}
{"cid": "UgyPU1le01ejC3f7jwN4AaABAg", "text": "Yep mate. Tottaly right. Please check the Portuguese example! You might learn a bit.﻿", "time": "6 days ago", "author": "Nuno Lopes"}
{"cid": "UgzMV54M_BqyOgcwhxJ4AaABAg", "text": "So he was undercover and now talks about this on camera? Can someone answer me my question. What makes it hard for those who he sent to jail to find him and cut his head off?﻿", "time": "6 days ago", "author": "Mike Revenco"}
{"cid": "UgwAvj1bL3li4u2YKKJ4AaABAg", "text": "He’s wrong on the racism front﻿", "time": "6 days ago", "author": "JudgeHill83"}
{"cid": "UgxTlZhwtmmReAjzKrN4AaABAg", "text": "Isn't this cut from an older documentary, I distinctly remember seeing it.﻿", "time": "6 days ago", "author": "goofy gamer"}
{"cid": "Ugzj4kwXcgE0rJSR4B94AaABAg", "text": "Yet another example of how the \"war\" model of drug abuse prevention makes no sense.\nWe value freedom in the west, and shrug it off when people \"can handle it, like functional and successful people who use drugs on the sly, yet we punish people who suffer from misuse and drug abuse, like the poor and/or vulnerable.﻿", "time": "6 days ago (edited)", "author": "Monty Cantsin"}
{"cid": "Ugy0BuFLYYOrmwn-hL54AaABAg", "text": "Even legalization will create more problems...it is a two edged sword. But in general people tend to gravitate towards illegal stuffs just because it is so, drugs should be like tobacco and alcohol﻿", "time": "6 days ago", "author": "Khondker Rifat Hossain"}
{"cid": "Ugy0BuFLYYOrmwn-hL54AaABAg.8lYrV5j-qhg8l_Q-JjCvZ0", "text": "Khondker Rifat Hossain And then what? You have a bunch of legal addicts blowing their family's rent and food money on cocaine/crack/etc. and continuing to abandon their children? Illegal fronts will no doubt accompany  the legal infrastructure so that these same criminals can meet the demands of addicts who won't be able to afford marked up dope. Choking out the illegitimate market needs to be the  foremost priority if legalization is going to work at all.﻿", "time": "5 days ago (edited)", "author": "शक्तिमान"}
{"cid": "Ugy0BuFLYYOrmwn-hL54AaABAg.8lYrV5j-qhg8ljMWGu5dUR", "text": "शक्तिमान  Dude there are legal addicts abandoning their families as well as blowing their rent money on alcohol and gambling. And what about the opioid problem going from pain killers to heroin. Why aren't opioids banned. But everyone is against making illegal drugs legal. You know the chemicals to make meth are legal but you still buy them.  Addiction is going to be a problem with anything.  Making the drugs legal isn't going to turn everyone into an addict. You can become an addict right now and kids can buy drug now. Just making them legal would drop the crime and prison rate down a little bit.﻿", "time": "1 day ago", "author": "Lord Papeles"}
{"cid": "Ugx6PkxIoiAdjO1S9yl4AaABAg", "text": "This is why I stayed subscribed. Actual content﻿", "time": "6 days ago", "author": "kooldudes597"}
{"cid": "UgyNQp7JR-NXd6NEhOl4AaABAg", "text": "Yeah make a movie with the samurai sword scene. Gold.﻿", "time": "6 days ago", "author": "Sean Keyhour"}
{"cid": "UgznB7KcbhjWmybjiHx4AaABAg", "text": "isnt this a reupload﻿", "time": "6 days ago", "author": "James Billings"}
{"cid": "Ugw1xqEC5MihUGaaa7N4AaABAg", "text": "Well fucking said man. Well fucking said. You make me hate police just a little bit less.﻿", "time": "6 days ago", "author": "Kyle Miller"}
{"cid": "Ugyl3RdfL7ICKkXGlYt4AaABAg", "text": "Politics should fight the causes of drug use instead of making addicts lives even worse﻿", "time": "6 days ago", "author": "Mr Ubanity"}
{"cid": "UgzubgJRIy40WEPsiKt4AaABAg", "text": "Didn’t understand jack shit﻿", "time": "6 days ago", "author": "Abdilrahman Aljamali"}
{"cid": "UgzfIuKlzaTsgaSIckl4AaABAg", "text": "i like how he cuts the bullshit and says straight up, i enjoyed taking advantage of these people, lying/maintaining the lie﻿", "time": "6 days ago", "author": "Dave Gorman"}
{"cid": "UgzgF1g_jbBFmo8EZwl4AaABAg", "text": "Bro what'sup with the re-upload I saw this months ago﻿", "time": "6 days ago", "author": "HgihAsFcuk"}
{"cid": "UgwxPR9QxDpmhcUiJpZ4AaABAg", "text": "I’m worried about this guy’s safety.﻿", "time": "6 days ago", "author": "peeping ukulele"}
{"cid": "UgzyALwud_l41xRAytp4AaABAg", "text": "Doesn't matter the drug, if it's a white boy/girl doing/selling nobody cares but the second it's someone else, whittie complains 'cause they're not making the money! Just look at Cannabis, the number of minorities in jail for decade sentence for weed but how many white do you see in jail for crack, cocaine, meth, pills...  It's like everything in life: AS LONG AS IT'S  WHITTIE DOING  IT, IT'S OK!﻿", "time": "6 days ago", "author": "Atem S."}
{"cid": "UgyEBpUM1CULEI3N2KN4AaABAg", "text": "this is better than the videos of a guy smoking out of a lamp..﻿", "time": "6 days ago", "author": "Ani Tv"}
{"cid": "Ugxl8QNN9PprgPqQW3R4AaABAg", "text": "What a piece of shit, he enjoyed fucking over vulnerable sick people addicted to heroin who gave him their last 5 quid to make sure he was well very well knowing that might be the 5 quid that keeps them from getting well themselves....﻿", "time": "6 days ago", "author": "Vick Vkusnyatina"}
{"cid": "UgxZjXu70fKIUzPGQLR4AaABAg", "text": "Drug dealers should get locked up not users cuz users get da drugs in jail anyway the dealers are the ones that make broken families and ruining people's lives﻿", "time": "6 days ago", "author": "Imran K"}
{"cid": "UgxtD4Awgnp3lfLM8ol4AaABAg", "text": "Thought that was the Alchemist in the thumbnail lmao﻿", "time": "6 days ago", "author": "John Blaze"}
{"cid": "UgzltsddlppQtK0O2K94AaABAg", "text": "racism is always around us, if you dont believe me go to a store and ask why they dont mix all of the white and brown rice﻿", "time": "6 days ago", "author": "Lucif"}
{"cid": "Ugyxy7_gG84RvfCRqYh4AaABAg", "text": "Coz it's 187 on an undercover coooop 😀﻿", "time": "6 days ago", "author": "Kovinis Piktukas"}
{"cid": "Ugyxy7_gG84RvfCRqYh4AaABAg.8lYm6_MEj-18l_qNfbIjg2", "text": "💀🔫🤣🤣🤣﻿", "time": "5 days ago", "author": "Thirt33n Tw3nty Thr33"}
{"cid": "UgxwIIrXUDqazaqr0qJ4AaABAg", "text": "Very interesting. I'd like to see them go more in depth with him.﻿", "time": "6 days ago", "author": "BakiSmaki27"}
{"cid": "UgxznED0oxlPunAZMV94AaABAg", "text": "This guy Neil Woods has ruined a lot of lives + doesn’t seem to have any remorse for at least a few people that may not have deserved more punishment in life!!\nThat’s Un fucking believable!!\n\nWhat comes around goes around...﻿", "time": "6 days ago", "author": "Mark Collins"}
{"cid": "UgxTPkX6nBSpiCBM5gZ4AaABAg", "text": "I swear this is a reupload then i realized no someone else already did this and he told this shit verbatim..﻿", "time": "6 days ago", "author": "packerpf"}
{"cid": "UgyRJ53u4qjQ3VJXljJ4AaABAg", "text": "Skip this show moronic cop﻿", "time": "6 days ago", "author": "KGBz"}
{"cid": "UgxnMSKcob14dP0UueJ4AaABAg", "text": "It was always about racism smfh﻿", "time": "6 days ago", "author": "OB23"}
{"cid": "Ugy775gxsv4szsDhdz94AaABAg", "text": "You know the opium problem was huge before the blacks or Mexicans used it.  During the opium trade It destroyed the Chinese and Japanese community 1800s So your blanketed statement doesn’t make any sense.  There are more factors.  \n\nI also think legalizing it and controlling is a horrible idea.  Thousands of people die off of legal opioids yearly.  Explain that, we can’t even control that right.﻿", "time": "6 days ago (edited)", "author": "Phong Nguyen"}
{"cid": "Ugy775gxsv4szsDhdz94AaABAg.8lYkFfxyGBr8lZ5UO7ZrVZ", "text": "your comment is puzzling to me but I am going to try and have a discussion.  The drug prohibition was largely related to racism and many other things, sure,  However, one really big issue with opiods is this.  During the 1990s, there was a new generation of opiod analgesic painkillers which were marketed by the chemists/research as being nearly zero addiction, around 1%.  This however was found out to be extremely wrong.  However, doctors who were trained during this time period, were taught that these new painkillers were relatively safe when it came to dependencies.  So that is one reason why there has been a massive over prescription for opiod painkillers.  When you are addicted to opiods, and your doctor cuts off your prescription because you dont need it for the injury anymore, you either suffer serious withdrawals (many people simply cant handle it) so they decide to go out and buy heroin.  When you consume drugs off the street heroin especially, there is a high chance the drug is going to be impure, or cut with different unknown drugs, such as fentanyl.  The reason for this is, you can make a product much more strong and sell more, allowing the drug dealer to get more profit.  However, the user takes their regular dose and overdoses.  The overdose is because the drug wasnt regulated, and this is because the drug is illegal. More people die every single year from alcohol Overdose alone, than any other drug combined,  This is not including the bigger amount of the people who got drunk, did something stupid or wrecked in traffic and died.  This is strictly alcohol overdoses.  Harm reduction is a different approach to drug use, rather then arresting people, locking them up, getting them stuck inside the in and out of prison, (felons cant get a decent job, if you get a felony drug possession, your fucked.) We can inform them how to use drugs safely, how to know about addiction and how to get help.  Rather then DARE style of DONT DO ANY DRUGS, we have to accept that a certain percentage of people are going to use drugs and we have to minimize the harm that comes with that.  if you werent aware, weed, lsd, shrooms and heroin (assuming its pure and not overdose) are all quite literally safer for your body than tobacco or alcohol.  So, drug laws arent there to really protect people, something else has happened and its causing a whole ton of issues.\n\n     Disregarding hypotheticals, if you want to know what actually happens when a nation decriminalizes drugs, look at Portugal.  They have seen a massive reduction in drug addiction rates and drug related deaths.  When drugs are illegal, violent gangs come into play, product is sketchy and things are not safe, and information is scarce because its illegal.﻿", "time": "6 days ago", "author": "Intramental Studios"}
{"cid": "Ugy775gxsv4szsDhdz94AaABAg.8lYkFfxyGBr8lZNLhnq5A9", "text": "Intramental Studios your statement is one sided. I have seen tons of people who get prescriptions for the purpose just getting high not because they were addicted.  Explain to me how that would help someone if we decriminalize the drug.  \n\nNot sure if you are a parent, but if my child wanted to smoke any drugs and I allowed them to do it, do you think it’s a good idea?\n\nMy argument was according to the cop, he said that drugs were made illegal because of racism.  That’s not true.  It was made illegal because it destroyed families.  \n\nFor example The Chinese made it illegal during the opium trade because it destroyed families.  It had nothing to do with race.  Maybe you should do a little research on that.  Plenty of countries have made drugs illegal because it has destroyed so many lives and nothing to do with race.  UK makes it illegal to have heroine, meth and so many other things. \n\n\nYour argument to me is one sided. \n\nNot everything is a conspiracy regarding racism. A friend says he likes to take Xanax just because it made him feel good with alcohol.  \n\nHe is white and he was caught with a bottle full when he was 18 charged with a felony.  As an adult he still does it, he isn’t addicted to it but he just likes to pop 4 mg to get away from it all.  Yeah what he is doing is counting his days.  \n\nMy apologize for the punctuation I’m on an iPhone but people really need to stop with the racism crap.﻿", "time": "6 days ago", "author": "Phong Nguyen"}
{"cid": "Ugy775gxsv4szsDhdz94AaABAg.8lYkFfxyGBr8lZQFnalQNs", "text": "I feel as if there is some misunderstanding, drug laws are not in place because of racism today, this was during times 100 years ago.  News reports from the early 1900s clearly show strange stories, such is a case of yellow journalism. The Harrison Narcotics Tax Act was a federal law put into place as a response to these events.  \n\"The drafters played on fears of \"drug-crazed, sex-mad negroes\" and made references to Negroes under the influence of drugs murdering whites, degenerate Mexicans smoking marijuana, and \"Chinamen\" seducing white women with drugs.[20][21] Dr. Hamilton Wright, testified at a hearing for the Harrison Act. Wright alleged that drugs made blacks uncontrollable, gave them superhuman powers and caused them to rebel against white authority. Dr. Christopher Koch of the State Pharmacy Board of Pennsylvania testified that \"Most of the attacks upon the white women of the South are the direct result of a cocaine-crazed Negro brain\". https://en.wikipedia.org/wiki/Harrison_Narcotics_Tax_Act\nPlease, I'm not trying to push some conspiracy.  The things I am discussing are truly fact, I'm not saying that is the only reason however it is a big reason.  And this isnt just about racism, it was also used as an attack against the counter culture movement, anti war protesters. and against racial revolutionary groups like the Black Panthers. \nHere is a direct statement which was made by John Ehrlichman (counsel and Assistant to the President for Domestic Affairs under President Richard Nixon)  Quoted in the year 1994: \"The Nixon campaign in 1968, and the Nixon White House after that, had two enemies: the antiwar left and black people. You understand what I'm saying? We knew we couldn't make it illegal to be either against the war or black, but by getting the public to associate the hippies with marijuana and blacks with heroin, and then criminalizing both heavily, we could disrupt those communities. We could arrest their leaders, raid their homes, break up their meetings, and vilify them night after night on the evening news. Did we know we were lying about the drugs? Of course we did.\"\n\nI agree with you in part regarding the issue of racism this, racism that.  For some people, they think every problem in the US is rooted in racism.  However, I'm asking you to set the association of those other opinions aside, as this is is a separate and very real issue.  The reason I'm so passionate about putting this information out to you and others on youtube, this is a central issue in my career field.  I've done considerably more research than average, and I believe for the problem to hopefully improve, people need to understand true factors at play.﻿", "time": "6 days ago", "author": "Intramental Studios"}
{"cid": "Ugy775gxsv4szsDhdz94AaABAg.8lYkFfxyGBr8l_GkgdZIMZ", "text": "Intramental Studios I see what you are saying.  I can’t argue with that, you have enough facts in the last post I don’t have any argument against it.﻿", "time": "5 days ago (edited)", "author": "Phong Nguyen"}
{"cid": "UgzhzkFpIZL-sY3H_Rx4AaABAg", "text": "3:50 = sociopath﻿", "time": "6 days ago", "author": "Selene"}
{"cid": "UgyKzpqWpcPhwCtsJLZ4AaABAg", "text": "Kick out the jooz or we will all lose﻿", "time": "6 days ago", "author": "Michael J"}
{"cid": "UgzIhV-5rjR7331LgoB4AaABAg", "text": "Bullshit.﻿", "time": "6 days ago", "author": "Shotgunmad xl"}
{"cid": "UgzYYP1VPYke30dz9sp4AaABAg", "text": "only horrible ppl can do this job﻿", "time": "6 days ago", "author": "Selene"}
{"cid": "UgxhN3WulGBeB5NCrsV4AaABAg", "text": "Excellent content love these kind of intriguing vids﻿", "time": "6 days ago", "author": "Edward Darigala"}
{"cid": "UgztZQJtVrN8Tqby2jp4AaABAg", "text": "This guy likes to manipulate people....Vice, you just fell for a whole lot of bullshit.﻿", "time": "6 days ago", "author": "stripymccatpuss"}
{"cid": "Ugy6loU-TYgPxn-TNGR4AaABAg", "text": "i like how vice starts the video with some classic race baiting﻿", "time": "6 days ago", "author": "Flivver"}
{"cid": "Ugw3xLMFpkTQY8lI8rJ4AaABAg", "text": "Wow this man needs to write a book. That story about the guy on suicide watch was heartbreaking﻿", "time": "6 days ago", "author": "Sebastian S."}
{"cid": "UgwnO2wGIYODZCqX5Rh4AaABAg", "text": "I'm surprised VICE has turned into a narcotic supporting organization. Do they get funding from the Mexican drug cartels?﻿", "time": "6 days ago", "author": "COLT Fin"}
{"cid": "UgwnO2wGIYODZCqX5Rh4AaABAg.8lYij0Y45Ja8lZ5mzLLEnY", "text": "if you decriminalize or legalize drugs, that literally takes money away from drug cartels and gangs.  The gangs are there because its illegal.  If the drug is legal people  can be much safer with it in general.﻿", "time": "6 days ago", "author": "Intramental Studios"}
{"cid": "UgwnO2wGIYODZCqX5Rh4AaABAg.8lYij0Y45Ja8lZH302m0Ft", "text": "+Intramental Studios seems more like there will be an all out war if we legalize drugs though. Alot of money in it doubt everyone will play nice plus seems. Drugs will constantly be changed in the black market for better or worse so there will always be a need. Best case scenario seems like nothing but under the table deals so pills for all and more Martin Shekli's from what you want.﻿", "time": "6 days ago", "author": "Christian Montoya"}
{"cid": "Ugx3MoMzjIhiNGUVald4AaABAg", "text": "lmao he said cannabis wasn't a problem until Mexican immigrants. cannabis was never a problem it was made illegal to kill the methanol industry that threatened big oil. the war on drugs is bullshit its a war on competition and it keeps the prisons full.﻿", "time": "6 days ago (edited)", "author": "2Lysergic4Insurgent7"}
{"cid": "Ugx3MoMzjIhiNGUVald4AaABAg.8lYih3vR5GU8lZ9dNOKXnK", "text": "Lol your dumb. When he's says it wasn't a \"problem\" what he meant was no one viewed it as a problem in there opinion. Opinions change and do not always follow the facts you dip.﻿", "time": "6 days ago (edited)", "author": "THE DARK SENATOR"}
{"cid": "Ugx3MoMzjIhiNGUVald4AaABAg.8lYih3vR5GU8lb89XMLpx7", "text": "you are not that smart huh?﻿", "time": "4 days ago", "author": "Zac Owen"}
{"cid": "Ugx3MoMzjIhiNGUVald4AaABAg.8lYih3vR5GU8lbCK9KD9jC", "text": "you are kinda dense huh﻿", "time": "4 days ago", "author": "thaNorthStar.com"}
{"cid": "Ugx3MoMzjIhiNGUVald4AaABAg.8lYih3vR5GU8lhgS4Nw1o7", "text": "@THE DARK SENATOR Hes telling the truth Hemp and cannabis would make many people loose lots of money... Thats why it is illegal﻿", "time": "2 days ago", "author": "T M"}
{"cid": "Ugx3MoMzjIhiNGUVald4AaABAg.8lYih3vR5GU8ljwD5xFo7x", "text": "It has 0 to do with mexicans... uk cops not even 5 years ago were crying about the asian gangs growing indoor skunk herb.. now he lies and says mexicans. Mexicans lost quality decades ago, americans and amsterdam people are running global cannabis now for a decade.. get real ... and weed was not made illegal because of oil, it was dupont and textiles like polyster, which cannabis hemp easily surpasses in the global market... 3m and dupont is why marijuana is illegal, ive studied subject and am a pro grower in denver, i know more lol﻿", "time": "1 day ago", "author": "derty QWERTY"}
{"cid": "Ugx3MoMzjIhiNGUVald4AaABAg.8lYih3vR5GU8ljxN7UPJZO", "text": "@derty QWERTY 'I know more'... Clearly you have not studied the racial divide mainly caused by a man called Harry Anslinger in america (That carried on to the uk) tryd to cause to blame mexican and black people... Nor have you studied the Hemp Car... Made to run on hemp instead of oil your ignorance shows in your comment..﻿", "time": "1 day ago (edited)", "author": "T M"}
{"cid": "UgwNS9C0XW9VdPhzVTJ4AaABAg", "text": "\"I enjoyed manipulating people.\" That's the mindset of the custodian's of morality in our society.﻿", "time": "6 days ago", "author": "Davivd2"}
{"cid": "UgwNS9C0XW9VdPhzVTJ4AaABAg.8lYiFR759fT8l_eDTqhmeN", "text": "We live in a society﻿", "time": "5 days ago", "author": "dip.C"}
{"cid": "UgwNS9C0XW9VdPhzVTJ4AaABAg.8lYiFR759fT8lepWPhbeqb", "text": "it really is﻿", "time": "3 days ago", "author": "Jionni Lil"}
{"cid": "UgzuWZREqFLyqv4APX14AaABAg", "text": "Guy says he accomplished nothing and liked what he did.﻿", "time": "6 days ago", "author": "Scott McGrath"}
{"cid": "Ugy7Xddxbd4JkwPAiR54AaABAg", "text": "His honesty is incredible!﻿", "time": "6 days ago", "author": "HAST DESIGN"}
{"cid": "UgxFRAXH6VDocQw7th14AaABAg", "text": "In a day and age like this I can’t lie I really appreciate the honesty﻿", "time": "6 days ago", "author": "Gravity Zero"}
{"cid": "Ugzz3evKEHOePLW6Xsh4AaABAg", "text": "Criminals will find something else to make profit, they don´t care about laws, they want to profit.﻿", "time": "6 days ago", "author": "Rafael Pinto"}
{"cid": "Ugzz3evKEHOePLW6Xsh4AaABAg.8lYheV91hUZ8lf_smA5lIS", "text": "Poverty creates street crime. No one would bother with petty crime if there was other options.﻿", "time": "3 days ago", "author": "airhab airhab"}
{"cid": "UgyEIrMxZUacmYqcqTB4AaABAg", "text": "Damn i feel really fucking bad for that dude that now has suicidal trust problems...﻿", "time": "6 days ago", "author": "MelonMan/RomanScrub"}
{"cid": "Ugw335Da8hsCQxaXgLh4AaABAg", "text": "I wish people would understand this and listen to people like him.﻿", "time": "6 days ago", "author": "jason mitchell"}
{"cid": "UgxG3u5XrvSS6WEUpDV4AaABAg", "text": "realist shit iv ever heard﻿", "time": "6 days ago", "author": "stack notes act broke"}
{"cid": "UgxQg7SVxXNEaESbyyF4AaABAg", "text": "Great video. The 'fun' thing is that a lot of people point at the Netherlands when they talk about a good drug policy, but actually the crackdowns over here on drug users and dealers may be even harder than in a lot of other countries. It's not legal to posses weed for example, you're just no prosecuted for possession.﻿", "time": "6 days ago", "author": "Marinus"}
{"cid": "UgzBvHI24oCAX5qPb5R4AaABAg", "text": "Everyone needs this outlook﻿", "time": "6 days ago", "author": "clay collins"}
{"cid": "UgwNyVzKHXNhmxQjaZd4AaABAg", "text": "How many times has this been reposted?﻿", "time": "6 days ago", "author": "Lazaro Aguilar"}
{"cid": "Ugzla1-uazkoarNMlgh4AaABAg", "text": "I've seen this guy before.......TG﻿", "time": "6 days ago", "author": "Will 1"}
{"cid": "Ugx3z21b9d18cxk1XrJ4AaABAg", "text": "this man should become an mp﻿", "time": "6 days ago", "author": "max elrick"}
{"cid": "UgxOOiIr-BKgSzI8pRN4AaABAg", "text": "The man seems sociopathic. Gaining the trust and friendship of those who are desperate, and then enjoying crushing them isn't a normal/empathetic mindset. Considering his respectable and positive intentions, work and logic towards drugs, its interesting to see how this \"mentally ill\" man can leave real value towards society with the right upbringing.﻿", "time": "6 days ago", "author": "Leon Yushin"}
{"cid": "UgxOOiIr-BKgSzI8pRN4AaABAg.8lYeabOmvwC8lZdqkpEb4w", "text": "Leon Yushin this is what you have to be in order to be a functioning cop, otherwise you won't fit in with the rest of the bastards.﻿", "time": "5 days ago", "author": "Freddie Vargas"}
{"cid": "Ugy0XxZNlk8m6Grcfnx4AaABAg", "text": "Is this a re upload? ive seen this before...﻿", "time": "6 days ago", "author": "WHO KNOWS"}
{"cid": "UgzQyJMRori9KFG-9wF4AaABAg", "text": "Ex drug user cop or....ex cop drug investigator....﻿", "time": "6 days ago", "author": "Josue Sanchez"}
{"cid": "Ugx-WBuN0x6UlcJbWvV4AaABAg", "text": "Big up Stoke for the dutty heroin 😂😂😂﻿", "time": "6 days ago", "author": "Ethan Wright"}
{"cid": "Ugyg1seNeSORXkdcRUB4AaABAg", "text": "Feel like I've seen this already?﻿", "time": "6 days ago", "author": "Alonzo Stanway"}
{"cid": "UgwkCYibr7r3C2OxGSh4AaABAg", "text": "This is the first time I've ever seen a cop support harm reduction strategies! My respects to you sir. You have a bright head on your shoulders.﻿", "time": "6 days ago (edited)", "author": "Alexander Tomaino"}
{"cid": "UgwvIfXW5YhA3ua7PQB4AaABAg", "text": "RACISM RACISM RACISM﻿", "time": "6 days ago", "author": "1 2"}
{"cid": "Ugxy3vQEq-lRb1vsjjd4AaABAg", "text": "The War On Drugs is pointless.﻿", "time": "6 days ago", "author": "iWillWakeYouUp"}
{"cid": "Ugxy3vQEq-lRb1vsjjd4AaABAg.8lYdAWRiwuY8lZeIufNcgs", "text": "iWillWakeYouUp pointless? but there is billions to be made?﻿", "time": "5 days ago", "author": "Freddie Vargas"}
{"cid": "Ugxy3vQEq-lRb1vsjjd4AaABAg.8lYdAWRiwuY8lZygN-rEch", "text": "Freddie Vargas  That's another story. You're right.﻿", "time": "5 days ago", "author": "iWillWakeYouUp"}
{"cid": "UgzMYahYFnA5KWEApyN4AaABAg", "text": "i wish they’d made a tv show on this guys undercover story﻿", "time": "6 days ago", "author": "Juan Ramirez"}
{"cid": "UgxF5SfyHAqo528MO6B4AaABAg", "text": "Very inciteful interview. The problem is the same whether LA, North Hampton, or Moscow.﻿", "time": "6 days ago", "author": "Pinstripe Jim"}
{"cid": "UgwbGZOAGoDGPLS5lI54AaABAg", "text": "I'd say the racist drug policies really derive from the U.S. during the Reagan era. Crack cocaine was being produced in South America and imported into the states, all under the direction of the CIA disguised as the cartels. I don't mean it as if the CIA agents we're literally cartel members, but that they intentionally allowed this to go on because it allowed for the government to target the black community. This may sound like a conspiracy theory to someone that's not knowledgeable, but it's not- an advisor to the president and high ranking person in the CIA famously said that they used the artificial crack cocaine and marijuana epidemic to target and disrupt the black and hippy communities. In fact, punishment for crack cocaine (a crystalized form of cocaine that was cheaper to produce by using less actual cocaine) had a far greater punishment than normal cocaine. The reason this is important is because normal cocaine could be found in middle-class suburban areas whereas crack was found in poorer areas, because it was more affordable. Both are cocaine, however the cheaper and dirtier form gave a harsher sentence. Political rhetoric by the Reagan and again by the Nixon administration furthered the idea of a drug epidemic in this country to give them a leg up in the political races, because while other politicians we're talking about standard issues, these politicians had talking points no one else had, and they were determined to fix this problem everyone was now aware of. It was political and racist, and the administration's pushed this anti-drug agenda to maintain the idea of a drug ravaged country by incentivizing police departments to make more drug related arrests and other forms to maintain the narrative. This all also fed the growing private prison industry- but that's a whole 'nother bag of worms.﻿", "time": "6 days ago", "author": "Jeffrey Samuels"}
{"cid": "UgwbGZOAGoDGPLS5lI54AaABAg.8lYc5x0uYUC8lZBlk3wffZ", "text": "Jeffrey Samuels actually it goes way back to chinese imigrants and Opium/heroin...﻿", "time": "6 days ago", "author": "Hans Wurst"}
{"cid": "UgwbGZOAGoDGPLS5lI54AaABAg.8lYc5x0uYUC8lZUltbg38s", "text": "You cite a conspiracy theory to support your idea that the law is racist. What's racist is you thinking colored people are incapable of following the rules that everyone does.﻿", "time": "5 days ago", "author": "Democrats are cunts"}
{"cid": "UgwbGZOAGoDGPLS5lI54AaABAg.8lYc5x0uYUC8lZc2z1iV3-", "text": "It's still going on to this day and not enough is being done about.﻿", "time": "5 days ago", "author": "Mike Coffin"}
{"cid": "UgwbGZOAGoDGPLS5lI54AaABAg.8lYc5x0uYUC8lZgkMpLeMo", "text": "Jeffrey Samuels nice﻿", "time": "5 days ago", "author": "monkeyTRAWMERcenter"}
{"cid": "UgwbGZOAGoDGPLS5lI54AaABAg.8lYc5x0uYUC8lZiAV9oDez", "text": "Watch that show called snowfall it gives u an insight of what ur talking about in the show there’s a cia agent who is posed as a good guy then u realize he was legally bringing in drugs and guns to the streets of Compton﻿", "time": "5 days ago", "author": "Uncle Jemima"}
{"cid": "UgwbGZOAGoDGPLS5lI54AaABAg.8lYc5x0uYUC8lZn7BRMShV", "text": "All drug policies the world over drive from the US,via the UN.﻿", "time": "5 days ago", "author": "Chris Brent"}
{"cid": "UgwbGZOAGoDGPLS5lI54AaABAg.8lYc5x0uYUC8l_bcBk9HqO", "text": "Jeffrey Samuels the FBI made weed illegal in the 30s so they could arrest Blacks﻿", "time": "5 days ago", "author": "Guinness"}
{"cid": "UgwbGZOAGoDGPLS5lI54AaABAg.8lYc5x0uYUC8l_oxYkrV-R", "text": "The sentences for crack are higher than for powdered cocaine partly because black leaders ASKED for tough sentencing for crack because it brought a huge amount of murder and mayhem to black neighborhoods.﻿", "time": "5 days ago", "author": "tartrazine5"}
{"cid": "UgwbGZOAGoDGPLS5lI54AaABAg.8lYc5x0uYUC8l_pg-COIYr", "text": "Big facts﻿", "time": "5 days ago", "author": "Drew Hoffman Music"}
{"cid": "UgwbGZOAGoDGPLS5lI54AaABAg.8lYc5x0uYUC8la1unxRFgC", "text": "Not a conspiracy theory at all. Look at freeway Rick Ross case. One of his direct contacts were cia. They intentionally set him up after he was already out of the game brought him back in under the guise of \"helping a friend\"﻿", "time": "5 days ago", "author": "Spade"}
{"cid": "UgwbGZOAGoDGPLS5lI54AaABAg.8lYc5x0uYUC8laAzBROe1I", "text": "Hey I have an idea! How about the blacks hit the government where it hurts and stop doing crack! There! Problem solved. Nice try, Uncle Sam!﻿", "time": "5 days ago", "author": "purosonoracompa"}
{"cid": "UgwbGZOAGoDGPLS5lI54AaABAg.8lYc5x0uYUC8lagLlhhfjQ", "text": "Vietnam war = smuggling drugs to the US. Case closed. Thanks government. Now ive been 10 years clean and i still hate my life and want some more﻿", "time": "5 days ago", "author": "Drawyoursword420"}
{"cid": "UgwbGZOAGoDGPLS5lI54AaABAg.8lYc5x0uYUC8lapK6KMTxi", "text": "Yes, even black communities supported the war on drugs in the 80's as it was a narrative that focused on a new issue that was made out to be \"tearing neighborhoods and communities apart\". It was rhetoric used in order to bring a new issue to the table, hence it allowed Reagan and later Nixon to dominate the polls- as arguably, their positions on drugs is what won them their elections. It's easy to blame drugs for the issues of the community, and frankly, black communities have a lot of issues and drugs, so linking those problems on the drugs gave them hope for finding a solution through harsher sentences. The rhetoric of the narrative wasn't \"we need to lock up black people\".﻿", "time": "5 days ago", "author": "Jeffrey Samuels"}
{"cid": "UgwbGZOAGoDGPLS5lI54AaABAg.8lYc5x0uYUC8laq8C1l1Zy", "text": "I'm not citing a conspiracy, in an interview for Harper's Magazine in 1994, John Ehrlichman - an advisor to Nixon said \n“The Nixon campaign in 1968, and the Nixon White House after that, had two enemies: the anti-war left and black people,” \n“We knew we couldn’t make it illegal to be either against the war or black, but by getting the public to associate the hippies with marijuana and blacks with heroin, and then criminalising both heavily, we could disrupt those communities. \n\n“We could arrest their leaders, raid their homes… and vilify them night after night on the evening news. Did we know we were lying about the drugs? Of course we did.”\n\nI also never said colored people couldn't follow the rules, there's drugs everywhere- however, what I am saying is that the drug crack cocaine- which is more prevalent in poor, colored communities would result in a harsher punishment than cocaine in it's powdered form, the same drug, but more expensive and hence more often found in middle and upper class neighborhoods. This has nothing to do with one type of person following the rules- and if you read what I wrote, you'd know that.﻿", "time": "5 days ago", "author": "Jeffrey Samuels"}
{"cid": "UgwbGZOAGoDGPLS5lI54AaABAg.8lYc5x0uYUC8liro9x3if8", "text": "The Clinton's brought it in thru the town of hope.  Racist mf.﻿", "time": "1 day ago", "author": "Åphmåu"}
{"cid": "UgwbGZOAGoDGPLS5lI54AaABAg.8lYc5x0uYUC8lj5J5kljFG", "text": "Nixon started the war on drugs tho...﻿", "time": "1 day ago", "author": "Jake Waugh"}
{"cid": "UgwbGZOAGoDGPLS5lI54AaABAg.8lYc5x0uYUC8lj93eERJQK", "text": "You don't import crack silly.﻿", "time": "1 day ago", "author": "occupynewparadigm"}
{"cid": "UgygYgXy77-8M319s9t4AaABAg", "text": "You enjoy being a scumbag. It may have been for good but you enjoyed it. What does that make you?﻿", "time": "6 days ago", "author": "Incoming Hit da dirt"}
{"cid": "Ugw3HQZ_ZRL3yB5-wcl4AaABAg", "text": "This undercover cop got addicted to drugs while working undercover and I agree with everything he says, he knows what go on.﻿", "time": "6 days ago", "author": "Bee"}
{"cid": "UgzWkeYQI_Wi-FvskWN4AaABAg", "text": "Where's the proof black and white to backup his credibility﻿", "time": "6 days ago", "author": "SpokenMindRecordzEnt"}
{"cid": "UgzWkeYQI_Wi-FvskWN4AaABAg.8lYbCQ47ZVC8lYmMG9XIpH", "text": "😁 bruh are u an internet Lawyer?﻿", "time": "6 days ago", "author": "Bobbito Chicon"}
{"cid": "UgwY73Tgt3B97NtjezB4AaABAg", "text": "The war on drugs is real﻿", "time": "6 days ago", "author": "No No"}
{"cid": "UgwLp09aUgriMzME_BB4AaABAg", "text": "Can you atleast translate this weird british language.﻿", "time": "6 days ago", "author": "papa mito"}
{"cid": "UgxYtBB8DxT-it3D_fZ4AaABAg", "text": "FUCK THIS GUY. at least he knowa what he did was FUTILE. i hope more undercovers watch this. the ones who stopped violent drug dealers are the best there is...but doing that even takes MORE guts﻿", "time": "6 days ago (edited)", "author": "James Crane"}
{"cid": "UgwgKY_oAnFO-Y8IYJV4AaABAg", "text": "Legalize all of it is the answer﻿", "time": "6 days ago", "author": "Josh Willard"}
{"cid": "Ugx3Qcrt4B5JM34jr114AaABAg", "text": "There are good people in the drug world.. it's rare but certain people will help u out﻿", "time": "6 days ago", "author": "keepitpushin121"}
{"cid": "UgxDsR5wt4OtdkSuRJ14AaABAg", "text": "They should just decriminalize use and let them take whatever they want.. I have no sympathy for users honestly. If they want to knowingly use drugs and hurt or kill themselves - then you might as well let them. As long as they're not committing other crimes or bothering other people - let them ruin themselves. It's like any other type of self harm imo, if u want to punch yourself in the face everyday for the rest of your life - then do it. But don't expect anyone to feel bad for you, especially when you knew what you were getting into before you tried it.﻿", "time": "6 days ago", "author": "OfficialRelyseMusic"}
{"cid": "Ugz0IzQV02e9bf8ENDR4AaABAg", "text": "DruGs ArE RaCisTt﻿", "time": "6 days ago", "author": "TheXTutorialsx"}
{"cid": "UgwZQ0NAvOew15IpRl94AaABAg", "text": "Well then﻿", "time": "6 days ago", "author": "Xoxocube"}
{"cid": "Ugxy2vHblSUXaoia4Nx4AaABAg", "text": "Genius﻿", "time": "6 days ago", "author": "Billy Highfill"}
{"cid": "Ugzfw2C78SA7fbLKXmR4AaABAg", "text": "That's fucked up man. The guy was being pressured to do crimes by a cartel and you also manipulated him into doing more? Wtf. Some cartels will kill you if you say no and dont work for them. Wow. You enjoyed exploiting the vulnerable? Sounds like you should be behind bars.﻿", "time": "6 days ago", "author": "MichaelsMoments"}
{"cid": "UgwpryUPyfaXVDOU7WZ4AaABAg", "text": "Respect﻿", "time": "6 days ago", "author": "Toyshika Peterson"}
{"cid": "Ugyae27cLZMfQYKanSR4AaABAg", "text": "This guy did an episode of Love+Radio about a year or so ago, IIRC. Made for a truly riveting podcast. This is my first time seeing his face and I somehow recognized him from the brief description in the thumbnail, realized I was correct midway through the video, quite an odd feeling. With all that being said, I've been struggling with heroin for the past couple years and opiates in general since I was a child, IMO everything he just said is 100% true.﻿", "time": "6 days ago", "author": "Dylan Beattie"}
{"cid": "UgyVccTGXDe0yRXKzbV4AaABAg", "text": "Glad to see VICE have someone from LEAP featured.﻿", "time": "6 days ago", "author": "Fintan"}
{"cid": "UgwmEtrtmUizBR5HYyR4AaABAg", "text": "This guy is spot on﻿", "time": "6 days ago", "author": "Dustin Miller"}
{"cid": "UgyhJWI_TnoYJyiw0FR4AaABAg", "text": "<33﻿", "time": "6 days ago", "author": "Costobocul"}
{"cid": "UgzI3aQkW2H9I-BjfjF4AaABAg", "text": "Here we go respect the rat now smsh 👎﻿", "time": "6 days ago", "author": "Rubin lopez"}
{"cid": "Ugxmz0xAmg0MawFLhNF4AaABAg", "text": "this problem dont of police this problem of medicine﻿", "time": "6 days ago", "author": "Michael Kair"}
{"cid": "UgzReADgkzc8y9bPOf94AaABAg", "text": "All while Unarmed omg﻿", "time": "6 days ago", "author": "Eric Dean"}
{"cid": "UgwZUrlqpyiqAWZ2EW14AaABAg", "text": "5:44 that is uncommon KNOWLEDGE.﻿", "time": "6 days ago", "author": "Oisin Willis"}
{"cid": "UgyRtSHlA39ZFNXvy8R4AaABAg", "text": "This should be a key voting issue for all people﻿", "time": "6 days ago", "author": "a name"}
{"cid": "UgwpXcMGR8_H-I2RcI94AaABAg", "text": "cant believe the total lack of remorse he showed for the guy who said he was his only friend.... I understand what that man was doing was illegal but it seems like he got there because of addiction and constant emotional manipulation. I hope he gets the help he needs in prison and can get out one day﻿", "time": "6 days ago", "author": "Kelsey"}
{"cid": "Ugyri2xI-icTwGBZrn14AaABAg", "text": "6 months of work for a drug supply interruption of no more than 2 hours. that's what you call high availability.﻿", "time": "6 days ago", "author": "Distortednet"}
{"cid": "UgzJ9AuraDSsjmGyPF14AaABAg", "text": "Police are NOTHING but predators.﻿", "time": "6 days ago", "author": "Lee Harvey Oswald"}
{"cid": "UgzJ9AuraDSsjmGyPF14AaABAg.8lYWry2K6I_8lZV_IysEfs", "text": "They are law enforcers. The predators are the addicts and dealers.﻿", "time": "5 days ago", "author": "Democrats are cunts"}
{"cid": "UgzJ9AuraDSsjmGyPF14AaABAg.8lYWry2K6I_8l_Fd4jhUJQ", "text": "@Democrats are cunts NO....they are predators. Stop sniffing their holster, badge bunny.﻿", "time": "5 days ago", "author": "Lee Harvey Oswald"}
{"cid": "UgzJ9AuraDSsjmGyPF14AaABAg.8lYWry2K6I_8l_O7DeXd5C", "text": "Lee Harvey Oswald You're disgusting. Even your username gave me cancer.﻿", "time": "5 days ago", "author": "शक्तिमान"}
{"cid": "UgzJ9AuraDSsjmGyPF14AaABAg.8lYWry2K6I_8la1IFfc-QD", "text": "Lee Harvey Oswald I’m a predator for wanting to help people?.... ok...﻿", "time": "5 days ago", "author": "Shikam187"}
{"cid": "Ugz1LeSGUw-ToKJICBh4AaABAg", "text": "Amazing, but governments are too greedy and close minded...on the next few decades, we will rrsloze that ALL drugs should be legal and the people who decide to do it, can do so in a safe environement.﻿", "time": "6 days ago", "author": "Dylan Laws"}
{"cid": "Ugy4ImWAypf4bT4yEWN4AaABAg", "text": "yeah and you and ur family will be hunted for life. no thanks. unless he moves country he gonna get done by drug lords﻿", "time": "6 days ago", "author": "Mooootrr"}
{"cid": "UgzHkyoRGK3UF5dtDRB4AaABAg", "text": "what a liberal propanda. vice you should stay away from political contents !﻿", "time": "6 days ago", "author": "malayneum"}
{"cid": "UgzRyJfshciZjxJi9xZ4AaABAg", "text": "It has nothing to do with race. Its about revenue and maintaining a prison population. The Goverment doesnt care who they hurt black, white, or whatever.﻿", "time": "6 days ago", "author": "Lee Harvey Oswald"}
{"cid": "UgxXb5APAEnsaVM452V4AaABAg", "text": "Repost﻿", "time": "6 days ago", "author": "thejtager"}
{"cid": "UgyxkSyzkPfee7R3UKt4AaABAg", "text": "What a little rat.﻿", "time": "6 days ago", "author": "Sephiroth"}
{"cid": "UgyLWA7CyD_pgsBnxRt4AaABAg", "text": "It should be illegal for cops to go undercover. Or be in unmarked cars.﻿", "time": "6 days ago", "author": "ABOUD"}
{"cid": "Ugx-yW8kcMQRSmz5J9x4AaABAg", "text": "I'm not sure if the interview was intentionally edited to make this guy seem like a total sociopath, or if he just is, but this really made my stomach churn. The way he talked about manipulating people and preying on the most vulnerable was tough to listen to.﻿", "time": "6 days ago", "author": "SimpleSock"}
{"cid": "Ugy52rlrikB5eKlPRah4AaABAg", "text": "why vice is always about RACISM?﻿", "time": "6 days ago", "author": "KACU LASHA"}
{"cid": "Ugy52rlrikB5eKlPRah4AaABAg.8lYVRfAOZdg8lZ3CBli3Y1", "text": "the drug prohibition and the cascading tsunami of problems that arose from that, was based off racism.  do you understand the history of what happened during the last 100 years regarding drug laws? i can tell you if you want to learn, or you can research it yourself.﻿", "time": "6 days ago", "author": "Intramental Studios"}
{"cid": "Ugy52rlrikB5eKlPRah4AaABAg.8lYVRfAOZdg8lZA-tjOLdB", "text": "Basically anything about the drug laws that exist started from racism, fear, and filling up the prisons to make money off of the prisoners and to make them work as slave labor. Exactly what the rich, white, 1% believe people of color belong, as their slaves.﻿", "time": "6 days ago", "author": "pookiehoney"}
{"cid": "Ugy52rlrikB5eKlPRah4AaABAg.8lYVRfAOZdg8lZWPaPUA-o", "text": "Because blacks want a reason other than personal responsibility as to why they are losers.﻿", "time": "5 days ago", "author": "Democrats are cunts"}
{"cid": "Ugy52rlrikB5eKlPRah4AaABAg.8lYVRfAOZdg8lZWYxtxnFT", "text": "@Intramental Studios the law isn't based on racism. If you think the government isn't enforcing it on whites and missing out on that money then you're the real sucker here.﻿", "time": "5 days ago", "author": "Democrats are cunts"}
{"cid": "Ugy52rlrikB5eKlPRah4AaABAg.8lYVRfAOZdg8l_dc--Lcq0", "text": "Democrats are cunts laws were based on race all the way back to ww2 do your research﻿", "time": "5 days ago", "author": "1pyroace1"}
{"cid": "Ugy52rlrikB5eKlPRah4AaABAg.8lYVRfAOZdg8l_fKUTOMsF", "text": "Democrats are cunts That isnt what im saying at all. Please learn, ive already written essay long explanations in this comment section and im not really feeling like doing this again. based on racism doesnt mean they don't enforce it on whites, look at the harrison narcotics tax act, or look at 1994 when John Erhrichman, assistant to president Richard Nixon, openly stated the drug war 1970 was largely perpetuated to disrupt anti war groups, the hippie counter culture movement, and black political groups. Dont be willfully ignorant to our history as a country.﻿", "time": "5 days ago", "author": "Intramental Studios"}
{"cid": "Ugy52rlrikB5eKlPRah4AaABAg.8lYVRfAOZdg8la185ciL14", "text": "KACU LASHA 1) racism is very prevalent 2) Vice doesn’t focus on it as much, it’s not their main thing really﻿", "time": "5 days ago", "author": "Shikam187"}
{"cid": "Ugy52rlrikB5eKlPRah4AaABAg.8lYVRfAOZdg8ldqF0LCo1X", "text": "They thrive on the racism narrative...probably better for views and ad clicks﻿", "time": "3 days ago", "author": "Guapo da God"}
{"cid": "Ugy52rlrikB5eKlPRah4AaABAg.8lYVRfAOZdg8ljJcGOUBVQ", "text": "Guapo da God   Believe it or not almost everything is somehow based around race and/or class. Even in the bible so that shows how long that concept has been around.﻿", "time": "1 day ago", "author": "Lord Papeles"}
{"cid": "Ugy52rlrikB5eKlPRah4AaABAg.8lYVRfAOZdg8ljwZ6ODZJB", "text": "This has ZERO to do with race or mexicans.. mexicans lost the weed game when Americans outdo their subpar product.. we grow the best, hands down fact. mexicans deal heroin now, weed game was lost even time magazine talked about the weed in america surpassing mexican brick... this was 0 to do with racism, it was about corporate synthetic fabric money from dupont... learn history kids, i already did and have many licenses to grow it.﻿", "time": "1 day ago", "author": "derty QWERTY"}
{"cid": "Ugy52rlrikB5eKlPRah4AaABAg.8lYVRfAOZdg8ljwq3bfvbd", "text": "Vice apparently doesnt know how to study drug law history... dupont and nylon is the reason weed and harmless sister plant hemp were banned..medical hemp doesnt even get you high, so ban of that was obviously about control of paper and hemp goods from out competing nylon.. learn kids, learn undercover cop... its not racism at all, stfu with that excuse﻿", "time": "1 day ago", "author": "derty QWERTY"}
{"cid": "Ugy52rlrikB5eKlPRah4AaABAg.8lYVRfAOZdg8lnSCvRnR6f", "text": "@Intramental Studios how do you explain that the majority of drug offences and convictions in the UK are white people?﻿", "time": "4 hours ago", "author": "Archibald Maule Ramsay"}
{"cid": "Ugww4KvMQD-XQIyMsJd4AaABAg", "text": "It makes me see these \"users\" as more human than addicts after seeing this.﻿", "time": "6 days ago", "author": "Thomas Mellon"}
{"cid": "Ugww4KvMQD-XQIyMsJd4AaABAg.8lYVC6OFHBS8lZ8qTx8CNc", "text": "Everyone is human. Everyone has their own struggles and reasons. Inability to feel empathy for people we don't know or understand is the main problem in this world right now.﻿", "time": "6 days ago", "author": "pookiehoney"}
{"cid": "UgwC1onhyCyDmAir0fF4AaABAg", "text": "This sort of sentiment is used by spies when they are in espionage operations against enemy countries they have a moral high ground for lying manipulating and all that cos they are doing it to their enemies.dont know how the cops rationalize doing it to their own country men.﻿", "time": "6 days ago", "author": "Humza Lodhi"}
{"cid": "Ugwshk7HASDYm3rtjbV4AaABAg", "text": "Come on vice let the man say the truth. Drug laws are never going to reform until the people who profit from them all have a change of heart. Lol like that will ever happen. Drug=🤑. No other way around it. Race is just how they became illegal in a time where incest was normal and violence was the only way to solve a problem or feel comfortable.﻿", "time": "6 days ago", "author": "KingSteezRIP"}
{"cid": "Ugwshk7HASDYm3rtjbV4AaABAg.8lYV5d_deHb8la6EvZEsvL", "text": "we just have to convince them that we could make even more money from the taxation of drugs﻿", "time": "5 days ago", "author": "first last"}
{"cid": "UgybPTyM04cMwM3inoN4AaABAg", "text": "An actor. Just like Neil Dear Grasse Tyson.﻿", "time": "6 days ago", "author": "The Pondering Critic"}
{"cid": "UgyXjoQOiOeRPfLX6-p4AaABAg", "text": "This was interesting﻿", "time": "6 days ago", "author": "Mischief Memoirs"}
{"cid": "UgzeFbQ4V2axxj4nI794AaABAg", "text": "Yes﻿", "time": "6 days ago", "author": "Metonymy1979"}
{"cid": "UgxwgsusLIeIdEgP3rJ4AaABAg", "text": "Interview with split actors﻿", "time": "6 days ago", "author": "The Homie"}
{"cid": "Ugz2BinAQUY39iQQ4AV4AaABAg", "text": "I've seen this before.....﻿", "time": "6 days ago", "author": "Sum Ting Wong"}
{"cid": "UgwdmWoHDTgL0iGkQoF4AaABAg", "text": "you just copied true gordy`s video lol..﻿", "time": "6 days ago", "author": "Luči Lučan"}
{"cid": "UgwaA8CI6a2DkUpVGZR4AaABAg", "text": "He talks it right. Leagalise it all and crime will drop by shit loads and the prison population will drop by 75%﻿", "time": "6 days ago", "author": "john shannon"}
{"cid": "UgwaA8CI6a2DkUpVGZR4AaABAg.8lYUE_QXivV8lZUvgnbf-K", "text": "Unemployment will go up, vehicular accidents will skyrocket, drug seeking behaviour will be accepted and there will be an entire community on welfare.﻿", "time": "5 days ago", "author": "Democrats are cunts"}
{"cid": "UgwaA8CI6a2DkUpVGZR4AaABAg.8lYUE_QXivV8lZa6J0cYMR", "text": "And they make too much money off it﻿", "time": "5 days ago", "author": "Dipz"}
{"cid": "UgwaA8CI6a2DkUpVGZR4AaABAg.8lYUE_QXivV8la3MXlvrQQ", "text": "Profit would also drop by 75%. Sadly, that idea is considered utopian because money is valued more than human life.﻿", "time": "5 days ago", "author": "Walsh Embellishment"}
{"cid": "UgwaA8CI6a2DkUpVGZR4AaABAg.8lYUE_QXivV8ljEJ99fhc1", "text": "Democrats are cunts  Your logic makes no sense. Vehicular accidents would go up how? People who use illegal drugs can still get high and drive. Also people who take prescribed drugs can get affected to a point where they cause an accident. Drunk driving and texting while driving is statistically the higher cause of car accidents and/or vehicular homicide. \n\nYou should stop getting your information and logic from social media.﻿", "time": "1 day ago", "author": "Lord Papeles"}
{"cid": "Ugw09sO3vi6UzBtFJN54AaABAg", "text": "F.T.P!! 🖕🏻🖕🏻﻿", "time": "6 days ago", "author": "Buttermaker 010"}
{"cid": "Ugy75cGBrz7kir5ELq94AaABAg", "text": "True Geordie already beat ya on this one﻿", "time": "6 days ago", "author": "Dylaaaaan"}
{"cid": "Ugy5voar8pqr7ilZC854AaABAg", "text": "This man knows the reality of criminals, drugs, and laws. He should be a consultant in an effort to change the policies.﻿", "time": "6 days ago", "author": "MrKydaman"}
{"cid": "UgxJXwL11LBnwKwEk5V4AaABAg", "text": "ok cocaine was always seem as a problem with every race but I do know where he's coming from with the thing about weed.﻿", "time": "6 days ago", "author": "Mark Wright"}
{"cid": "UgwRPRy1G-_NaPJxpNV4AaABAg", "text": "I like This Guy..He Should Be In Charge﻿", "time": "6 days ago", "author": "James Allen"}
{"cid": "UgwRPRy1G-_NaPJxpNV4AaABAg.8lYTvEkXKEB8lZ3yK72kDL", "text": "he's an actual sociopath though﻿", "time": "6 days ago", "author": "Justine McCloud"}
{"cid": "UgwRPRy1G-_NaPJxpNV4AaABAg.8lYTvEkXKEB8lZVO11sFR1", "text": "He wants to legalize drugs. He should not be allowed to speak. Neither should you.﻿", "time": "5 days ago", "author": "Democrats are cunts"}
{"cid": "UgwRPRy1G-_NaPJxpNV4AaABAg.8lYTvEkXKEB8lZVOp7yNHB", "text": "True But Some Times It takes A  Sociopath To Get Things Done﻿", "time": "5 days ago", "author": "James Allen"}
{"cid": "UgwvxwRGewmihtf46W14AaABAg", "text": "5:30 🤦🏿‍♂️﻿", "time": "6 days ago", "author": "danusty"}
{"cid": "Ugz3F9AskJQityP5f9B4AaABAg", "text": "you didn't ask the one question that most people would want to know. Has this cop  or any other Undercover cop ever had to use drugs in front of other people to maintain their cover?﻿", "time": "6 days ago (edited)", "author": "Total Control 871"}
{"cid": "UgxHGM0tHX3YP6R0Upt4AaABAg", "text": "Very interesting and candid interview!﻿", "time": "6 days ago", "author": "Kristy S."}
{"cid": "UgwAJecT9DvLYuQ-lD14AaABAg", "text": "Story's like this one is much more interesting than antiTrump this antiTrump that Thanks﻿", "time": "6 days ago", "author": "Poe Hernandez"}
{"cid": "Ugwn9k96ZUvYvJiRArt4AaABAg", "text": "Welp, I was going to watch until literally the first five seconds. Piss off﻿", "time": "6 days ago", "author": "Thomas"}
{"cid": "UgyOJkoixGZzSlK5IsN4AaABAg", "text": "Someone telling someone else what they can and can't consume is totally and completely archaic.﻿", "time": "6 days ago", "author": "jetter820"}
{"cid": "UgyOJkoixGZzSlK5IsN4AaABAg.8lYTQihsG3E8l_QHYSGXFl", "text": "Thats an arogantly gross simplification of the matter.﻿", "time": "5 days ago", "author": "शक्तिमान"}
{"cid": "UgyOJkoixGZzSlK5IsN4AaABAg.8lYTQihsG3E8laGhKwOkrP", "text": "Stay in school kids.﻿", "time": "5 days ago", "author": "शक्तिमान"}
{"cid": "UgyniF6PEXYa5hgbhz54AaABAg", "text": "Some one murk him please😊﻿", "time": "6 days ago", "author": "Reina Algabri"}
{"cid": "UgyniF6PEXYa5hgbhz54AaABAg.8lYSefZlV_X8lYVc_CTKca", "text": "All cops﻿", "time": "6 days ago", "author": "ThePunisher129"}
{"cid": "UgzN3VN7Gbd0yK1vqoN4AaABAg", "text": "People calling this man brave for putting poor people in prison for being addicts.﻿", "time": "6 days ago", "author": "stephano malakay"}
{"cid": "UgzN3VN7Gbd0yK1vqoN4AaABAg.8lYRqae2XGE8lZVIYz0exs", "text": "People commenting that addicts shouldn't be in jail for the crimes they commit so it's even.﻿", "time": "5 days ago", "author": "Democrats are cunts"}
{"cid": "UgzN3VN7Gbd0yK1vqoN4AaABAg.8lYRqae2XGE8l_BJZMWiqH", "text": "stephano malakay so you want them to avoid the law and keep providing gangs money to re invest so more people can get addicted﻿", "time": "5 days ago", "author": "Watchu mean hommie I don’t do drugs"}
{"cid": "UgzN3VN7Gbd0yK1vqoN4AaABAg.8lYRqae2XGE8l_jQBSupJk", "text": "They shouldn't be in prison, it's a harmless offense, they are addicts because they are uneducated and poor, that's not their fault.﻿", "time": "5 days ago", "author": "stephano malakay"}
{"cid": "UgzN3VN7Gbd0yK1vqoN4AaABAg.8lYRqae2XGE8laH7hpq9bj", "text": "Addiction is a choice, nig.﻿", "time": "5 days ago", "author": "Jedi116_"}
{"cid": "UgwLJWSqNdK1152jWg94AaABAg", "text": "I have a fcking exam tomorrow and it's 2am. Fck it anyway﻿", "time": "6 days ago", "author": "Med icine"}
{"cid": "UgzC-uB_fqc1foTDtxl4AaABAg", "text": "racism?whites dont have 2 hands to sell drugs?who wants sell them,some just want it more than others( easy money).﻿", "time": "6 days ago", "author": "pedro francisco"}
{"cid": "UgyuITguI-mSyjHAx-h4AaABAg", "text": "Just plain scummy to be someone's only \"friend\" and then turn their ass in﻿", "time": "6 days ago", "author": "Nathaniel the Animal"}
{"cid": "Ugw-MBpUGMH0f4rPvDF4AaABAg", "text": "yea.. nobody cares how the british do things.﻿", "time": "6 days ago", "author": "mich sles"}
{"cid": "Ugy0UlFagBpp_vcohQ94AaABAg", "text": "I'd like to be a cop when I graduate﻿", "time": "6 days ago", "author": "Buddy Ollie, Extreme"}
{"cid": "Ugy0UlFagBpp_vcohQ94AaABAg.8lYRDeU7wVD8lYTyVqsyDn", "text": "So you want to be a bully? Fine you will get what is coming to you﻿", "time": "6 days ago (edited)", "author": "ThePunisher129"}
{"cid": "Ugy0UlFagBpp_vcohQ94AaABAg.8lYRDeU7wVD8lYUQVDkSK1", "text": "@ThePunisher129 No, I want to make the world a safer place for children, stop school shootings, keep murderers off the street, protect citizens from harm and help them in emergencies.﻿", "time": "6 days ago (edited)", "author": "Buddy Ollie, Extreme"}
{"cid": "Ugy0UlFagBpp_vcohQ94AaABAg.8lYRDeU7wVD8lYgQb6z0yW", "text": "Buddy Ollie, Extreme .... you’re better off getting into politics then , thats where the real change is made﻿", "time": "6 days ago", "author": "Terry Dacktill"}
{"cid": "Ugy0UlFagBpp_vcohQ94AaABAg.8lYRDeU7wVD8lYkX3XVOCq", "text": "Be careful you don't score too highly on your tests as they reject candidates who are deemed to be too intelligent. Seriously, look it up.\n\nHave fun being a bully. Helping people is not what police do. If you want to help in emergencies be a fireman. Police do not get in harms way themselves and are generally disgusting human beings. \nGranted there are different breeds of LEO but I am referring specifically here to your standard shitkicker.﻿", "time": "6 days ago", "author": "TheBorogrove"}
{"cid": "Ugy0UlFagBpp_vcohQ94AaABAg.8lYRDeU7wVD8lZczm0EVy4", "text": "Buddy Ollie, Extreme don't watch tv cop shows.﻿", "time": "5 days ago", "author": "Freddie Vargas"}
{"cid": "Ugy0vM5SLgr0pXYaWIx4AaABAg", "text": "this is the mask i wore when i went undercover http://mauiwatch.com/wp-content/uploads/2015/05/mask-3.jpg﻿", "time": "6 days ago", "author": "CyberArmy"}
{"cid": "Ugyil0ya1L56APyPQ9x4AaABAg", "text": "Respect .  thanks Vice .﻿", "time": "6 days ago", "author": "Sovereign Sentience"}
{"cid": "Ugx4Fgu8uiwBuPDGW2N4AaABAg", "text": "So basically he is saying all drugs should be legal so the government gets a bring in 🙄🤭﻿", "time": "6 days ago", "author": "SARA"}
{"cid": "Ugyqy9E8WFR1qOzkPoF4AaABAg", "text": "Pig﻿", "time": "6 days ago", "author": "John Smith"}
{"cid": "UgwOSg4iedNfU_bJWKh4AaABAg", "text": "Yeshua  (Jesus Christ) is the way the truth and the life﻿", "time": "6 days ago", "author": "Jdor D"}
{"cid": "UgwOSg4iedNfU_bJWKh4AaABAg.8lYPuhoLEzy8lYQAswAJIt", "text": "Nah﻿", "time": "6 days ago", "author": "Bryan Tremblay"}
{"cid": "UgwOSg4iedNfU_bJWKh4AaABAg.8lYPuhoLEzy8lZX2kMMsGw", "text": "Jesus is imaginary﻿", "time": "5 days ago", "author": "Democrats are cunts"}
{"cid": "Ugy9T4zmNcsDYF-O63B4AaABAg", "text": "\"Being an undercover police you are not an actor. You are just playing a different version of yourself..\n\n It has always been about racism\".. \n\nThe truth in a nutshell! \n\nPolicy in the political arena depict everything.. \n\nCops enjoy what they do.. We all do .. \nThis guy has the empathy that so many of our policy makers need.﻿", "time": "6 days ago (edited)", "author": "Minister Martha McMurrian"}
{"cid": "UgykyfdCa2gpUT0Lg8t4AaABAg", "text": "5:53 such a disgusting truth﻿", "time": "6 days ago", "author": "bernard wallace"}
{"cid": "UgykyfdCa2gpUT0Lg8t4AaABAg.8lYPTgsRsW_8lZWstBce2C", "text": "It's never been about racism. It's about reducing the number of drug addicts in a given community. Black culture and views towards authority are the reason they are in prison. Nobody forced them to do drugs until they got caught.﻿", "time": "5 days ago", "author": "Democrats are cunts"}
{"cid": "UgyeRzlE25TpGz0IwSN4AaABAg", "text": "Now he will start undercover Dealing﻿", "time": "6 days ago", "author": "Maksab 1"}
{"cid": "UgxtZkpdlCXo7XXJtmJ4AaABAg", "text": "Dude looks like a narc﻿", "time": "6 days ago", "author": "Tearabull 29"}
{"cid": "UgxtZkpdlCXo7XXJtmJ4AaABAg.8lYPMizRih68lYUwXRacjH", "text": "He is literally a narc﻿", "time": "6 days ago", "author": "ThePunisher129"}
{"cid": "UgxtZkpdlCXo7XXJtmJ4AaABAg.8lYPMizRih68lYczls8Za7", "text": "No shit...﻿", "time": "6 days ago", "author": "Tearabull 29"}
{"cid": "UgzLy_Olj0JBn7x3sYx4AaABAg", "text": "Oof﻿", "time": "6 days ago", "author": "Joe S"}
{"cid": "UgxAHDw-TqCX8Tolo5J4AaABAg", "text": "Legalize all drugs and end this stupidity. Grow up, people use drugs. Always have, always will. Deal with it.﻿", "time": "6 days ago", "author": "Black Sun Sirius 777"}
{"cid": "UgxAHDw-TqCX8Tolo5J4AaABAg.8lYPC0N8FxX8lYW3pJIlGW", "text": "Don't Legalize decriminalize﻿", "time": "6 days ago", "author": "ThePunisher129"}
{"cid": "Ugx-aBZqzVJm4YFloat4AaABAg", "text": "Ik him from true geordie﻿", "time": "6 days ago", "author": "Siddh Shahi"}
{"cid": "UgwOn3mN6JsG4nny6A14AaABAg", "text": "4 seconds and LOL no.﻿", "time": "6 days ago", "author": "Smitty Werben Jaeger man Jensen"}
{"cid": "UgwsYl6CZd1eqhBcm5R4AaABAg", "text": "acab﻿", "time": "6 days ago", "author": "****"}
{"cid": "UgzXMl3Vo2kyFurDBaN4AaABAg", "text": "Go's deeper the international bankers love illegal drug cash to launder, HSBC been caught loads of times but get small fines HSBC was set up when the east indies company started supplying the Chinese with opium getting the population strung out there were 2 wars fought over it over 200 years ago & now look at Afghanistan in 01 it suppyed only 10%of the world heron now in18 it supplys over 95% of the worlds herion as well as supplying the pharmaceutical industry with opioid pain killers now there's a major addiction to prescription opined drugs look at the iran/contra in the 80s the Cia brining in 100s of tones of cocaine into the states, if the powers that be didn't want illegal drugs on the street there wouldn't be, Peace﻿", "time": "6 days ago (edited)", "author": "DUB1ification"}
{"cid": "UgzXMl3Vo2kyFurDBaN4AaABAg.8lYOUGY_1lk8lYPDYl9VM_", "text": "the issue is that in America, opiates were prescribed and are still prescribed way too much﻿", "time": "6 days ago", "author": "BH4x0r"}
{"cid": "UgzXMl3Vo2kyFurDBaN4AaABAg.8lYOUGY_1lk8lY__jjelJj", "text": "@BH4x0r you have big pharma paying doctors to over prescribe heavy opiates also it makes great money﻿", "time": "6 days ago", "author": "DUB1ification"}
{"cid": "UgzXMl3Vo2kyFurDBaN4AaABAg.8lYOUGY_1lk8lYlJ9t6NhP", "text": "Did you read that a bank connected to the housing market financial crash in 2007-08 had laundered $800,000,000 in drug money for Mexican Cartels? \n\nNo one did a day...﻿", "time": "6 days ago", "author": "chrisfilms84"}
{"cid": "UgzXMl3Vo2kyFurDBaN4AaABAg.8lYOUGY_1lk8lYm_wOgKhf", "text": "@chrisfilms84 the international banksters can do what they want﻿", "time": "6 days ago", "author": "DUB1ification"}
{"cid": "UgxBuXwEn4uALx7q5YN4AaABAg", "text": "Singapore doesn't have a drug problem. If you're willing to go to extreme measures, you can always eradicate drugs.﻿", "time": "6 days ago", "author": "panier66"}
{"cid": "UgxBuXwEn4uALx7q5YN4AaABAg.8lYODIrJ6g98lYP_S2R2tl", "text": "That's going to far I'm pretty sure there is a negative to it.﻿", "time": "6 days ago", "author": "Art Smosh"}
{"cid": "UgxBuXwEn4uALx7q5YN4AaABAg.8lYODIrJ6g98lYPhOE32dA", "text": "\"you can always eradicate drugs\"\n\nin that case more people will start making and selling synthetic drugs instead of normal ones, while they're much more dangerous by far, you can't fully eradicate drugs, its impossible.﻿", "time": "6 days ago", "author": "BH4x0r"}
{"cid": "UgxBuXwEn4uALx7q5YN4AaABAg.8lYODIrJ6g98lYbooBwElI", "text": "Murdering people isn't really something to show off about. Singapore's drug law is completely  barbaric. If someone has a drug problem, does that really justify the death penalty?﻿", "time": "6 days ago", "author": "magnetic0314"}
{"cid": "UgxBuXwEn4uALx7q5YN4AaABAg.8lYODIrJ6g98lYchGwGnpH", "text": "magnetic0314 it doesn't, but then again, throwing people in jail doesn't make any sense either. mainly because, when someone has a drug problem that does not make him/her instantly a thief﻿", "time": "6 days ago", "author": "BH4x0r"}
{"cid": "UgxBuXwEn4uALx7q5YN4AaABAg.8lYODIrJ6g98lYd0xaWZkc", "text": "@BH4x0r that's my point, drug users need to be rehabilitated and drug kingpins need to be hit with fraud charges, failure to pay taxes etc etc etc﻿", "time": "6 days ago", "author": "magnetic0314"}
{"cid": "UgxBuXwEn4uALx7q5YN4AaABAg.8lYODIrJ6g98la5zgCSfpK", "text": "magnetic0314  well a lot of drug kingpins do more than sell drugs like order MURDERS﻿", "time": "5 days ago", "author": "first last"}
{"cid": "UgxBuXwEn4uALx7q5YN4AaABAg.8lYODIrJ6g98lenCcgMqeU", "text": "Singapore has one of the lowest prevalence of drug abuse worldwide. According to the 2008 World Drug Report, 0.005 percent of the population of Singapore are cannabis users, 0.003 percent use ecstasy and 0.005 percent use opiates. However, skeptics question the validity and accuracy of the data, as the statistics are based on drug abuse arrests not on treatments. Some researchers suggest that drug use is more common that reported, with ecstasy and cocaine use common in underground dance clubs and with the wealthy elite.﻿", "time": "3 days ago", "author": "Tore Thyen"}
{"cid": "Ugx5_dP0A9TFhhc730h4AaABAg", "text": "0- 0:12 this man is woke! He allowed to come to the hood parties﻿", "time": "6 days ago", "author": "Dre"}
{"cid": "Ugx5_dP0A9TFhhc730h4AaABAg.8lYO9RfXoSM8lZW0Za5RM7", "text": "Yea and he'll have you all in cuffs. I hope he goes to all of your ghetto parties.﻿", "time": "5 days ago", "author": "Democrats are cunts"}
{"cid": "Ugx5_dP0A9TFhhc730h4AaABAg.8lYO9RfXoSM8ldwuQuwRLP", "text": "Democrats are cunts it was a joke .. you must be fun !﻿", "time": "3 days ago", "author": "Dre"}
{"cid": "UgxuOOj41H7jXyqSN7Z4AaABAg", "text": "I know police officers who undercover deep into the golden triangle, where the real drug lord lives where the real militia stationed, the death rate on those posts are rumors to be more than 50%, which can only be rumors because those officers except for a selected few will never be documented, never to be formally awarded, just in case their information got out, it's not a high paying job also, yet brave men class after class, generation after generation, keep the work going on, never backed down. As much as I wanted to, I really can't feel too sorry for these street drug operations, \"cleaning\" one corner in a while, always the drug dealer never the drug.﻿", "time": "6 days ago (edited)", "author": "liu travis"}
{"cid": "UgwtuVOsffFkrtnXTdB4AaABAg", "text": "Sociopath﻿", "time": "6 days ago", "author": "Gre Gre"}
{"cid": "UgyR0KwAiYrDW6vqNMV4AaABAg", "text": "Yea he looks like a real criminal 😂 I guess that look fly's in the uk﻿", "time": "6 days ago", "author": "refer kefer channel"}
{"cid": "UgwOoPyTbpLMPukX7Sd4AaABAg", "text": "This guy is awful. He ruined lives of people who were already in the gutter.﻿", "time": "6 days ago", "author": "New Religion"}
{"cid": "UgwOoPyTbpLMPukX7Sd4AaABAg.8lYN_xKOIFR8lYm1RdwYGK", "text": "Agreed..but they where all White People so lets give this guy a pass 😁﻿", "time": "6 days ago (edited)", "author": "Bobbito Chicon"}
{"cid": "UgwOoPyTbpLMPukX7Sd4AaABAg.8lYN_xKOIFR8lZcLmWIWro", "text": "ruining people's lives is what cops do.﻿", "time": "5 days ago", "author": "Freddie Vargas"}
{"cid": "UgwOoPyTbpLMPukX7Sd4AaABAg.8lYN_xKOIFR8l_O-ESpesq", "text": "Bobbito Chicon Who said anything about white people?﻿", "time": "5 days ago", "author": "शक्तिमान"}
{"cid": "UgxjVFKYuhBo5nE_KbF4AaABAg", "text": "legalize all drugs simple  as that﻿", "time": "6 days ago", "author": "zero"}
{"cid": "UgxjVFKYuhBo5nE_KbF4AaABAg.8lYNV4XOv458lYougdX-al", "text": "Yeah that'll work. Moron!!﻿", "time": "6 days ago", "author": "Paul Bear"}
{"cid": "UgxjVFKYuhBo5nE_KbF4AaABAg.8lYNV4XOv458lZ2sZulWou", "text": "tell me, what are the current issues with drugs? 1.  people overdose because unregulated substances, due to it being illegal.  2. violent crime and gang acitivity, due to it being illegal.  3. lack of knowledge of how to actually use the drug safely, difficult due to it being illegal.  4. getting help/treatment, shunned due to the stigma and risky due to it being illegal. You got anything to say other than an insult?﻿", "time": "6 days ago", "author": "Intramental Studios"}
{"cid": "UgxjVFKYuhBo5nE_KbF4AaABAg.8lYNV4XOv458lZJtvfvTA1", "text": "Intramental Studios depends on the drug if ur talking about crack there is no correct way to use it lol you use it and die ez as that﻿", "time": "6 days ago", "author": "Fid to nut"}
{"cid": "UgxjVFKYuhBo5nE_KbF4AaABAg.8lYNV4XOv458lZJvi1VwxN", "text": "Intramental Studios al your point makes no sense﻿", "time": "6 days ago", "author": "Fid to nut"}
{"cid": "UgxjVFKYuhBo5nE_KbF4AaABAg.8lYNV4XOv458l_otNUqz5a", "text": "@Paul Bear \nAlcohol is legal... how's that working?﻿", "time": "5 days ago", "author": "Thirt33n Tw3nty Thr33"}
{"cid": "UgxjVFKYuhBo5nE_KbF4AaABAg.8lYNV4XOv458l_zqi7f8m6", "text": "Yeah so kids around the neighbourhoods carry crack and meth in their school bags﻿", "time": "5 days ago (edited)", "author": "Deepansh Arora"}
{"cid": "UgyLoOTjLqh42KygVf94AaABAg", "text": "i wasnt expecting this dude to flip the switch into legislation mode﻿", "time": "6 days ago", "author": "FructoseComa"}
{"cid": "UgyLoOTjLqh42KygVf94AaABAg.8lYNSfRar_q8lYUnwlSfYl", "text": "Cops love legislation because it gives them more power.﻿", "time": "6 days ago", "author": "ThePunisher129"}
{"cid": "Ugwlo77_MN3VY_7UtVd4AaABAg", "text": "Samurai sword to the neck, “ I laughed about it later” ... lol?﻿", "time": "6 days ago", "author": "B. Levin"}
{"cid": "UgwxeI2i9lE6JBXcXVx4AaABAg", "text": "Pathetic 😂😂😂﻿", "time": "6 days ago", "author": "MREGGGOD1"}
{"cid": "UgyceE4Tb4WbW6Ngbfx4AaABAg", "text": "Cops coerce, steal and kill to protect from people who coerce, steal and kill. Apparently gun and permission means moral highground.﻿", "time": "6 days ago", "author": "Brian A. Nichols"}
{"cid": "UgyceE4Tb4WbW6Ngbfx4AaABAg.8lYN0XchFnz8lZVB2llk-l", "text": "As long as they are only killing colored people It's ok.﻿", "time": "5 days ago", "author": "Democrats are cunts"}
{"cid": "UgyceE4Tb4WbW6Ngbfx4AaABAg.8lYN0XchFnz8laKJThLj-z", "text": "Cops don't carry guns in the UK. Most of the AFOs are in London standing infront of embassies.﻿", "time": "5 days ago", "author": "justine turdois"}
{"cid": "UgyVbJQ1bG2tOjWlm1F4AaABAg", "text": "Pigs are still PIGS . But he's right. REFORM DRUG POLICY﻿", "time": "6 days ago", "author": "D. Razzlejazz"}
{"cid": "UgyVbJQ1bG2tOjWlm1F4AaABAg.8lYMsgKw78h8lZW8HxJWIU", "text": "Addicts are still addicts. But he's wrong. Harsher sentences for drug violations especially for colored people.﻿", "time": "5 days ago", "author": "Democrats are cunts"}
{"cid": "UgxdeockOk1rJnlSz_B4AaABAg", "text": "This mans book 'good cop, bad war' is a fantastic read for anyone who found this video interesting.﻿", "time": "6 days ago", "author": "Scott Guest"}
{"cid": "UgxdeockOk1rJnlSz_B4AaABAg.8lYMqJDxlJd8lYUeBWNZ3p", "text": "No such thing as a good cop﻿", "time": "6 days ago", "author": "ThePunisher129"}
{"cid": "UgytbV0gZCcXsrAUBX54AaABAg", "text": "i love the way he thinks about drugs and how they should be handled and how they are viewed﻿", "time": "6 days ago", "author": "MelaninMonsta"}
{"cid": "Ugx2uBPbZHXuftNi-Lx4AaABAg", "text": "It’s rare but vice can still whip out good videos﻿", "time": "6 days ago", "author": "Waynimations"}
{"cid": "Ugx2uBPbZHXuftNi-Lx4AaABAg.8lYMiYUVPTE8lYqsFOC-Ly", "text": "Waynimations this is a re-upload it was a old video few years back﻿", "time": "6 days ago", "author": "CROWN John"}
{"cid": "Ugwm4fWtz5L834ycVrN4AaABAg", "text": "i don't use any kind of drug but i agree with him drugs should be legal but regulated, there's no point of war on drug in US now the use of drugs are increasing, so you just locked up millions of people and charged their living cost to the public.﻿", "time": "6 days ago", "author": "Ooh Oops"}
{"cid": "UgwRgMVEJ-hQglXheSh4AaABAg", "text": "I know everything about undercover police job from Adrian Pimento.﻿", "time": "6 days ago", "author": "Lunethe Whip"}
{"cid": "UgwRgMVEJ-hQglXheSh4AaABAg.8lYMGuupsWu8lYOp5f7DmX", "text": "Lunethe Whip Dat brooklyn nine nine reference though 😃﻿", "time": "6 days ago", "author": "THE REAL HYPEBEAST"}
{"cid": "UgwRgMVEJ-hQglXheSh4AaABAg.8lYMGuupsWu8lYtmgg9KyK", "text": "Whos adrian pimento﻿", "time": "6 days ago", "author": "D.S.D.1 body"}
{"cid": "UgwRgMVEJ-hQglXheSh4AaABAg.8lYMGuupsWu8lYw7oZJs2m", "text": "@D.S.D.1 body omg﻿", "time": "6 days ago", "author": "Keegan Reacts"}
{"cid": "UgwRgMVEJ-hQglXheSh4AaABAg.8lYMGuupsWu8lZ-IxvYMIF", "text": "Jacob peralta﻿", "time": "6 days ago", "author": "Cjkc"}
{"cid": "UgwRgMVEJ-hQglXheSh4AaABAg.8lYMGuupsWu8lZNm-r2-eG", "text": "21 jump street for me﻿", "time": "6 days ago", "author": "Benny Ly"}
{"cid": "UgwRgMVEJ-hQglXheSh4AaABAg.8lYMGuupsWu8l_QGzxSlEB", "text": "yo daddy﻿", "time": "5 days ago", "author": "Hairless Sasquatch"}
{"cid": "UgwRgMVEJ-hQglXheSh4AaABAg.8lYMGuupsWu8ljvfsa8wV9", "text": "kids who watch horrible nbc, fox, and abc tv shows full of fakery and D grade acting﻿", "time": "1 day ago", "author": "derty QWERTY"}
{"cid": "UgyhcZ4G00qdPVcpUaB4AaABAg", "text": "What a snake﻿", "time": "6 days ago", "author": "Albert Twangle"}
{"cid": "UgyhcZ4G00qdPVcpUaB4AaABAg.8lYMB4Mx9u48lYVrjbQE5Y", "text": "161\nCrush the fascist snake\n                 161﻿", "time": "6 days ago", "author": "ThePunisher129"}
{"cid": "UgyiuMYjtQ-NP2RZA8h4AaABAg", "text": "Why doesn’t he use his own Class Ridden Country for an example? Some of the most vicious Racists I’ve met were British Oxford Trained Trust Fund Professors at UC Berkeley.﻿", "time": "6 days ago", "author": "1G3001"}
{"cid": "UgyV_eOZ-5sbHwjUY2N4AaABAg", "text": "I don't like what drugs do to addicts and communities but the drug war has been even worse.﻿", "time": "6 days ago", "author": "Eric Johnson"}
{"cid": "UgyV_eOZ-5sbHwjUY2N4AaABAg.8lYM0KEHBdH8lYPXDvPpOv", "text": "true, especially in America/Canada opiates are prescribed way too much and that's why most of the people get addicted to those opiates in the first place, then later when they start buying it illegally they'll just throw them in jail cause well it just funds the gangs/cartels instead of the pharmaceutical companies.\ndrug war should be gone, and those people should be helped instead of being thrown in jail.\nthat's my vision on it.﻿", "time": "6 days ago", "author": "BH4x0r"}
{"cid": "UgyV_eOZ-5sbHwjUY2N4AaABAg.8lYM0KEHBdH8lb5SsNaN6f", "text": "Yeah.  I agree.  Making all drugs legal creates entirely new problems, of course.  But throwing everyone in jail isn't working at all.﻿", "time": "4 days ago", "author": "Eric Johnson"}
{"cid": "UgyV_eOZ-5sbHwjUY2N4AaABAg.8lYM0KEHBdH8lb8WqySlh-", "text": "@Eric Johnson not really, it will just be decriminalized and properly manufactured and regulated, and easily available to addicted people, which means the users have less intentive to commit crime and they'll take the market away from the dealers﻿", "time": "4 days ago", "author": "BH4x0r"}
{"cid": "UgyV_eOZ-5sbHwjUY2N4AaABAg.8lYM0KEHBdH8lcSVcksJnI", "text": "@BH4x0r What happens when the makers of Fentanyl (etc.) can make any drug they want and have no restrictions or legal liability?﻿", "time": "4 days ago", "author": "Eric Johnson"}
{"cid": "Ugy57y4qwvguOzsMQZ54AaABAg", "text": "thank god the inmates and ex-cons don't have internet vice.﻿", "time": "6 days ago", "author": "Mad Hadder"}
{"cid": "Ugy57y4qwvguOzsMQZ54AaABAg.8lYLxzTcm758lYiHL89uQj", "text": "Mad Hadder Oh I’m sure most do. Even McDonalds has free WiFi lol﻿", "time": "6 days ago", "author": "Janelle 09"}
{"cid": "Ugy57y4qwvguOzsMQZ54AaABAg.8lYLxzTcm758lYiJv7fdaF", "text": "He’s obviously retired or he wouldn’t be sharing any of this. That or paid actor type﻿", "time": "6 days ago", "author": "Janelle 09"}
{"cid": "Ugy57y4qwvguOzsMQZ54AaABAg.8lYLxzTcm758l_qtz6rgdI", "text": "@Janelle 09 Well, here's to hoping he is in fact a paid actor because I believe the implication he's implying is a possible \nrevenge killing(even though the odds of it are low) should they see this, and they won't care if he's retired or not.﻿", "time": "5 days ago", "author": "Aiden Devere"}
{"cid": "Ugy57y4qwvguOzsMQZ54AaABAg.8lYLxzTcm758laO-4Xhn7J", "text": "He’s an actor﻿", "time": "5 days ago", "author": "CB"}
{"cid": "Ugy57y4qwvguOzsMQZ54AaABAg.8lYLxzTcm758lahrApiGt2", "text": "CB  if you do the smallest amount of  research yoy will find that he is NOT an actor and that is actually him.﻿", "time": "5 days ago", "author": "Brurgh"}
{"cid": "Ugy57y4qwvguOzsMQZ54AaABAg.8lYLxzTcm758likhok19fO", "text": "@Janelle 09 Retired or not. A pissed off person, specially an ex con can literally find anyone if they are mad enough & try hard enough. Dude has balls to do this.﻿", "time": "1 day ago", "author": "I Brought The Horizon"}
{"cid": "Ugy57y4qwvguOzsMQZ54AaABAg.8lYLxzTcm758ljvWX6EwwW", "text": "Cons have internet, phones are smuggled into jails world wide, even america for sure.. talk to a big city prison guard... phones are common, and women even smuggle in with vagina and pass to their husband... and drone drops daily now﻿", "time": "1 day ago", "author": "derty QWERTY"}
{"cid": "UgzYAEe7_ESxRHP3m8N4AaABAg", "text": "Cool. It’s that doc that vice posted a shit long ago.﻿", "time": "6 days ago", "author": "Rick"}
{"cid": "Ugxlu4dcDvZAVYNcCEd4AaABAg", "text": "So tell me, do you keep the stash after a raid?﻿", "time": "6 days ago", "author": "Definitely Not Snowden"}
{"cid": "UgxP1TN4Ji1jB_goBTl4AaABAg", "text": "Won’t the continuing rise of social media negate the use of undercover police, if you tell a gang that your names Toby Juggs and you’re a drug dealer but they can’t find one trace of you on any social media site it’s going to raise some eyebrows, you could still get away with walking up to a dealer and buying off them once but infiltration will soon be a thing of the past﻿", "time": "6 days ago", "author": "Izzy Skint"}
{"cid": "UgxP1TN4Ji1jB_goBTl4AaABAg.8lYL_WuOkK_8lYYoNth5Xy", "text": "Izzy Skint Cops aren’t dumb so I think they pay attention to that﻿", "time": "6 days ago", "author": "Muzzardonmyfeet"}
{"cid": "Ugxl8Fnz8lwfE6NDptJ4AaABAg", "text": "\"I changed people's lives around and not for the better\". How can u say that? Did u not stall the drugs and maybe those people got help? A lot of people won't stop until they face court and jail time. Thank u for being an advocate for harm reduction. Day one abstinence doesn't work. Less than  five percent are sober for a year. Jail isn't the answer. Abstinence isn't. A harness reduction program helped me stay sober over 4 years now. I was in that program 3 years. Changed my life. Only problem is it cost over five grand a year???﻿", "time": "6 days ago", "author": "nellie cat"}
{"cid": "Ugxl8Fnz8lwfE6NDptJ4AaABAg.8lYLOhjMpA28l_3VzNsmpI", "text": "most drug users drink alcohol, some just smoke weed, and a tiny little group of people have a real problem with hard drugs. help them, don't put them in jail.﻿", "time": "5 days ago", "author": "SeazBreeze"}
{"cid": "UgwxG3GoA7PS2jzeoPp4AaABAg", "text": "Idk why I misread the title and I was like what?﻿", "time": "6 days ago", "author": "linna amanda"}
{"cid": "UgwxG3GoA7PS2jzeoPp4AaABAg.8lYL1cyn0Pm8lYRC06sp__", "text": "how ?﻿", "time": "6 days ago", "author": "Ahmed Tarek"}
{"cid": "UgwxG3GoA7PS2jzeoPp4AaABAg.8lYL1cyn0Pm8lYX3yGx5_K", "text": "@Ahmed Tarek I interpreted ex-drug cop as drug cop's ex (as in lover). I'm a mess﻿", "time": "6 days ago (edited)", "author": "linna amanda"}
{"cid": "Ugx8CmJjDKii-WklGT14AaABAg", "text": "Where’d you find this guy? Some back alley in London?﻿", "time": "6 days ago", "author": "fate_f30"}
{"cid": "Ugx8CmJjDKii-WklGT14AaABAg.8lYL1VjJjU88lZ0rPuSLhl", "text": "Clearly not as his accent is from the Midlands.﻿", "time": "6 days ago", "author": "Funky Monkey1886"}
{"cid": "UgwsIH_Yya-S4D4XupJ4AaABAg", "text": "How much he made during all these years living like a sick rat? Nevermind you never gonna ask him the relevant questions 😂﻿", "time": "6 days ago", "author": "Juicy J-Hope"}
{"cid": "UgwsIH_Yya-S4D4XupJ4AaABAg.8lYKqDNLmQG8lYRnl4aBH0", "text": ", your a thinker﻿", "time": "6 days ago", "author": "Said ex-muslim Atheist"}
{"cid": "UgwsIH_Yya-S4D4XupJ4AaABAg.8lYKqDNLmQG8lYT_L508Ke", "text": "All cops deserve 💀 \nThey have murdered all our heroes.﻿", "time": "6 days ago", "author": "ThePunisher129"}
{"cid": "UgwsIH_Yya-S4D4XupJ4AaABAg.8lYKqDNLmQG8lZVqVNSgHz", "text": "@ThePunisher129 your heroes deserved to die. Hopefully they will keep killing them and getting away with it.﻿", "time": "5 days ago", "author": "Democrats are cunts"}
{"cid": "Ugx_Wcbd6QbYpMUJQ1h4AaABAg", "text": "So for the time he was undercover how did he go about using drugs himself ? No way he couldn’t use. Great life Not﻿", "time": "6 days ago", "author": "Joanne porter"}
{"cid": "Ugx_Wcbd6QbYpMUJQ1h4AaABAg.8lYKkyI3NbV8lYPmX-xf9T", "text": "why the hell wouldn't you be able to just not use them?﻿", "time": "6 days ago", "author": "BH4x0r"}
{"cid": "Ugx_Wcbd6QbYpMUJQ1h4AaABAg.8lYKkyI3NbV8lYpFYYP9-S", "text": "Because your going to score with another drug user eventually the guy with you is going to go in and use or go back some place to use the drugs they have been earning for all day. Do you think drug users keep it in there pocket all day﻿", "time": "6 days ago (edited)", "author": "Joanne porter"}
{"cid": "UgzMCLhH_v6Y8SvjZpp4AaABAg", "text": "REPOST﻿", "time": "6 days ago", "author": "Trevor Miranda"}
{"cid": "UgzarSpvpvk3YGr6RQN4AaABAg", "text": "Wow...enjoyed the lie and manipulating...=/    takes a certain type...﻿", "time": "6 days ago", "author": "Dazanar"}
{"cid": "UgzarSpvpvk3YGr6RQN4AaABAg.8lYKhFTDmTo8lYKnJSbK1Z", "text": "Harm reduction is spot on tho﻿", "time": "6 days ago", "author": "Dazanar"}
{"cid": "UgzarSpvpvk3YGr6RQN4AaABAg.8lYKhFTDmTo8lYLkZmK6bT", "text": "Aka your average cop type...﻿", "time": "6 days ago", "author": "Rickest Rick"}
{"cid": "UgzarSpvpvk3YGr6RQN4AaABAg.8lYKhFTDmTo8lZ4oqtZ7CG", "text": "Dazanar Yep.. Those are the exact type of people who end up running for higher offices such as VP or president of the U.S. I read an article that said the people who have the same characteristics as a serial killers are the same people who run for office & typically succeed.﻿", "time": "6 days ago", "author": "Pennylane is Almost famous"}
{"cid": "UgzarSpvpvk3YGr6RQN4AaABAg.8lYKhFTDmTo8lZ9IGKj9DA", "text": "To pass the psych test to be a cop you basically have to be a criminal who hasn't been caught yet. They want them to have criminal minds to catch criminals. It's why police are so corrupt.﻿", "time": "6 days ago", "author": "pookiehoney"}
{"cid": "UgwUCK3cVwXrKyh561Z4AaABAg", "text": "First decent vice post in a while﻿", "time": "6 days ago", "author": "Peter Pan"}
{"cid": "Ugyx1avDyBn3hcEEMfB4AaABAg", "text": "You get it Sir. Sorry you had to go through that to get here.  Wish more understood﻿", "time": "6 days ago", "author": "Chef-anie holtzzz"}
{"cid": "UgxsQYlizPsMHG_Uu6x4AaABAg", "text": "SNITCH 🖕🏼👊🏼\nThat’s what he is. He was probably the kid that told on other kids in grade school. I hope he gets his someday, and one day maybe his children get kidnapped or he opens the door and BOOM shotgun to the face.﻿", "time": "6 days ago", "author": "theDARK Pototoy"}
{"cid": "UgwBtMnLtqXgvpv8PaR4AaABAg", "text": "Dont listen to this guy, he isnt a united states police officer. Its different in each country.﻿", "time": "6 days ago", "author": "alpha robins"}
{"cid": "UgwBtMnLtqXgvpv8PaR4AaABAg.8lYKDJMypTj8lYKlJcmtr_", "text": "Well played captain obvious, was it the accent that told you he was British, or the name of the places ?﻿", "time": "6 days ago", "author": "Thierry Schork"}
{"cid": "UgwBtMnLtqXgvpv8PaR4AaABAg.8lYKDJMypTj8lYPaQCn9Ns", "text": "@Thierry Schork LMFAOO , hold this W 🤣😂﻿", "time": "6 days ago", "author": "WolfzyArts"}
{"cid": "UgwBtMnLtqXgvpv8PaR4AaABAg.8lYKDJMypTj8lYPnSrwQFk", "text": "@Thierry Schork lol well no shit Sherlock. You do have morons in here that will think he is.﻿", "time": "6 days ago", "author": "alpha robins"}
{"cid": "UgwBtMnLtqXgvpv8PaR4AaABAg.8lYKDJMypTj8lYQCR1DlLL", "text": "No shit really? What's next, you going to tell me the sky is blue?﻿", "time": "6 days ago", "author": "Lewis"}
{"cid": "UgwBtMnLtqXgvpv8PaR4AaABAg.8lYKDJMypTj8lYQXsrt-Sy", "text": "@alpha robins obviously if he has a british accent, and mentions european regions while speaking of his work, dont you think theres a 99.9% chance he isnt a US police officer? LMFAO dumbfuck﻿", "time": "6 days ago (edited)", "author": "WolfzyArts"}
{"cid": "UgwBtMnLtqXgvpv8PaR4AaABAg.8lYKDJMypTj8lYeg-azgUD", "text": "You do realise there is different countries in the world outside the US and different cultures?﻿", "time": "6 days ago", "author": "Alonzo Stanway"}
{"cid": "UgwBtMnLtqXgvpv8PaR4AaABAg.8lYKDJMypTj8lYhdrHjswO", "text": "@Alonzo Stanway typical American thinks the whole world revolves around them﻿", "time": "6 days ago", "author": "Lewis"}
{"cid": "UgwBtMnLtqXgvpv8PaR4AaABAg.8lYKDJMypTj8lZdZNsF-Pb", "text": "seriously Americans always on a high horse.﻿", "time": "5 days ago", "author": "Freddie Vargas"}
{"cid": "UgwBtMnLtqXgvpv8PaR4AaABAg.8lYKDJMypTj8la8q0U76Oj", "text": "@WolfzyArts go back to your territory before I expose your name, dob, and address and let your mom know what you doing on the internet. I already found vulnerabilities towards you #whitehat﻿", "time": "5 days ago", "author": "alpha robins"}
{"cid": "UgwBtMnLtqXgvpv8PaR4AaABAg.8lYKDJMypTj8la9baRn16j", "text": "@alpha robins Everybody knows my name is jose, I live in Mexico, and my address is 8976 You a dummy drive Jalisco, Mexico﻿", "time": "5 days ago", "author": "WolfzyArts"}
{"cid": "UgwBtMnLtqXgvpv8PaR4AaABAg.8lYKDJMypTj8laNnJA0Jlb", "text": "keep driving for pizza hut and playing video games bro.  Im just going to say a state and say Georgia. Im done bro, im glad we can both waste each others time in trolling! you can have the last word﻿", "time": "5 days ago", "author": "alpha robins"}
{"cid": "UgzDBV1bKw64nqeQHn14AaABAg", "text": "Drug addict turned cop.﻿", "time": "6 days ago", "author": "Zoe Rose"}
{"cid": "Ugyol3lXA59DdOSN-hh4AaABAg", "text": "This is the vice I signed up for﻿", "time": "6 days ago", "author": "tragoedia veritas"}
{"cid": "Ugyol3lXA59DdOSN-hh4AaABAg.8lYJxHc-xHV8lYSHWot6dZ", "text": "I came here for weed﻿", "time": "6 days ago", "author": "Nathaniel the Animal"}
{"cid": "Ugyol3lXA59DdOSN-hh4AaABAg.8lYJxHc-xHV8lYl0DcbmBk", "text": "vice that takes a story someone else already did and does it verbatim? ok.. btw vice's variety is nice..﻿", "time": "6 days ago", "author": "packerpf"}
{"cid": "Ugyol3lXA59DdOSN-hh4AaABAg.8lYJxHc-xHV8lYpDe56eLY", "text": "it's a re-upload dude shit's old vice﻿", "time": "6 days ago", "author": "HgihAsFcuk"}
{"cid": "Ugyol3lXA59DdOSN-hh4AaABAg.8lYJxHc-xHV8lZ7B6kF4pV", "text": "Agreed﻿", "time": "6 days ago", "author": "BNKS AUDIO GROUP"}
{"cid": "Ugyol3lXA59DdOSN-hh4AaABAg.8lYJxHc-xHV8lZU_d00VfQ", "text": "So liberal twisted bullshit that makes the naive feel bad for criminals.﻿", "time": "5 days ago", "author": "Democrats are cunts"}
{"cid": "Ugyol3lXA59DdOSN-hh4AaABAg.8lYJxHc-xHV8l_jXhQ6Xih", "text": "Democrats are cunts  - Sorry hearing the truth from someone that was inside drug enforcement hurts your tiny pathetic mind.﻿", "time": "5 days ago", "author": "DeathSquadDesign"}
{"cid": "Ugyol3lXA59DdOSN-hh4AaABAg.8lYJxHc-xHV8l_w5MhnCQt", "text": "Democrats are cunts wah wah wah﻿", "time": "5 days ago", "author": "Look A G"}
{"cid": "Ugyol3lXA59DdOSN-hh4AaABAg.8lYJxHc-xHV8lawRJHYFF_", "text": "yeah the last two videos have been decent. I wish theyd stay away from the buzzfeed bullshit. Like the weed videos are ok but weed isnt that forbidden fruit anymore, no one really gives a fuck. They should keep their content have more depth - how to roll a sushi blunt is not depth.﻿", "time": "5 days ago", "author": "Akiro Style"}
{"cid": "Ugyol3lXA59DdOSN-hh4AaABAg.8lYJxHc-xHV8ll5rDx97Gy", "text": "Seriously! New Vice is almost always absolutely laughable crap! This is exactly the kind of story I want from Vice!﻿", "time": "1 day ago", "author": "Dan. W."}
{"cid": "Ugx6yFYwzdM0TCvTl8t4AaABAg", "text": "This is a reupload?!?!?!?!?﻿", "time": "6 days ago", "author": "gwynn jago"}
{"cid": "UgxAiV9TTx6gP9Yy8Nh4AaABAg", "text": "Fucking narc.﻿", "time": "6 days ago", "author": "Yegor"}
{"cid": "UgxAiV9TTx6gP9Yy8Nh4AaABAg.8lYJndy68sz8lYTsBFx0Xq", "text": "He knows the problem but still wont kill himself. Sad.﻿", "time": "6 days ago", "author": "ThePunisher129"}
{"cid": "UgxAiV9TTx6gP9Yy8Nh4AaABAg.8lYJndy68sz8lYUQbd1Hvt", "text": "@ThePunisher129 every rat needs to swallow a barrel.﻿", "time": "6 days ago", "author": "Yegor"}
{"cid": "UgxAiV9TTx6gP9Yy8Nh4AaABAg.8lYJndy68sz8l_Ndp7by7l", "text": "Yegor And if they all did your simp ass would be the first to get knifed in the street for their pocket change. People like you have no idea what you're talking about.﻿", "time": "5 days ago (edited)", "author": "शक्तिमान"}
{"cid": "Ugxa4ASi5H4ZgE0MXt54AaABAg", "text": "Smart man﻿", "time": "6 days ago", "author": "samuel paulson"}
{"cid": "Ugw06K7rb7BULPu2Ijp4AaABAg", "text": "nasty pig﻿", "time": "6 days ago", "author": "1999californication"}
{"cid": "Ugx1Eq_vOSpJ3_jGWvt4AaABAg", "text": "woke man﻿", "time": "6 days ago", "author": "Cosmo"}
{"cid": "Ugyj2PcKowhXVolWbq14AaABAg", "text": "🐷🐷﻿", "time": "6 days ago", "author": "MegaHurtz"}
{"cid": "UgyYDFLl2UqyoAMjXxh4AaABAg", "text": "I only go undercover during Rainy season ,when I am without umbrella :)﻿", "time": "6 days ago", "author": "A K"}
{"cid": "UgwwTugII37QlmGFDKl4AaABAg", "text": "B A N D I T﻿", "time": "6 days ago", "author": "HJL1130"}
{"cid": "UgxEHcK_r_Z3ulN0UWN4AaABAg", "text": "going undercover is a scummy thing period. there is a reason why they picked him like that﻿", "time": "6 days ago", "author": "flimz"}
{"cid": "UgxEHcK_r_Z3ulN0UWN4AaABAg.8lYJIX22-9S8lYaOOtrbIh", "text": "How is it scummy﻿", "time": "6 days ago", "author": "TheXTutorialsx"}
{"cid": "UgxEHcK_r_Z3ulN0UWN4AaABAg.8lYJIX22-9S8lYdx6IstDQ", "text": "literally betraying people﻿", "time": "6 days ago", "author": "flimz"}
{"cid": "UgxEHcK_r_Z3ulN0UWN4AaABAg.8lYJIX22-9S8lYe5hZrxq0", "text": "even police them self that dont work as undercover think its scummy﻿", "time": "6 days ago", "author": "flimz"}
{"cid": "UgxEHcK_r_Z3ulN0UWN4AaABAg.8lYJIX22-9S8lYjM0Gw7r9", "text": "@flimz Oh no don't betray the criminals destroying lives. #feelingsmatter﻿", "time": "6 days ago", "author": "nardinit"}
{"cid": "UgxEHcK_r_Z3ulN0UWN4AaABAg.8lYJIX22-9S8lYpErf4NNw", "text": "ur actually 12. criminals are criminals they are bad people but that undercover cop is no different﻿", "time": "6 days ago", "author": "flimz"}
{"cid": "UgxEHcK_r_Z3ulN0UWN4AaABAg.8lYJIX22-9S8lYpR1rXI7H", "text": "@nardinit bullshit. i missed the part where there undercovers infiltrating fast foods restaurants and chemical companies killing millions of people. oh thats right .... they dont. \n      you dont give two fucks about them ruining lives and nor does law enforcement. this cop even said it.﻿", "time": "6 days ago", "author": "J. Jo"}
{"cid": "UgxEHcK_r_Z3ulN0UWN4AaABAg.8lYJIX22-9S8lYpWtN-SFf", "text": "the cop is playing the same dirty game they are playing wich is wrong﻿", "time": "6 days ago", "author": "flimz"}
{"cid": "UgxEHcK_r_Z3ulN0UWN4AaABAg.8lYJIX22-9S8lYqVfSpEwL", "text": "if u play them like that one day u will be played like that 2 .The criminals absolutely deserve betrayal but betrayal is betrayal and that's that it's a horrible job not just bcs its dangerous but bcs ur putting dirt on ur self﻿", "time": "6 days ago (edited)", "author": "flimz"}
{"cid": "UgxEHcK_r_Z3ulN0UWN4AaABAg.8lYJIX22-9S8lcIoODsoVc", "text": "@J. Jo You never heard of health and safety inspectors? They're basically food industry police. What a silly rebuttal﻿", "time": "4 days ago", "author": "nardinit"}
{"cid": "UgxEHcK_r_Z3ulN0UWN4AaABAg.8lYJIX22-9S8lcJWRqreOF", "text": "@nardinit yes they do such a wonderful job......ha.﻿", "time": "4 days ago", "author": "J. Jo"}
{"cid": "Ugz8N7FEXnvhhPrPvpZ4AaABAg", "text": "A.C.A.B.﻿", "time": "6 days ago", "author": "deathuponusalll"}
{"cid": "UgzOvFBENswcpfrTze94AaABAg", "text": "Wow the comments are on this time﻿", "time": "6 days ago", "author": "A P"}
{"cid": "UgwWzFWjRmgviEH5CCp4AaABAg", "text": "Legalise all drugs but poison 0.01% of them as a tax﻿", "time": "6 days ago", "author": "rmckim"}
{"cid": "UgwWzFWjRmgviEH5CCp4AaABAg.8lYJ5mEXaTD8lYK20VpUee", "text": "Wtf?﻿", "time": "6 days ago", "author": "Erik Rudberg"}
{"cid": "UgwWzFWjRmgviEH5CCp4AaABAg.8lYJ5mEXaTD8lYLW2crwWj", "text": "rmckim Don’t think you know what tax means...﻿", "time": "6 days ago", "author": "Rickest Rick"}
{"cid": "UgwWzFWjRmgviEH5CCp4AaABAg.8lYJ5mEXaTD8lYO0ogvaht", "text": "Why to poison a drug? You will die anyway﻿", "time": "6 days ago", "author": "Spurious G"}
{"cid": "UgwWzFWjRmgviEH5CCp4AaABAg.8lYJ5mEXaTD8lYQls6kJyw", "text": "@Spurious G I think he meant to legalize every drug but poison and they have taxes﻿", "time": "6 days ago", "author": "Calvin"}
{"cid": "UgwWzFWjRmgviEH5CCp4AaABAg.8lYJ5mEXaTD8lYSekdkqL7", "text": "The government did that before spraying Pequot on weed and poisoning bootleg alcohol during prohibition﻿", "time": "6 days ago", "author": "Spencer Chudyk"}
{"cid": "UgwWzFWjRmgviEH5CCp4AaABAg.8lYJ5mEXaTD8lYVd_-qfXq", "text": "@Spencer Chudyk in what country this happend? Like in an Alien Planet?﻿", "time": "6 days ago", "author": "Spurious G"}
{"cid": "UgwWzFWjRmgviEH5CCp4AaABAg.8lYJ5mEXaTD8lYVpUZn5p9", "text": "Everyone - Stop Masturbating.﻿", "time": "6 days ago", "author": "rmckim"}
{"cid": "UgwWzFWjRmgviEH5CCp4AaABAg.8lYJ5mEXaTD8lYW0bVJKtg", "text": "I fully understand economics and taxes. Next you will tell me we cannot nationalise our jews.﻿", "time": "6 days ago", "author": "rmckim"}
{"cid": "UgwWzFWjRmgviEH5CCp4AaABAg.8lYJ5mEXaTD8lYg9xmRXof", "text": "rmckim ... shut up McRim﻿", "time": "6 days ago", "author": "Terry Dacktill"}
{"cid": "UgwWzFWjRmgviEH5CCp4AaABAg.8lYJ5mEXaTD8lYwINABDjJ", "text": "@Terry Dacktill quit yo jibba jabba﻿", "time": "6 days ago", "author": "rmckim"}
{"cid": "UgwWzFWjRmgviEH5CCp4AaABAg.8lYJ5mEXaTD8lZ3XZbl73Q", "text": "@Spurious G, the us government was known to have poisoned certain cannabis farms, they also had poisoned alcohol before.  Drugs themselves are not inherently bad, chemists didnt design them to kill you/wreck your body.  Infact majority of recreational substances are quite safe, alcohol is far more damaging to the brain and organ tissue than weed, LSD, shrooms, heroin, etc.  That is probably hard to believe, but once you understand it as truth you will question, Why the HELL is alcohol/tobacco legal, when it is far more dangerous when it comes to annual deaths and just damaging your body.﻿", "time": "6 days ago", "author": "Intramental Studios"}
{"cid": "UgwWzFWjRmgviEH5CCp4AaABAg.8lYJ5mEXaTD8lZANfM9a7E", "text": "Do you mean punishment? Either way, poisoning and murdering people under any circumstances is barbaric and evil.﻿", "time": "6 days ago", "author": "pookiehoney"}
{"cid": "Ugxmjf6W597R3iayHW54AaABAg", "text": "\"I enjoyed lying to people and manipulating\" cops in a nutshell﻿", "time": "6 days ago", "author": "Pommy Pie"}
{"cid": "Ugxmjf6W597R3iayHW54AaABAg.8lYJ4G0AfSE8lYKVW_Al_6", "text": "Yeah this dude seems like an actual sociopath﻿", "time": "6 days ago", "author": "PHOBlIA"}
{"cid": "Ugxmjf6W597R3iayHW54AaABAg.8lYJ4G0AfSE8lYNY3xFx7s", "text": "Undercover cops in a nutshell* Regular cops are the ones being lied to in most of their interactions. \"Thats not mine\" , \"I've only had the one drink officer\" piss and shit seeps into the drivers seat and \"I've never seen that little boy\" but if that was true he must have raped him blindfolded. Cops are antagonised for doing their job,enforcing the law.Be mad at the people who made the bullshit drug laws rather than the people who would much rather put real scumbags behind bars and be able to keep them there without being released early because of overcrowding.﻿", "time": "6 days ago", "author": "Jack Duck"}
{"cid": "Ugxmjf6W597R3iayHW54AaABAg.8lYJ4G0AfSE8lYOg0V8t3s", "text": "@Jack Duck doing their job as in closing down their competitors. Look into Mike Rupperts testimony on LAPD drug running with the CIA﻿", "time": "6 days ago (edited)", "author": "Pommy Pie"}
{"cid": "Ugxmjf6W597R3iayHW54AaABAg.8lYJ4G0AfSE8lYPwlVTHBr", "text": "Makes me sick that their are humans like this guy.﻿", "time": "6 days ago", "author": "Errl Shmirl"}
{"cid": "Ugxmjf6W597R3iayHW54AaABAg.8lYJ4G0AfSE8lYSzMzAf-n", "text": "@Jack Duck cops are bastards because they enforce unjust laws and prevent us from seeking true justice. Cops have murdered all of our heroes.﻿", "time": "6 days ago", "author": "ThePunisher129"}
{"cid": "Ugxmjf6W597R3iayHW54AaABAg.8lYJ4G0AfSE8lYTbuI3w3S", "text": "Pommy Pie FACTS!﻿", "time": "6 days ago", "author": "Important"}
{"cid": "Ugxmjf6W597R3iayHW54AaABAg.8lYJ4G0AfSE8lYZ3jIZXgz", "text": "Not really. Most cops are far too stupid and/or aggressive to to navigate something like this.﻿", "time": "6 days ago", "author": "Gunk"}
{"cid": "Ugxmjf6W597R3iayHW54AaABAg.8lYJ4G0AfSE8lYj3liCX50", "text": "pig with a badge, nothing shocking here﻿", "time": "6 days ago", "author": "makemoneyrelax"}
{"cid": "Ugxmjf6W597R3iayHW54AaABAg.8lYJ4G0AfSE8lYpBFicuGM", "text": "Basically give evil a job.﻿", "time": "6 days ago", "author": "Medovukha"}
{"cid": "Ugxmjf6W597R3iayHW54AaABAg.8lYJ4G0AfSE8lZ15tLCrl4", "text": "i think a while ago some study was made and cops and criminals are essentially the same but work on opposite sides﻿", "time": "6 days ago", "author": "Johnmadara"}
{"cid": "Ugxmjf6W597R3iayHW54AaABAg.8lYJ4G0AfSE8lZ3QcXOIIH", "text": "They cut him off before he could finish his answer. This guy seems pretty genuine, especially after his suggestions to lawmakers at the end and harm reduction speak. I thought it was really cheap manipulative (ironic) editing on Vice's part.﻿", "time": "6 days ago", "author": "Kevin Gomez"}
{"cid": "Ugxmjf6W597R3iayHW54AaABAg.8lYJ4G0AfSE8lZUUiOXXR4", "text": "@ThePunisher129 all your heroes deserved to die if you worship shitbag criminals. Cops enforce the law to keep society running so people like me don't murder people like you.﻿", "time": "5 days ago", "author": "Democrats are cunts"}
{"cid": "Ugxmjf6W597R3iayHW54AaABAg.8lYJ4G0AfSE8l_UIvB5t-7", "text": "A few bad apples always spoil the bunch, for the IGNORANT anyway. Some people know better, sad most of you don't. That says a lot.﻿", "time": "5 days ago (edited)", "author": "I Brought The Horizon"}
{"cid": "Ugxmjf6W597R3iayHW54AaABAg.8lYJ4G0AfSE8laa-hUuCRy", "text": "ThePunisher129 you’re delusional﻿", "time": "5 days ago", "author": "John The Mighty"}
{"cid": "Ugxmjf6W597R3iayHW54AaABAg.8lYJ4G0AfSE8lcNpStv5xa", "text": "@Errl Shmirl makes my head hurt that a dumbfuck like you has only ignorance and no knowledge﻿", "time": "4 days ago", "author": "Val Dunn"}
{"cid": "Ugxmjf6W597R3iayHW54AaABAg.8lYJ4G0AfSE8lfAzvv2l49", "text": "It's a shame that your highlight of this video is a snapshot of his ego. You've missed the point.﻿", "time": "3 days ago", "author": "j3s0n"}
{"cid": "Ugxmjf6W597R3iayHW54AaABAg.8lYJ4G0AfSE8lhedbzjWi3", "text": "PHOBlIA  Lmao I take it you've never met a sociopath, or at least never noticed who was one? He stopped because he felt bad for the damage he was causing. Enjoying lying is more of a power thing than sociopathy.﻿", "time": "2 days ago", "author": "beast"}
{"cid": "UgzUbkmsBePxhiWprm94AaABAg", "text": "noice﻿", "time": "6 days ago", "author": "Bunnies&Kookies"}
{"cid": "UgwBPqXR18QPD45k3yV4AaABAg", "text": "stone of crack﻿", "time": "6 days ago", "author": "Dead as Dreams"}
{"cid": "Ugwr2nN0SrONnPh7tdt4AaABAg", "text": "Well said... Dope one...﻿", "time": "6 days ago", "author": "MALEMUSE"}
{"cid": "UgzgKO7RAe_bHGGhiG94AaABAg", "text": "this channel is deader than trayvon martin﻿", "time": "6 days ago", "author": "Luke Lewis"}
{"cid": "UgzgKO7RAe_bHGGhiG94AaABAg.8lYIrPrANeC8lYK05fPujv", "text": "Not really...﻿", "time": "6 days ago", "author": "C A"}
{"cid": "UgzgKO7RAe_bHGGhiG94AaABAg.8lYIrPrANeC8lYLooBvzAZ", "text": "How so?﻿", "time": "6 days ago", "author": "JostePoP"}
{"cid": "Ugwq6H34i4LN31kB19V4AaABAg", "text": "This is the exact same as the lad bible vid about this fella. But cooler. Cos it's vice﻿", "time": "6 days ago", "author": "needahaircut93"}
{"cid": "UgzY0IByporCwkqDtMV4AaABAg", "text": "This the guy from the True Geordie podcast??﻿", "time": "6 days ago", "author": "joshua chapman"}
{"cid": "UgzY0IByporCwkqDtMV4AaABAg.8lYImCj0INl8lYKQo2cRcf", "text": "Yep, same guy. Very interesting story tbh.﻿", "time": "6 days ago", "author": "Dean Jarrett"}
{"cid": "UgypuZkdvOCBYT8FxdF4AaABAg", "text": "I agree with him. All drugs should be legal and regulated safely. People are going to do drugs regardless. Prohibition has never once worked ever. Might as well make sure the drugs they are getting are safe and easily accessible so we don't have people dying in the streets everywhere from fentanyl overdoses and committing crimes just to get their next fix. Jailing people also does nothing to prevent them from either doing drugs or committing crimes because they can still do drugs in jail and when they get out they will almost always be a repeat offender. Prison does not rehabilitate people. It turns them into life long criminals because they get out and can't get a job because of their criminal record.﻿", "time": "6 days ago (edited)", "author": "Rem"}
{"cid": "UgypuZkdvOCBYT8FxdF4AaABAg.8lYIlP_fs1w8lYKAY9GXzM", "text": "chuck me some bag then﻿", "time": "6 days ago", "author": "Jimbo Chang"}
{"cid": "UgypuZkdvOCBYT8FxdF4AaABAg.8lYIlP_fs1w8lYKSXush2B", "text": "Canada is slowly getting there, we just need more time.﻿", "time": "6 days ago", "author": "Garrett"}
{"cid": "UgypuZkdvOCBYT8FxdF4AaABAg.8lYIlP_fs1w8lYKxxD7FAD", "text": "Rem So you want everyone to be a low life drug addict and not provide anything to socitiey?﻿", "time": "6 days ago", "author": "R I P K e r m i t"}
{"cid": "UgypuZkdvOCBYT8FxdF4AaABAg.8lYIlP_fs1w8lYLHMDO-sn", "text": "@R I P K e r m i t, I understand and get where you are coming from, but the majority of these people are mentally ill. They are already a strain of society. You can lift that by providing professional help in a regulated market without violence or shady dealing.﻿", "time": "6 days ago", "author": "Garrett"}
{"cid": "UgypuZkdvOCBYT8FxdF4AaABAg.8lYIlP_fs1w8lYMrvDfOw2", "text": "What makes you so special? Unlike you, \"everyone\" is either a druggy or a potential druggy if given the chance?﻿", "time": "6 days ago", "author": "sam mayne"}
{"cid": "UgypuZkdvOCBYT8FxdF4AaABAg.8lYIlP_fs1w8lYP2U25Xu5", "text": "R I P K e r m i t you are looking at the world in black and white, which it isn't.﻿", "time": "6 days ago", "author": "Black Sun Sirius 777"}
{"cid": "UgypuZkdvOCBYT8FxdF4AaABAg.8lYIlP_fs1w8lYQ0eKKus5", "text": "Great idea. Lets give the government even more authority. They won't abuse it right?﻿", "time": "6 days ago", "author": "Errl Shmirl"}
{"cid": "UgypuZkdvOCBYT8FxdF4AaABAg.8lYIlP_fs1w8lYS9nVBD5T", "text": "At least then, money can be used for rehabilitation instead of locking people up (which does nothing good).﻿", "time": "6 days ago", "author": "Eusunt Dac"}
{"cid": "UgypuZkdvOCBYT8FxdF4AaABAg.8lYIlP_fs1w8lYTt_fxa77", "text": "@R I P K e r m i t Trolling? If not you are among the 5% of narrow minded people living in 1950's still.﻿", "time": "6 days ago", "author": "payday heist"}
{"cid": "UgypuZkdvOCBYT8FxdF4AaABAg.8lYIlP_fs1w8lYXTtAm9yE", "text": "You right bruh.. Walmart and neighbor hood supermarket are not kidnapping each others coworkers and setting them on fire.  Or shooting managers .. or getting cart pushers locked up to take there carts.. oh don't forget turning eatchothers moms and sisters out on product..﻿", "time": "6 days ago", "author": "yoza L"}
{"cid": "UgypuZkdvOCBYT8FxdF4AaABAg.8lYIlP_fs1w8lYhichhhlM", "text": "Criminals will find something else to make a profit, they don´t care about laws, they want to profit.﻿", "time": "6 days ago", "author": "Rafael Pinto"}
{"cid": "UgypuZkdvOCBYT8FxdF4AaABAg.8lYIlP_fs1w8lYkqFB2s_L", "text": "R I P K e r m i t no the opposite.﻿", "time": "6 days ago", "author": "jonnybaze"}
{"cid": "UgypuZkdvOCBYT8FxdF4AaABAg.8lYIlP_fs1w8lYrWF7yM9N", "text": "Good in theory but so many  users are very bad planners - their lives are often chaotic. Regulation would require registration to obtain drugs. Because of this, there may still be a gap in the market for  then \"illegal\" suppliers to exploit the users who need an instant fix. Not sure of a way around this aspect of the problem.﻿", "time": "6 days ago", "author": "david goresh"}
{"cid": "UgypuZkdvOCBYT8FxdF4AaABAg.8lYIlP_fs1w8lYscj65PoF", "text": "Same just cause heroin is legal dosnt mean you are going to be forced to do it﻿", "time": "6 days ago", "author": "Boricua Ish"}
{"cid": "UgypuZkdvOCBYT8FxdF4AaABAg.8lYIlP_fs1w8lYtYFWKJ1v", "text": "david goresh what? You don't know how to get around it? Why the fuck would it be a requirement to register??? Don't require it. And if for some unknown reason people did have to register, would than really be a hard thing to do? Addicts make it to the doctors for opiate withdrawal medication. So signing a paper would be harder? I don't think you thought that through.﻿", "time": "6 days ago", "author": "jonnybaze"}
{"cid": "UgypuZkdvOCBYT8FxdF4AaABAg.8lYIlP_fs1w8lYwzEZN8H9", "text": "But still it would be all over the streets.﻿", "time": "6 days ago", "author": "NytOnPeliAika"}
{"cid": "UgypuZkdvOCBYT8FxdF4AaABAg.8lYIlP_fs1w8lZ2uQWjTBb", "text": "NytOnPeliAika it is all over the streets. Now think of the trillions spent to \"eliminate\" drugs..... with all that money plus the money saved from private and public prisons, omg that's so much money that can be used better. So drugs all over the street that costs trillions vs same thing for free, I'll take free.﻿", "time": "6 days ago", "author": "jonnybaze"}
{"cid": "UgypuZkdvOCBYT8FxdF4AaABAg.8lYIlP_fs1w8lZ3GOxJzYd", "text": "Absolutely agreed.  It seems counter-intuitive, but it reduces drug abuse, drug deaths, and tax payer expense.  \nIt would also remove the primary revenue stream from drug cartels who are terrorizing South America.  We could even use it to generate tax revenue, like the marijuana industry has done in many states, providing millions of dollars.  \nPerhaps rather than total legalization, decriminalization might be a better step, but that discussion can't even be had from the position we currently sit - locking people in jail, costing tax payers millions, while letting them die injecting unregulated fentanyl laced drugs, and giving the cartels all the money they need to dominate a continent.﻿", "time": "6 days ago", "author": "Danielle Spargo"}
{"cid": "UgypuZkdvOCBYT8FxdF4AaABAg.8lYIlP_fs1w8lZ4Zp_uw9n", "text": "Adam Cantrell\nPortugal has already implemented something similar, and it significantly reduced drug use.  Treatment is not only cheaper to the tax payer than prison, but it's also far more effective at reducing usage.  We've already seen in America that the clean needle programs significantly reduced the spread of hepatitis and HIV, though unfortunately the programs haven't been adopted throughout the country.  \n\nI understand that it's counter-intuitive, but it really does work.  It really does reduce drug usage.  We have already seen how effective it is when implemented in the actual real world.  I understand why you are hesitent, but your fears are unfounded, and based on a false premise.  Our streets are already flooded with drugs, and they're dirty and impure, killing users who think they're buying something else.  We need to change the system, because that horrible \"black\" situation you described already exists within the current paradigm, so clearly it's not effective.﻿", "time": "6 days ago", "author": "Danielle Spargo"}
{"cid": "UgypuZkdvOCBYT8FxdF4AaABAg.8lYIlP_fs1w8lZ99OcdR0B", "text": "R I P K e r m i t just because it's legal doesn't mean more people are going to do it.﻿", "time": "6 days ago", "author": "Mike Jones"}
{"cid": "UgypuZkdvOCBYT8FxdF4AaABAg.8lYIlP_fs1w8lZALzDoHyK", "text": "It's not a war on drugs, it's a war on personal freedom.﻿", "time": "6 days ago", "author": "Vladimir Makarov"}
{"cid": "UgypuZkdvOCBYT8FxdF4AaABAg.8lYIlP_fs1w8lZM5SoiY7C", "text": "@R I P K e r m i t, I understand you feel this way, yet the evidence doesn't support this. Google can amaze you, yet I have known about this for 15 years. I guess you would say the same to Joe Rogan, or Joey Diaz. 750,000 a podcast, runs hills, works out daily, Full time comedian, 3 hit tv shows, Avid hunter, etc etc etc, and disproved.﻿", "time": "6 days ago", "author": "Thomas Sawyer"}
{"cid": "UgypuZkdvOCBYT8FxdF4AaABAg.8lYIlP_fs1w8lZUEdiIX9u", "text": "No they shouldn't. That promotes drug addiction as if it is normal and individuals who are susceptible will become non functioning welfare addicts.﻿", "time": "5 days ago", "author": "Democrats are cunts"}
{"cid": "UgypuZkdvOCBYT8FxdF4AaABAg.8lYIlP_fs1w8l_J126H1Y3", "text": "@jonnybaze i just got ooffed pretty well but \"regulated safely\" mostly means that the drugs would be available for those who need them badly.﻿", "time": "5 days ago", "author": "NytOnPeliAika"}
{"cid": "UgypuZkdvOCBYT8FxdF4AaABAg.8lYIlP_fs1w8l_Usn2Pz94", "text": "@Garrett its like 30 bucks for a can of dip in canada... where are you going?﻿", "time": "5 days ago", "author": "Christopher Brown"}
{"cid": "UgypuZkdvOCBYT8FxdF4AaABAg.8lYIlP_fs1w8l_WjHom5NS", "text": "@Christopher Brown, dip huh? I doubt many Canadians care about chewing tobacco. Plus the guys who chew on my oil rig make enough to afford dip and still afford their shitty Ram 3500 that's lifted.﻿", "time": "5 days ago", "author": "Garrett"}
{"cid": "UgypuZkdvOCBYT8FxdF4AaABAg.8lYIlP_fs1w8l_XKF4gZ84", "text": "@Garrett All im saying is if tobacco is that expensive. I couldn't imagine harder drugs price range.﻿", "time": "5 days ago", "author": "Christopher Brown"}
{"cid": "UgypuZkdvOCBYT8FxdF4AaABAg.8lYIlP_fs1w8l_iul46JPK", "text": "Democrats are cunts no there is no evidence to support that. There is evidence to the contrary. It promotes not locking people up for hurting themselves. With the trillions saved education could be at an extreme high. Lowering the number of susceptible people and greatly increase treatment/treatment options. If you're anti democrat wouldn't you be for smaller government/ reduced power?﻿", "time": "5 days ago", "author": "jonnybaze"}
{"cid": "UgypuZkdvOCBYT8FxdF4AaABAg.8lYIlP_fs1w8l_jEydZq6Z", "text": "Christopher Brown people buy it??? I think $4 is expensive﻿", "time": "5 days ago", "author": "jonnybaze"}
{"cid": "UgypuZkdvOCBYT8FxdF4AaABAg.8lYIlP_fs1w8l_pF5IkbJf", "text": "jonnybaze your two stuck on talking points of repubs, same as dems. So Glad tge paradimn is going away. 2 parties = 1. That's why so many people don't vote anymore what's the point? Did we just get another corrupt politician in office?﻿", "time": "5 days ago", "author": "Thomas Sawyer"}
{"cid": "UgypuZkdvOCBYT8FxdF4AaABAg.8lYIlP_fs1w8l_qLnvbGbK", "text": "Thomas Sawyer these are my talking points and opinions based on any evidence ik. Is anything I said untrue? We don't have a 2 party system . We have many. Thousands of people run for president. People that don't vote or exclusively vote dem or rep are just stupid.﻿", "time": "5 days ago", "author": "jonnybaze"}
{"cid": "UgypuZkdvOCBYT8FxdF4AaABAg.8lYIlP_fs1w8l_qZgjzyWg", "text": "@Christopher Brown, weed in BC is cheap. The working class can afford weed and who says these regulated hard drugs would cost the addict anything? We have universal health care and if you want to help the poor and mentality ill get over their issues you wouldn't charge them outrageous prices for lab heroin. I don't know what chewing tobacco which is a non-issue in Canada is even brought up in a  drug debate.  Tobacco is irrelevant to hard street drug addiction and dealing.﻿", "time": "5 days ago", "author": "Garrett"}
{"cid": "UgypuZkdvOCBYT8FxdF4AaABAg.8lYIlP_fs1w8l_rUHCnhD7", "text": "@Errl Shmirl Hasnt gone bad with alcohol. Unless you count the arbitrary age requirement and short sighted prohibition.﻿", "time": "5 days ago", "author": "Alonzo Salvary"}
{"cid": "UgypuZkdvOCBYT8FxdF4AaABAg.8lYIlP_fs1w8l_rkL8vyjR", "text": "@Rafael Pinto Wouldn't you agree that having less avenues for income, on some level, cripples their operations?﻿", "time": "5 days ago", "author": "Alonzo Salvary"}
{"cid": "UgypuZkdvOCBYT8FxdF4AaABAg.8lYIlP_fs1w8l_vkUqFgIN", "text": "@Garrett well it becomes relevant when you're talking about the reason why tobacco is priced so high. Canada sees it as a health hazard ( its completely right) so they tax the hell out of it in order to care for those kinds of patients in the long run. While yes the hard streed drugs could help and they do in prescribed lab medicine they do come with significat risks aswell. Im not exactly sure how canadian health care works but what I do know is the more risky the drug is the more expensive it'll be. Even if its in the form of taxes.﻿", "time": "5 days ago", "author": "Christopher Brown"}
{"cid": "UgypuZkdvOCBYT8FxdF4AaABAg.8lYIlP_fs1w8la-QWDpS_K", "text": "Alonzo Salvary the alcohol and tobacco industry coupled with government entities has been the tip of the pyramid for the war on drugs. Governments only take, they do not give﻿", "time": "5 days ago", "author": "Errl Shmirl"}
{"cid": "UgypuZkdvOCBYT8FxdF4AaABAg.8lYIlP_fs1w8la5_zzlvF9", "text": "@Christopher Brown I agree, and we both know a lot of ideas sound good on paper but in reality and due to human nature they fail. I just hope we at least try it and see if we can work the bugs out rather than just fight it with \"The War on Drugs\", which obviously doesn't work.﻿", "time": "5 days ago", "author": "Garrett"}
{"cid": "UgypuZkdvOCBYT8FxdF4AaABAg.8lYIlP_fs1w8la9GqMSoq9", "text": "netherlands and uruguay contradicts you.     I am all in favor , but i know for facts it doesn´t work,  in my city when police for a few years made it harder for drugs, the criminals raised so much the kidnaps and the robberies with assault rifles.﻿", "time": "5 days ago", "author": "Rafael Pinto"}
{"cid": "UgypuZkdvOCBYT8FxdF4AaABAg.8lYIlP_fs1w8laIIgXj1F9", "text": "Jonny - take a look at those countries which are starting to relax the law on drugs. Think about the consequences of a non-registration system. Think about the lives of many drug users/cusp abusers. Think also about the \"moral majority\" who are far distanced from those live a \"hand-to-mouth\" existence. Think also about the attitudes of  the haters who begrudge any kind of welfare funding, not realising that this is also their problem, but naively believe that they can sort out a society's ills with a handgun. Yes I did think it through. You will also notice that I have avoided a riposte in  the arrogant tone of your poorly worded and typed comment. Are you speaking from experience?﻿", "time": "5 days ago", "author": "david goresh"}
{"cid": "UgypuZkdvOCBYT8FxdF4AaABAg.8lYIlP_fs1w8lb6GA9U1tO", "text": "@ RIPkermit the world must look very small with those big blinkers on﻿", "time": "4 days ago (edited)", "author": "hsoj hsquh"}
{"cid": "UgypuZkdvOCBYT8FxdF4AaABAg.8lYIlP_fs1w8lbEihSujcy", "text": "R I P K e r m i t you’re clearly not very educated﻿", "time": "4 days ago", "author": "Michael Post"}
{"cid": "UgypuZkdvOCBYT8FxdF4AaABAg.8lYIlP_fs1w8lk74wxjdcE", "text": "Rem, your one of the few that get it, I just wonder if it'll ever change ya know? we're going to be going on 50 years of this.﻿", "time": "1 day ago", "author": "Twin Cities Billy"}
{"cid": "UgypuZkdvOCBYT8FxdF4AaABAg.8lYIlP_fs1w8llsh41mrCx", "text": "R I P K e r m i t no, we offer education and facts about drug safety and make people more knowledgeable about the effects of drugs and aware of the consequences. this serves as an incentive to use them with moderation and care.﻿", "time": "18 hours ago", "author": "Viper"}
{"cid": "Ugx4BWugAf80I-BoF2t4AaABAg", "text": "ACAB﻿", "time": "6 days ago", "author": "Bobby B"}
{"cid": "Ugx4BWugAf80I-BoF2t4AaABAg.8lYIi9AXZBd8lYUHM89p9t", "text": "1.3.1.2﻿", "time": "6 days ago", "author": "ThePunisher129"}
{"cid": "UgwwMgnxBpn8g4KE7Yp4AaABAg", "text": "Could have just titled it \"an interview with a psychopath\"﻿", "time": "6 days ago", "author": "benjamin sheard"}
{"cid": "UgwwMgnxBpn8g4KE7Yp4AaABAg.8lYIcN4hoXQ8lYOhOmNnmy", "text": "benjamin sheard what why?﻿", "time": "6 days ago", "author": "Shoguner"}
{"cid": "UgwwMgnxBpn8g4KE7Yp4AaABAg.8lYIcN4hoXQ8lYQ-9pJgdK", "text": "Shoguner he relishes the mental games his job put him in. I wouldnt be surprised if he is twice divorced and presently making life a living hell for his newest partner﻿", "time": "6 days ago", "author": "benjamin sheard"}
{"cid": "UgwwMgnxBpn8g4KE7Yp4AaABAg.8lYIcN4hoXQ8lYSC4gtYmi", "text": "I agree dude's fucked up to prey upon the weak using empathy to become \"friends\" with them then turning them in﻿", "time": "6 days ago", "author": "Nathaniel the Animal"}
{"cid": "UgwwMgnxBpn8g4KE7Yp4AaABAg.8lYIcN4hoXQ8lYTI_ICF__", "text": "A.c.a.b.﻿", "time": "6 days ago", "author": "ThePunisher129"}
{"cid": "UgwwMgnxBpn8g4KE7Yp4AaABAg.8lYIcN4hoXQ8lYZcUZB6qY", "text": "If he doesn't do it, someone else will.﻿", "time": "6 days ago", "author": "The Mellon Dollar Man"}
{"cid": "UgwwMgnxBpn8g4KE7Yp4AaABAg.8lYIcN4hoXQ8lYnxew_DYw", "text": "Sociopath﻿", "time": "6 days ago", "author": "Tommy Clout"}
{"cid": "UgwwMgnxBpn8g4KE7Yp4AaABAg.8lYIcN4hoXQ8lZ4Fh5s9m8", "text": "He is showing remorse and guilt for his actions. A psychopath would be proud of it.﻿", "time": "6 days ago", "author": "All4Grogg"}
{"cid": "UgwwMgnxBpn8g4KE7Yp4AaABAg.8lYIcN4hoXQ8l_NEqz-5eJ", "text": "benjamin sheard I'm not sure you understand what a psychopath is.﻿", "time": "5 days ago", "author": "शक्तिमान"}
{"cid": "Ugw13ZDqGRmTQMqIwxl4AaABAg", "text": "white cuckold﻿", "time": "6 days ago", "author": "hi"}
{"cid": "UgwhO_zgNBcwfQTNowx4AaABAg", "text": "Damn this job sounds fun getting to make a new identity but so dangerous.﻿", "time": "6 days ago", "author": "Conor Mcgregor"}
{"cid": "Ugy8-Y1p1TWqdTWcTvp4AaABAg", "text": "Interesting﻿", "time": "6 days ago", "author": "Aidan"}
{"cid": "Ugw4PP16_JQJg5d9-cB4AaABAg", "text": "this is so interesting.﻿", "time": "6 days ago", "author": "Radiant"}
{"cid": "Ugy8ed9NKqdzOpmZy7R4AaABAg", "text": "Wow very open and honest guy especially how he preyed upon the weak like that﻿", "time": "6 days ago", "author": "R3l3ntl3ss"}
{"cid": "Ugy8ed9NKqdzOpmZy7R4AaABAg.8lYI6YtV5sM8lYLRvTwqOU", "text": "Technically, he preyed on the weak, to get access to the people hidden in the back, that were preying on a lot more weak people in a lot worse ways. \nTrying to get the people who are behind it, is not really \"preying on the weak\". He used them to do what he thought was for the better of everyone. They did it because it was better for themselves. There's enough to dislike about cops, but calling them more selfish than the drug-dealers that prey on people each day is a bit far away from reality.﻿", "time": "6 days ago", "author": "liquidminds"}
{"cid": "Ugy8ed9NKqdzOpmZy7R4AaABAg.8lYI6YtV5sM8lYMkg04iWC", "text": "@liquidminds Very well said﻿", "time": "6 days ago", "author": "Bad Man"}
{"cid": "Ugy8ed9NKqdzOpmZy7R4AaABAg.8lYI6YtV5sM8lYNpkQcjw2", "text": "@liquidminds I've seen the devastation left behind after undercover police ops. Low level no bodies literally getting their lives ruined because they \"helped out\" an undercover pig.\n\nListen to the latter half of this video - the cop even admits that all his work was fruitless. The war on drugs as it stands is not fit for purpose and it continually punishes the weak and vulnerable. The changes he proposes at the end are the same echoed by drug treatment services across the globe.\n\nDon't kid yourself about the current war on drugs\" model. Top dogs remain untouched.﻿", "time": "6 days ago", "author": "Rin Tin"}
{"cid": "Ugy8ed9NKqdzOpmZy7R4AaABAg.8lYI6YtV5sM8lYOk71H5tG", "text": "@Rin Tin dont get into it then﻿", "time": "6 days ago", "author": "yaowadeez snm"}
{"cid": "Ugy8ed9NKqdzOpmZy7R4AaABAg.8lYI6YtV5sM8lYP_pjbyl7", "text": "@yaowadeez snm One of the most ignorant comments I've read in while. Congrats.﻿", "time": "6 days ago", "author": "Rin Tin"}
{"cid": "Ugy8ed9NKqdzOpmZy7R4AaABAg.8lYI6YtV5sM8lYQ7_kELmM", "text": "+Rin Tin You can criticise their methods, without criticising their intentions. When people claim that the police is evil because they want to be evil, when in fact they want to do good but happen to cause bad things, any further discussion is pointless. when people cannot distinguish between intentions and actions, no rational conversation is possible.﻿", "time": "6 days ago", "author": "liquidminds"}
{"cid": "Ugy8ed9NKqdzOpmZy7R4AaABAg.8lYI6YtV5sM8lYRv2G1lFq", "text": "@liquidminds I've worked in drug rehab and aftercare services for close to a couple of decades now. I've been involved in a number of initiatives involving local police forces. Unfortunately there is a large amount of police at ALL levels who don't care about the destruction they cause, or ultimately who they arrest. As long as their ultimate arrest records appear high it's \"job well done\".\n\nNot to say they're all like that. Far from it. Ironically the ones really wanting to make a change, frequently end up leaving the police and working somewhere in the treatment, rehab and/or aftercare sector.﻿", "time": "6 days ago", "author": "Rin Tin"}
{"cid": "Ugy8ed9NKqdzOpmZy7R4AaABAg.8lYI6YtV5sM8lYVjHjYXOu", "text": "@liquidminds The methods of the police can be so cruel and destructive that you must question their intentions as well. Police should not be placed on a pedestal and we shouldn't act as if they can do no wrong. Rather, they should be held to the highest standard of scrutiny because they hold all of our lives in their hands.﻿", "time": "6 days ago", "author": "下佐粉ケイ"}
{"cid": "Ugy8ed9NKqdzOpmZy7R4AaABAg.8lYI6YtV5sM8lYcyhbYFBA", "text": "@下佐粉ケイ exactly!﻿", "time": "6 days ago", "author": "R3l3ntl3ss"}
{"cid": "Ugy8ed9NKqdzOpmZy7R4AaABAg.8lYI6YtV5sM8lZTWXdQn7p", "text": "Who gives a shit. They are weak by choice.﻿", "time": "5 days ago", "author": "Democrats are cunts"}
{"cid": "Ugy8ed9NKqdzOpmZy7R4AaABAg.8lYI6YtV5sM8l_52HkfWZ4", "text": "@Rin Tin \nIt's not their job to care, that's your job. Their job is to disrupt people from high risk situations.\n\nThis video and many of the subthreads smack of people who want perfect solutions. Fewer dead people is an adequate start.﻿", "time": "5 days ago", "author": "SaintNobody"}
{"cid": "Ugy8ed9NKqdzOpmZy7R4AaABAg.8lYI6YtV5sM8l_8zcimG4h", "text": "M﻿", "time": "5 days ago", "author": "Andrew Johnson"}
{"cid": "Ugy8ed9NKqdzOpmZy7R4AaABAg.8lYI6YtV5sM8l_MPVKLLHr", "text": "Rin Tin The most obvious answer is the most \"ignorant\" eh? Such childish horseshit.﻿", "time": "5 days ago", "author": "शक्तिमान"}
{"cid": "Ugy8ed9NKqdzOpmZy7R4AaABAg.8lYI6YtV5sM8l_R9O2APyD", "text": "I'm saying﻿", "time": "5 days ago", "author": "saint 187ebk"}
{"cid": "Ugy8ed9NKqdzOpmZy7R4AaABAg.8lYI6YtV5sM8lmoMu1QWCw", "text": "R3l3ntl3ss to get the to the top people that’s what you have to unfortunately. But I agree with him that all drugs should he regulated. Or at least have supervised injection sites like Europe has﻿", "time": "9 hours ago", "author": "nickgavis0305"}
{"cid": "UgwIv1aibrNP_jVy-ah4AaABAg", "text": "omg😱 9 million subscribers I hope one day I gonna have 9million subscribers but I never gonna get😕😔﻿", "time": "6 days ago", "author": "Prank LOL"}
{"cid": "UgwIv1aibrNP_jVy-ah4AaABAg.8lYI2ybuveT8lZXN51iCEB", "text": "No, you won't.﻿", "time": "5 days ago", "author": "Democrats are cunts"}
{"cid": "UgwSr95zrGPDxYQX31F4AaABAg", "text": "Yall posted this before﻿", "time": "6 days ago", "author": "Goku San"}
{"cid": "UgxE-QGT1hHnAgK01YB4AaABAg", "text": "Please sir add subtitles﻿", "time": "6 days ago", "author": "Aakash Godara"}
{"cid": "UgyZAGT4Ws0pu0MDuDt4AaABAg", "text": "I can go under-covers \n\nOnee-Chan..﻿", "time": "6 days ago", "author": "Meme Tube"}
{"cid": "UgyZAGT4Ws0pu0MDuDt4AaABAg.8lYHrKfzOVu8lYjpSvNaWZ", "text": "Your mission is to destroy the fake weaboos. You see one Naruto artifact you destroy it.﻿", "time": "6 days ago", "author": "Vib"}
{"cid": "UgyZAGT4Ws0pu0MDuDt4AaABAg.8lYHrKfzOVu8lYkMU73rFY", "text": "Bate em with poki and ramune and be friend em for a few months and well see where it goes﻿", "time": "6 days ago", "author": "Nick McCack"}
{"cid": "UgyZAGT4Ws0pu0MDuDt4AaABAg.8lYHrKfzOVu8l_MuxvO7Qv", "text": "Meme Tube Hang yourself irl﻿", "time": "5 days ago", "author": "शक्तिमान"}
{"cid": "UgzF5XhOyGI7j7uHEuF4AaABAg", "text": "VICE, employ me.﻿", "time": "6 days ago", "author": "Omni Enki"}
{"cid": "UgzF5XhOyGI7j7uHEuF4AaABAg.8lYHplKh4-h8lYly_Q9Scm", "text": "Sure do you have references,media experience, can you apply online?﻿", "time": "6 days ago", "author": "Bobbito Chicon"}
{"cid": "UgzF5XhOyGI7j7uHEuF4AaABAg.8lYHplKh4-h8l_N-svSyQA", "text": "They'll employ anybody﻿", "time": "5 days ago", "author": "शक्तिमान"}
{"cid": "UgzF5XhOyGI7j7uHEuF4AaABAg.8lYHplKh4-h8l_QNbZ2wfS", "text": "No one who would remotely consider hiring you is reading comments.﻿", "time": "5 days ago", "author": "Tyler Niemon"}
{"cid": "UgzF5XhOyGI7j7uHEuF4AaABAg.8lYHplKh4-h8laPrPdfg8R", "text": "Are you of colour? Do you hate white men? Do you have more than 10 genders? \n\nYOU'RE HIRED﻿", "time": "5 days ago", "author": "Reg Gia"}
{"cid": "UgzF5XhOyGI7j7uHEuF4AaABAg.8lYHplKh4-h8ljvpUEhEkH", "text": "Just dress like a hipster, and say a few SJW hashtags... the new brooklyn office of dimwits will apparently hire anyone that fits that mold﻿", "time": "1 day ago", "author": "derty QWERTY"}
{"cid": "Ugzb5s4jv1CzTQcgL2l4AaABAg", "text": "Must watch An Insignificant man by vice on YouTube on kejriwal ji PM of India 2019﻿", "time": "6 days ago", "author": "A K"}
{"cid": "Ugzb5s4jv1CzTQcgL2l4AaABAg.8lYHoIu3ewy8lYJ4frqoCY", "text": "A K what﻿", "time": "6 days ago", "author": "Enzo Cittadino"}
{"cid": "Ugzb5s4jv1CzTQcgL2l4AaABAg.8lYHoIu3ewy8lYJE3phprs", "text": "A K he went to insignificant man to an idiot.﻿", "time": "6 days ago", "author": "Somesh C.R."}
{"cid": "Ugzb5s4jv1CzTQcgL2l4AaABAg.8lYHoIu3ewy8lYJKFwafpW", "text": "@Somesh C.R. chal be feku kutte﻿", "time": "6 days ago", "author": "A K"}
{"cid": "Ugzb5s4jv1CzTQcgL2l4AaABAg.8lYHoIu3ewy8lYJNSVr_kJ", "text": "@Enzo Cittadino Enzo can u read english ,I said watch An Insignificant man movie on YouTube by vice﻿", "time": "6 days ago", "author": "A K"}
{"cid": "Ugzb5s4jv1CzTQcgL2l4AaABAg.8lYHoIu3ewy8lYJmxr2nFV", "text": "Be gentle, people. It's trying to communicate﻿", "time": "6 days ago", "author": "Pedro Rodrigues"}
{"cid": "Ugzb5s4jv1CzTQcgL2l4AaABAg.8lYHoIu3ewy8lYK2MZ6ckf", "text": "@Pedro Rodrigues yes plz watch An Insignificant man movie on YouTube by vice﻿", "time": "6 days ago", "author": "A K"}
{"cid": "Ugzb5s4jv1CzTQcgL2l4AaABAg.8lYHoIu3ewy8lYKft4mRt-", "text": "A K I can, that’s why your comment was so confusing﻿", "time": "6 days ago", "author": "Enzo Cittadino"}
{"cid": "UgwyjLcC-lBDvyQ2vJB4AaABAg", "text": "Who watched\"\"\" An Insignificant man\"\"\"\" film by VICE on YouTube????????﻿", "time": "6 days ago", "author": "A K"}
{"cid": "UgwrORvFLFP3NwIqJyV4AaABAg", "text": "Drug addictz﻿", "time": "6 days ago", "author": "Aurvin"}
{"cid": "UgzlyTniAccOaz1FToF4AaABAg", "text": "Vice is gay﻿", "time": "6 days ago", "author": "Terrarium America"}
{"cid": "UgzlyTniAccOaz1FToF4AaABAg.8lYHiBE-bvk8lYS0fKwMD5", "text": "Terrarium America so you have something in common then﻿", "time": "6 days ago (edited)", "author": "Der Berliner"}
{"cid": "UgzlyTniAccOaz1FToF4AaABAg.8lYHiBE-bvk8lYUBx2BC2n", "text": "So am i 🔻﻿", "time": "6 days ago", "author": "ThePunisher129"}
{"cid": "UgylpMNKl2uHYuo3L2x4AaABAg", "text": "Finally something good again vice﻿", "time": "6 days ago", "author": "Superhuman Fitness"}
{"cid": "UgylpMNKl2uHYuo3L2x4AaABAg.8lYHem6OcNt8lYQ4K3GTiX", "text": "U don't enjoy the white racist guilt content?﻿", "time": "6 days ago", "author": "Errl Shmirl"}
{"cid": "UgylpMNKl2uHYuo3L2x4AaABAg.8lYHem6OcNt8lYQoKM1Mwq", "text": "Errl Shmirl\nwhat ?﻿", "time": "6 days ago", "author": "Ahmed Tarek"}
{"cid": "UgylpMNKl2uHYuo3L2x4AaABAg.8lYHem6OcNt8lYStjQl4su", "text": "because this is a reupload with a different title and different editing﻿", "time": "6 days ago", "author": "Apple Prince"}
{"cid": "UgylpMNKl2uHYuo3L2x4AaABAg.8lYHem6OcNt8lYpAF_BFvE", "text": "This shit's a reupload retardoad﻿", "time": "6 days ago", "author": "HgihAsFcuk"}
{"cid": "UgylpMNKl2uHYuo3L2x4AaABAg.8lYHem6OcNt8lZV602dQ9J", "text": "@Errl Shmirl this is race derived guilt. Why should is the law racist when everyone has to follow it? Because the colored folks can't get their shit together.﻿", "time": "5 days ago", "author": "Democrats are cunts"}
{"cid": "UgwkgteqA8SgN96Y5v54AaABAg", "text": "$#$#el $#er sb nike23 805 $##$ usa governer﻿", "time": "6 days ago", "author": "Edgar Cardenas"}
{"cid": "UgwkgteqA8SgN96Y5v54AaABAg.8lYHc0of9xA8lZXRHpeCPF", "text": "Shut up.﻿", "time": "5 days ago", "author": "Democrats are cunts"}
{"cid": "UgxbsMqCsDbWtNqc4hR4AaABAg", "text": "Interesting indeed.﻿", "time": "6 days ago", "author": "T.BONE/SIDE OF LIFE"}
{"cid": "UgwmlmW_DBdV6zqMSAt4AaABAg", "text": "Dangerous job, but if you make it out, you will have some incredible stories that you can never tell.﻿", "time": "6 days ago", "author": "Michael Jay - Value Investing"}
{"cid": "UgwmlmW_DBdV6zqMSAt4AaABAg.8lYHaI5Y7rZ8lYOGHwa5Uj", "text": "stories - what a payoff﻿", "time": "6 days ago", "author": "betabenja"}
{"cid": "UgwmlmW_DBdV6zqMSAt4AaABAg.8lYHaI5Y7rZ8lYPp293LGB", "text": "Disgusting stories. Gain trust and then arrest and destroy lives.﻿", "time": "6 days ago", "author": "Errl Shmirl"}
{"cid": "UgwmlmW_DBdV6zqMSAt4AaABAg.8lYHaI5Y7rZ8lYSrDLsttW", "text": "A.c.a.b.﻿", "time": "6 days ago", "author": "ThePunisher129"}
{"cid": "UgwmlmW_DBdV6zqMSAt4AaABAg.8lYHaI5Y7rZ8lYTZTpZa3P", "text": "Michael Jay - Value Investing in the uk it’s not that glamorous with the undercover they always just nick a crack head and ask them to help u buy some shit off them then they nick them﻿", "time": "6 days ago", "author": "Chop Em"}
{"cid": "UgwmlmW_DBdV6zqMSAt4AaABAg.8lYHaI5Y7rZ8lYg7aU80za", "text": "But this story isn't about his job, it's about the drug policy.﻿", "time": "6 days ago", "author": "Marinus"}
{"cid": "UgwmlmW_DBdV6zqMSAt4AaABAg.8lYHaI5Y7rZ8lYkfoGgvjZ", "text": "BRAINWASHED Dumbshit﻿", "time": "6 days ago", "author": "KGBz"}
{"cid": "UgwmlmW_DBdV6zqMSAt4AaABAg.8lYHaI5Y7rZ8lYpa4tzbR3", "text": "Even when you're out, you aren't REALLY out....silence equals survival.﻿", "time": "6 days ago", "author": "MafiaboysWorld"}
{"cid": "UgwmlmW_DBdV6zqMSAt4AaABAg.8lYHaI5Y7rZ8lZU53m7Bhw", "text": "Well I mean, he just told his story.﻿", "time": "5 days ago", "author": "Matthew Stauffer"}
{"cid": "UgwmlmW_DBdV6zqMSAt4AaABAg.8lYHaI5Y7rZ8lZg3ocBnpl", "text": "Errl Shmirl- You were obviously caught by one of them. Good going!﻿", "time": "5 days ago", "author": "Throngdorr Mighty"}
{"cid": "UgwmlmW_DBdV6zqMSAt4AaABAg.8lYHaI5Y7rZ8lZle87MTSj", "text": "He just did﻿", "time": "5 days ago", "author": "vladimir ikic"}
{"cid": "UgwmlmW_DBdV6zqMSAt4AaABAg.8lYHaI5Y7rZ8lZt7dS7CTp", "text": "those stories can be told in clever ways.﻿", "time": "5 days ago", "author": "Henke Ria"}
{"cid": "UgwmlmW_DBdV6zqMSAt4AaABAg.8lYHaI5Y7rZ8l_QDQHk2xi", "text": "life is all about experiences.  When you're old and grey stories will most likely all be all you have left﻿", "time": "5 days ago", "author": "Hairless Sasquatch"}
{"cid": "UgwmlmW_DBdV6zqMSAt4AaABAg.8lYHaI5Y7rZ8l_n1DDx0NX", "text": "Even worse, those you can't tell. Usel;ess. It's like having a million dollars but it's in Ottoman currency﻿", "time": "5 days ago", "author": "Evan Murphy"}
{"cid": "UgwmlmW_DBdV6zqMSAt4AaABAg.8lYHaI5Y7rZ8l_v-Cwpn7a", "text": "ok?,....................﻿", "time": "5 days ago", "author": "Midnight"}
{"cid": "UgwmlmW_DBdV6zqMSAt4AaABAg.8lYHaI5Y7rZ8laoVzeVblW", "text": "Hey bat man it piderman﻿", "time": "5 days ago", "author": "Roan Evergreen"}
{"cid": "UgwmlmW_DBdV6zqMSAt4AaABAg.8lYHaI5Y7rZ8laobdG7d-Z", "text": "Micheal jay fakerr﻿", "time": "5 days ago", "author": "Roan Evergreen"}
{"cid": "UgwmlmW_DBdV6zqMSAt4AaABAg.8lYHaI5Y7rZ8lgfcgMy5br", "text": "I feel like no one itt got the joke﻿", "time": "2 days ago", "author": "Ghost LY"}
{"cid": "UgwmlmW_DBdV6zqMSAt4AaABAg.8lYHaI5Y7rZ8llidGrUYbZ", "text": "It's not glamorous. I wish vice and media would stop making it seem that way.﻿", "time": "20 hours ago", "author": "No Name"}
{"cid": "Ugw5YzaaL20BH9sadNd4AaABAg", "text": "ftp﻿", "time": "6 days ago", "author": "ʊ"}
{"cid": "UgxGruKA0J4P1K6s2wN4AaABAg", "text": "since this is going to get lost down below.... sometimes when i am in the shower i spread my butt cheeks and fart﻿", "time": "6 days ago", "author": "Mike Batman"}
{"cid": "UgxGruKA0J4P1K6s2wN4AaABAg.8lYHYjuectC8lYHgh3z2Tl", "text": "Lmao﻿", "time": "6 days ago", "author": "George Soros"}
{"cid": "UgxGruKA0J4P1K6s2wN4AaABAg.8lYHYjuectC8lYI6v-ul4z", "text": "You blatantly stick a cheeky finger up there too Mike...﻿", "time": "6 days ago", "author": "WatfordMan"}
{"cid": "UgxGruKA0J4P1K6s2wN4AaABAg.8lYHYjuectC8lYIItfHFzt", "text": "or so you thought﻿", "time": "6 days ago", "author": "Radiant"}
{"cid": "UgxGruKA0J4P1K6s2wN4AaABAg.8lYHYjuectC8lYIe-Nrim7", "text": "Liked this to send it right to the top baby!﻿", "time": "6 days ago", "author": "Rem"}
{"cid": "UgxGruKA0J4P1K6s2wN4AaABAg.8lYHYjuectC8lYJH3_8jX2", "text": "Why not just fart? Makes no sense. Gay.﻿", "time": "6 days ago", "author": "wikichris"}
{"cid": "UgxGruKA0J4P1K6s2wN4AaABAg.8lYHYjuectC8lYJaM0N7v8", "text": "Opposite for me. I push them together so that the sound is more intense﻿", "time": "6 days ago", "author": "Rapgame Tomhanks"}
{"cid": "UgxGruKA0J4P1K6s2wN4AaABAg.8lYHYjuectC8lYKYueKJn8", "text": "This seems better than doing it not in the shower tbh. Thanks for the discretion!﻿", "time": "6 days ago", "author": "weehawk"}
{"cid": "UgxGruKA0J4P1K6s2wN4AaABAg.8lYHYjuectC8lYL6v1E_a4", "text": "This comment was highlighted, everyone knows your secret, Mike.﻿", "time": "6 days ago", "author": "NoTimeToExplain"}
{"cid": "UgxGruKA0J4P1K6s2wN4AaABAg.8lYHYjuectC8lYLwgE6hrb", "text": "I do it while taking a bath, the bubbles are soothing but stinky. Kind of like a sweet and sour effect.﻿", "time": "6 days ago", "author": "Harry Ballzac"}
{"cid": "UgxGruKA0J4P1K6s2wN4AaABAg.8lYHYjuectC8lYP4s9hZZy", "text": "and feeling the water running and caressing the anus might be pleasing enough huh? lol﻿", "time": "6 days ago (edited)", "author": "ExpressYourself"}
{"cid": "UgxGruKA0J4P1K6s2wN4AaABAg.8lYHYjuectC8lYPpXJ_KWC", "text": "Mike if you move your buttcheeks back and forth very carefully,  you can play a bar from the 1812 Overture, flugel horn section .﻿", "time": "6 days ago", "author": "Sovereign Sentience"}
{"cid": "UgxGruKA0J4P1K6s2wN4AaABAg.8lYHYjuectC8lYQKEVcJMJ", "text": "I feel you brother﻿", "time": "6 days ago", "author": "Gexslayer"}
{"cid": "UgxGruKA0J4P1K6s2wN4AaABAg.8lYHYjuectC8lYT699SXSY", "text": "I need counseling after imagining that﻿", "time": "6 days ago", "author": "Sizwe. A Mabaso"}
{"cid": "UgxGruKA0J4P1K6s2wN4AaABAg.8lYHYjuectC8lYbkTt_yRz", "text": "I do that too because it makes a sound like an angry goose.﻿", "time": "6 days ago", "author": "Delamthedestroyer"}
{"cid": "UgxGruKA0J4P1K6s2wN4AaABAg.8lYHYjuectC8lYe1UTtJTW", "text": "Oh yes﻿", "time": "6 days ago", "author": "pihyv"}
{"cid": "UgxGruKA0J4P1K6s2wN4AaABAg.8lYHYjuectC8lYkCZUOWMl", "text": "😂😂😂😂😂😂😂😂😂😂﻿", "time": "6 days ago", "author": "Charlie Walter"}
{"cid": "UgxGruKA0J4P1K6s2wN4AaABAg.8lYHYjuectC8lYsVZIP7L4", "text": "Anyone else squat on their toilet seat﻿", "time": "6 days ago", "author": "Plop"}
{"cid": "UgxGruKA0J4P1K6s2wN4AaABAg.8lYHYjuectC8lZFmJzhLsm", "text": "Hahaha🤣🤣﻿", "time": "6 days ago", "author": "Brian D."}
{"cid": "UgxGruKA0J4P1K6s2wN4AaABAg.8lYHYjuectC8lZfk0AbRHR", "text": "@Plop I prefer to sit on my toilet backwards, that way I have a handy shelf for my coloring books & juice box.﻿", "time": "5 days ago", "author": "Backon Thelevel"}
{"cid": "UgxGruKA0J4P1K6s2wN4AaABAg.8lYHYjuectC8la8kyEtDuq", "text": "And how does that make you feel?﻿", "time": "5 days ago", "author": "EZ Duzit"}
{"cid": "UgxGruKA0J4P1K6s2wN4AaABAg.8lYHYjuectC8llfsYTzg_F", "text": "Why bother commenting this shit at all? You clearly copied and pasted it from whatever genius copied and pasted it themselves. Why do people think this dumb boring unfunny shit is worth posting?﻿", "time": "20 hours ago", "author": "Philip Doenau"}
{"cid": "UgxGruKA0J4P1K6s2wN4AaABAg.8lYHYjuectC8llsY3WioH5", "text": "Philip Doenau I think they find it funny because of the fart bit.﻿", "time": "18 hours ago", "author": "Lev Myshkin"}
{"cid": "Ugw_fqiaTrffF-yOKvV4AaABAg", "text": "\"My colleague disguised himself as a bag of cocaine and was consumed by the suspect. It was his last day on the job\"\n\nTragic!﻿", "time": "6 days ago", "author": "M Allsorts"}
{"cid": "Ugw_fqiaTrffF-yOKvV4AaABAg.8lYHXytlLbr8lYXDX3SUlB", "text": "M Allsorts u funny barstad﻿", "time": "6 days ago", "author": "Hip hop Era"}
{"cid": "Ugw_fqiaTrffF-yOKvV4AaABAg.8lYHXytlLbr8lYYWpIpu8Z", "text": "priceless bro ha ha ha damn.﻿", "time": "6 days ago", "author": "ghostfrequency"}
{"cid": "Ugw_fqiaTrffF-yOKvV4AaABAg.8lYHXytlLbr8lYcAbftX4j", "text": "You... you are what I've been missing my entire life.﻿", "time": "6 days ago", "author": "B. Tisdale"}
{"cid": "Ugw_fqiaTrffF-yOKvV4AaABAg.8lYHXytlLbr8lYz6wkWdl2", "text": "Good that﻿", "time": "6 days ago", "author": "Joanne porter"}
{"cid": "Ugw_fqiaTrffF-yOKvV4AaABAg.8lYHXytlLbr8lZ3oTcKa3R", "text": "Do you write for the Boosh?﻿", "time": "6 days ago", "author": "Ace Entry"}
{"cid": "Ugw_fqiaTrffF-yOKvV4AaABAg.8lYHXytlLbr8lZTzzAkpxI", "text": "I peed a little﻿", "time": "5 days ago", "author": "Kaleb Breckord"}
{"cid": "Ugw_fqiaTrffF-yOKvV4AaABAg.8lYHXytlLbr8lZpTPdscZB", "text": "Hahaha lol.﻿", "time": "5 days ago", "author": "zahier_ gaidien"}
{"cid": "Ugw_fqiaTrffF-yOKvV4AaABAg.8lYHXytlLbr8lZtXhaGK9j", "text": "Is this brass eye?﻿", "time": "5 days ago", "author": "thenoodleshop"}
{"cid": "UgxJvm4bXiw5BWMfEad4AaABAg", "text": "Third﻿", "time": "6 days ago", "author": "Kenny Martin"}
{"cid": "Ugwdlxq6TxlmDFuOf8R4AaABAg", "text": "Enjoyed this videoooo﻿", "time": "6 days ago", "author": "Queen Nef"}
{"cid": "Ugz-g-H9LynTp_FoCxJ4AaABAg", "text": "That's amazing great work ^^﻿", "time": "6 days ago", "author": "Lazarus VO"}
